 
         软件与微电子学院教职员工2005年述职报告会分别于11月28日、11月30日在大兴校区综合楼一层会议室顺利进行，学院理事、院长陈钟、理事张兴、常务副院长徐雅文、党委书记兼副院长白志强、副院长苏渭珍全部到会并听取了教职员工的述职报告。
       2015年12月25日，北京大学软件与微电子学院与北明软件有限公司合作框架协议暨奖教奖学金捐赠协议签字仪式在北京大学理科一号楼会议室举行。北明软件向北大教育基金会一次性捐赠人民币100万元设立“北京大学软件与微电子学院北明软件奖教奖学金”，用于奖励和资助我院的优秀教师和学生。
       北京大学软件与微电子学院常务副院长吴中海与北明软件有限公司董事长李锋代表双方签署了协议。北明软件CTO颜军、副总裁黄忠、总裁助理楚宁志，我院院长助理李影、综合办主任倪际航、发展办主任赵泽宇等共同见证了签字仪式。
       作为北大校友，李锋董事长深情回顾了在北大的求学岁月，感谢北大的培养，感谢北大为北明软件输送了许多优秀人才。此次设立“北京大学软件与微电子学院北明软件奖教奖学金”，是对母校的些许回报，希望以后能有更大数目的捐赠。李锋认为，做软件工程离不开与产业的紧密结合，北明软件作为一家国内领先的行业软件企业，北大软微学院作为国家示范性软件与微电子学院的领头羊，希望双方能开展全面、深入的合作。
       吴中海常务副院长代表学院感谢北明软件的慷慨捐赠，并转达了杨芙清理事长、张兴院长对北明软件捐赠的感谢。谈到双方的合作，吴中海谈了对杨院士提出的前瞻性和“零距离”的理解，“中国制造2025”对实现中国梦具有重大战略意义，迫切需要新一代信息技术的领军人才及团队，迫切需要削掉学校与企业之间的门槛，实现校企深度融合。吴中海建议，杨院士提出的“面向工业应用、软硬结合的智能化系统”可以作为双方开展合作的主要领域。
                                                       新生党员大会现场
     本次大会首先由党委书记白志强讲话。白志强书记首先代表学院向各位新生的到来表示祝贺。随后，他从学校、家长等各个角度提出了对同学们的学习和生活方面方面的感想和建议。最后，他对各位新生党员提出了几点希望，希望各位党员发挥党员的先锋模范作用，扎实做好党员的本职工作。
       随后，学生工作办公室主任王柏艳老师发言。她对各位新生党员提出了“五个一”的建议，希望各位新生党员在未来的三年中认真学习，牢记自己的党员使命。       最后，2012级学苑党支部选举面试大会正式开始。选举委员会许伟民同学向大家介绍了本次党支部面试选举大会的整体流程和学生干部选举考察委员会成员的情况。面试环节主要包括5部分，涵盖了党员的基本常识、党的基本常识、对未来工作规划、表达能力等众多方面。来自我院13个苑的36名党员依次做了精彩的自我宣讲，并回答了各评委提出的问题。选举结果将在近期予以公布。      本次大会的召开为新生党员入学后的思想、学习和生活各方面予以了明确的方向指导，为接下来学苑党支部活动的开展奠定了良好的基础。
       12月9日晚， “INTERACTIVE STORYTELLING - How to grow audiences: The art of creating technology to form organic dialogues with users”专题讲座在我院举行。本次讲座邀请到知名媒体人Herwig Kopp先生，他为同学们介绍了交互式故事的相关内容。此次讲座由对外合作办公室承办。
       Herwig介绍到，交互式故事是一种新型数字媒体模式，用户可以通过肢体动作给故事主角下命令或是指导整个叙述过程来设计或影响故事情节。交互式故事使用户能够实时地影响故事的叙述和发展。讲座围绕”Interactive Thinking”，”Interactive Arts”，”Interactive Media”三个方面展开，分别就交互式在实践中的应用、艺术文化中的交互性以及交互性和故事叙述的交叉点等内容和同学们进行了分享和交流。
       演讲过程中，Herwig先生与现场同学的幽默互动让现场的交流气氛十分活跃。讲座内容丰富，立意新颖，为同学们了解世界先进媒体理念与技术提供了一次宝贵的机会。本次讲座在热烈的讨论中圆满结束。
       1月13日下午，学院在教学楼一楼会议室召开党的群众路线教育实践活动总结大会。学院党政领导班子、教职工党员和非党员教师代表参加会议。北京大学群众路线教育实践活动第十一督导组组长李国斌、副组长王强参加会议。
       党委书记陈向群代表班子对我院开展党的群众路线教育实践活动进行了总结。按照中央精神和学校党委的要求，学院党委高度重视，精心部署，周密实施，扎实推进党的群众路线教育实践活动各项工作深入开展。学院领导班子认真总结前十年的发展成果，结合学科发展前沿和学院实际，牢牢把握学院发展方向，继承优良传统，理清发展思路，着眼全局，超前谋划，重内涵，强特色，抓创新，以作风建设的新成效汇聚推动学院发展的强大动力。
       陈书记表示，学院党委把中央精神和学校党委的要求与学院实际结合起来，在完成规定动作的同时，做好自选动作，以教育实践活动为契机，以这次教育实践活动为开端，切实解决学院事业发展，学院党建工作以及师生反应强烈的突出问题，以优良作风把师生拧成一股绳，同心同德、同舟共济，以改进党风推动教风学风建设，不断增强学院师生归属感和自豪感，为实现“一流学院”的“学院梦”而不断努力。
       会上，学院各部门负责人就本次教育活动中本部门和自身的整改分别谈了自己的感想，普遍感到本部门的服务意识增强了，教学水平提高了，工作流程规范了，整体工作状态改进了。
       学校督导组李国斌组长肯定了学院党的群众路线教育实践活动的成果，对学院在这次活动中的主动学习、认真查摆、脚踏实际、及时整改表示赞扬。
       总结大会结束后，全体参会人员对学院领导班子及成员进行了满意度测评，测评表由学校督导组收回统计。党的群众路线教育实践活动总结大会圆满结束。
       3月20日上午，北京大学软件与微电子学院在北京大学举行了与中国银监会共同开设的“金融实务”专题课程开课仪式。
       中国银监会信息科技监管部副主任李丹作为学院与中国银监会共同开设的“金融实务”课程首讲嘉宾出席了开课仪式。李丹主任以“信息科技风险监管之信息科技监管制度规范解读”为主题，为我院同学进行了精彩的授课。学院常务副院长杜鹏代表学院对李丹主任的授课表示热烈的欢迎和诚挚的感谢，对学院与中国银监会联合开设的“金融实务”系列课程的启动表达了衷心的祝贺，并对参加学习的同学提出了期望和要求，希望同学们遵守学习纪律，刻苦学习，学有所获。
 
 
 
       李主任进行了以“信息科技风险监管之信息科技监管制度规范解读”为主题的课程讲座。他介绍了银监会的监管政策，并分别对香港、英国、美国、新加坡的金融监管政策进行了详述，对我国银行监管政策与国外的银行监管政策进行了详细而深入的比较分析。李主任还详细介绍了我国金融业的监管体制、监管理念、外界评价及法律规则体系，阐述了国际主流监管模式，以典型的案例分析深入浅出的对中外银行监管模式、政策和手段进行了透澈的阐释。李丹主任的授课理论与具体案例相结合，整个上午的授课中，他还系统的讲解了银行业重要信息系统突发事件应急管理规划及其制定时的背景、银行业金融结构重要信息系统投产变更管理办法以及商业银行数据中心监管指引等相关内容。
       李丹主任的授课赢得了同学的高度好评，授课现场掌声不断。在授课结束后，同学们结合自身学习体会和感想与李主任就相关议题进行了更加深刻的探讨和交流。
   十年，探索高等工程教育新模式；十年，培养高端工程技术创新人才。2012年10月18日上午，“北京大学软件与微电子学院成立十周年暨首届工程博士研究生开学典礼”在北大英杰交流中心举行。教育部科技司副司长娄晶、国务院学位办专业学位处处长唐继卫、教育部高教司理工处处长李茂国、公安部11局副局长顾坚等领导、校友代表、合作企业及兄弟院校代表出席了此次大会。北京大学党委常务副书记、副校长张彦，秘书长杨开忠等校领导及学校各部门负责人、软件与微电子学院理事长杨芙清院士、学术委员会主任王阳元院士与学院300余名师生一起参加了此次庆典。庆典活动由软件与微电子学院党委书记白志强主持。
    大会在雄壮的国歌声中拉开帷幕。张彦首先代表学校向学院表示祝贺，对学院十年的发展进行了高度评价。他说，软微学院顺应时代发展、结合国家战略应运而生、顺势而上、独具特色、充满活力，是学校学科建设新的增长点，是北大发展工程教育和培养高层次应用性人才的重要阵地，学校对软微学院寄予厚望。希望学院紧跟学科发展的新趋势，紧扣产业发展的新需求，在教育科研、人才培养、社会服务、文化传承创新等各方面做出新的贡献，为学校加快创建世界一流大学注入更加强大的动力，以优异的成绩迎接党的十八大胜利召开。
    国务院学位办专业学位处处长唐继卫在发言中就我国专业学位建设的发展作了一个简要的回顾。他说，北京大学软微学院在过去的十年中艰苦创业、不断创新，创建了有北京大学特色的工程硕士研究生培养模式和教育管理制度，希望在工程博士的培养探索方面，创造出更加辉煌的成绩。
    教育部高教司理工处处长李茂国充分肯定了36所示范性软件学院在过去十年中所取得的成绩。他表示，创新是重中之重。软件学院之所以飞速发展，是因为它们的创新，在未来的道路上，需要继续地创新。同时，他表示将一如既往地支持示范性软件学院的发展，为我国建设信息化社会做出贡献服务。
    北京大学软件与微电子学院院长张兴在发言中分别从课程体系建设、师资队伍建设、人才培养、党政建设与保证服务、科研工作、面向行业和地区培养高端人才、国际合作办学等七个方面回顾和总结了学院十年以来的发展历程。张兴表示，软微学院将继续推进高端工程应用人才培养改革，,进一步面向产业培养人才，面向需求建设学科，面向领域凝炼方向，坚持国际合作办学，稳步扩大定向培养规模。同时，他强调学院将致力于结合工程博士培养探索工程技术领军人才培养新模式。
    学院理事长杨芙清院士作了题为《面向国家战略需求，培养工程技术领军人才》的重要报告。首先，杨院士指出，在建设创新型国家的战略大背景下，新兴信息产业急需培养能成为高端工程技术创新型人才的工程博士及其创新团队。随后，杨院士向在场嘉宾介绍了工程博士专业学位教育的相关内容，在此基础上，就北京大学工程博士培养模式的探索及构想作了详细介绍。杨芙清院士希望，学院在今后的十年发展中发挥办学优势，踏实开拓、锐意创新，不断实现新的超越，为国家高端工程技术创新人才的培养做出重要贡献。
    随后，张彦常务副书记走上台，和杨芙清院士共同为电子与信息领域工程博士教育中心揭牌。北京大学秘书长杨开忠和研究生院常务副院长王仰麟共同为软微学院和联想、IBM等10家首批企业共建的工程博士研究生工作站授牌。随后，10位首届北京大学工程博士研究生走到台上，学校导师和企业导师分别给他们佩戴了校徽和胸花。
    兄弟院校代表清华大学软件学院党委书记王建民、合作单位代表公安部11局副局长顾坚、合作企业代表IBM中国研究院院长王云、软微学院12级工程博士研究生史劲峰、校友代表张磊等分别发言，对软微学院表达了真诚的祝福。
    王阳元院士最后作了即兴讲话。王院士认为国家要更加重视实体经济的发展，这离不开工程人才的培养。他希望北京大学把工程人才培养的一系列规划写入学校的五十年规划中，学院要将全体师生员工的士气和力量凝聚起来，创造更多尖端显著的科研成果，培养更多高素质的创新型人才。最后王院士告诫全院师生“做学问要有活力，也要耐下心来”。
    十余载，风雨前行； 数磨难，砥砺成钢；承载北大百年积淀，续写软微今日辉煌。在全场人员集体合唱《歌唱祖国》中，软件与微电子学院成立十周年暨首届工程博士研究生开学典礼圆满落下帷幕。
      2009年12月19日上午，首届“国际创新与科技管理（IMOT）”研究生班开班典礼在北京大学英杰交流中心举办，白志强书记、吴中海副院长等参加了会议。开班典礼由管理与技术系副系主任窦文章教授主持。白志强书记致欢迎辞，他向学员介绍了学院成立的背景及发展方向，勉励学员抓住难得的学习机会，发扬北大精神，在学习中刻苦攀登，预祝大家学有所获。吴中海副院长在会上详细的讲解了本项目的培养方案，对学员们提出了要求并寄予希望。来自北京、内蒙、山东、山西等地的25名首届IMOT研究生班学员参加了开班典礼。
       3月14日下午，由学院研究生会主办的“北京大学软件与微电子学院软件设计大赛暨China Stars软微专场”在学院3305教室隆重开幕，本次比赛共有近20支队伍参赛，分别来自北京大学软件与微电子学院、信息科技学院、地球与空间科技学院、环境科学与工程学院等院系。北京大学软件与微电子学院学生工作办公室副主任、团委书记张强老师，Trilogy Ventures风险投资公司董事长Steve Bell等出席了此次活动。
       首先，院研究生会主席李玮同学代表主办方讲话。李玮同学认为，“创业者气质”和“软件技术”能很好地代表此次大赛参赛者所具备的特质。他希望本次大赛提供的平台能够促进参赛选手与投资方的交流合作，并最终诞生真正的企业家。
       随后，Trilogy Ventures风险投资公司董事长Steve Bell为同学们讲述了自己的创业经历，详细介绍了整个比赛的情况，并鼓励同学们不断创新创业。
       进入陈述环节，每支队伍代表各有60秒时间讲解商业计划书，并由现场的嘉宾评委进行提问和建议。随着交流不断深入，嘉宾评委引导选手们逐渐将想法变为可行的方案。
       大赛启动后，每只参赛队伍将有三天时间制作或者完善自己的产品，被VC公司选中的创业团队将进入为期三个月的孵化期。孵化期间，投资方将会为优秀团队提供资金、人力和物力支持，帮助有梦想和有能力的学生步入创业之路，最终将视情况为优秀的团队提供天使投资。大赛将会切实挑选出优秀的团队和产品，为孵化出优秀的团队和企业而努力。
 
         2005年12月13日下午，学院后勤服务中心在学院一层会议室举行部门工作会议，总结了2005年来学院的后勤服务保障工作。徐雅文常务副院长到会听取了员工的工作总结并作发言，指出后勤服务中心始终要坚持“服务第一”的理念，为学院教职员工、广大师生提供一个安定、舒适的教学、生活环境。 
         热烈祝贺我院男篮升入北大杯男子甲级联赛         此次北大杯男子篮球乙级联赛从3月22日开始比赛，持续到4月8号结束。一共12个院系参加了这次联赛。我院男篮在经历了8场比赛之后，不仅成功地升入了甲级联赛，而且勇夺了这次比赛的冠军。         此次比赛的日程安排非常紧，几乎是每隔一天一场比赛，再加上比赛安排在中午，每次来回的奔波也是非常考验队员们的体力和意志。而我们的队员们克服了种种困难，在这次比赛中顽强拼搏，不畏强敌，真正地打出了软件学院的精神风貌，实现了质的突破。队员们在队长胡劼的带领下，战胜了众多强队后成功升入甲级，圆了前两届学长的心愿，也实现了我们的目标。这次联赛的胜利是每一位队员努力拼搏的结果，是所有队员团结一心共同奋斗的结果，更是学院全力支持的结果，感谢所有支持者。        最后，请关注这些响亮的名字：李想（场外指导）张达明（后卫） 庄凝（前锋） 林岚云（前锋） 胡劼（前锋兼队长） 尤赟（前锋） 阎鹏飞（中锋） 周晓杰（前锋） 王晓东（后卫） 李金涛（后卫）许鑫（后卫） 李民（后卫） 邱磊（后卫）。
        2011年10月18日，全院师生齐聚大兴校区，共同庆贺北京大学软件与微电子学院九周岁生日。上午10时，学院成立九周年暨2010-2011学年总结表彰大会在大兴校区研发楼1410多功能厅隆重召开。    
       出席会议的有学院理事长、名誉院长杨芙清院士、王阳元院士，张兴院长、徐雅文常务副院长、白志强书记兼副院长、吴中海副院长、苏渭珍副院长以及全体教职员工。
      2010-2011学年，学院的各项工作在理事长杨芙清院士的领导下，学院全体教职员工的共同努力下，全面推进教学改革和校园建设，学院面貌发生了可喜的变化。张兴院长工作报告中肯定了学院“管理有创新、教改见成效、学生质量高、成果有突破、后勤有保障”的好成绩。
      在张兴院长总结报告之后，徐雅文常务副院长、白志强书记、吴中海副院长、苏渭珍副院长分别发言，表示过去的一年是全体教职员工求真、务实、高效工作的探索与实践，成果来之不易，将认真做好经验总结，共同努力，共同发展，共创学院美好的明天。
       杨芙清院士从学院发展战略角度做了重要讲话，她指出，北大软微学院依托北京大学综合学科优势，面向国家产业发展需求，发展交叉学科，培养实用型、复合交叉型、国际化的高端人才，全院师生员工，以国家需求为已任，以创新创业的全新精神面貌，团结奋斗在探索实践的第一线。在学校的领导下，在国家改革开放政策的环境下，在国内外合作高校、IT企业的支持下，艰难创业，取得良好的成果，学院的生源和质量不断提高，双师型师资队伍不断壮大和年轻化，服务理念深入人心，贯彻在办学的全过程中，毕业生深受企业欢迎，就业率达到100%。特别是2011年，北京大学软件工程一级学科和工程博士点申请获得国务院学位办批准，培养软件工程领域的领军人才已成为当前国家急需、产业急需，这对软微学院今后的可持续发展具有重要意义，将是今后一段时间的工作重点。
       王阳元院士也在会上做了富有哲理的即兴演讲，他说，学院是一片没有浮躁，可以全心做教学研究和培养人才的静土。他以宋代教育家胡瑷的“致天下之治者在人才，成天下之才者在教化”寄语富有朝气的教职工队伍，希望他们凝练心境，“铁肩担道义，妙手著文章”，踏踏实实地做好教学、科研工作。
       杨芙清院士、王阳元院士还为2010-2011学年先进个人颁发了证书。
    获得年度先进个人称号的有：陈燕平、褚伟杰、丁玉、沈晴霓、宋西国、俞敬松、张光红、赵泽宇、赵占波、罗正忠、刘京、周筱兰、谢国强等13人。会议对“曹健、蒋严冰、马克宣、郁莲、曹威海、曹振洲、韩薇、郝群、王海燕、俞鹏”等10人，由于工作突出、成绩显著，给予通报表扬。
      2005年12月4日，夜幕降临，华灯初上，百周年纪念大讲堂内座无虚席，大家期待已久的北京大学每年一度的传统活动项目“纪念一二•九师生歌咏比赛”如约而至。由七十多名老师和学生代表组成的我院合唱队参加了此次比赛。合唱队在王永文老师的指挥下，深情演唱了《我和我的祖国》.。而一首充满陕北风情的《山丹丹花开红艳艳》，优美婉转的女声将观众带入了黄土高坡和朴素的民间风情，合声部的抑扬顿挫，及团结一心的气势，赢得了在场观众和评委的热烈掌声，得到了充分的肯定。　　最后，我院合唱队凭借悠扬的歌声,深情的演绎,惊艳的舞台效果，以94.5分取得了三等奖的好成绩，充分展现了我院师生的风采。　　我院历来非常重视”一二•九大合唱，将其作为我院的一项精品活动。每次参加都会努力排练,全力准备,力争好成绩，已经连续两次获得第三名的好成绩。每到比赛时,无论从报名动员,歌曲选择,形式安排,到挑选领唱,指挥,教歌排练,服装选择,我院的同学都是齐心协力。学院作为我们坚强的后盾,从财力,物力,人力上都给予了极大的支持,让同学们备受鼓舞。　　回首这段走过的路程，每个同学都在为了共同的目标而努力着，我们都在感动着彼此同时又被感动着.在这段难忘的过程中,点点滴滴都已成为我们值得一生珍藏的回忆.这条路,很辛苦,但回首来时路,无怨无悔。
 
        2002年12月19日，北京大学工程硕士专业学位分会第四次会议在北京大学大兴校区召开，会议由工程硕士专业学位分会主席杨芙清院士主持，导师分别介绍了参加评审学生的论文情况，经过会议审议和无记名投票，同意188名学生授予工程硕士学位。 
       2016年1月17日，北京大学2016软微创新创业新年论坛在北京大学秋林报告厅隆重开幕。本届论坛以“引领变革时代 寻找下一个独角兽”为主题，主论坛和分论坛来自政、商、学界共五十多位嘉宾分别从金融、教育、科技以及绿色环保等不同角度，围绕创新创业深入研讨，共同展望，为社会发展建言献策。本届论坛由北京大学软件与微电子学院校友会主办。
       北京大学党委副书记叶静漪应邀发表主论坛致辞。她首先表达了对此次论坛的期待与祝福，并介绍了北京大学创新创业教育的历史以及北大校友创业的优良传统。她指出，创新已逐渐成为了北大的一种作风与办学理念，近年来北京大学努力开展创新创业教育工作，协同推进全校上下包括教务部、学工部、校友会、就业指导中心、相关院系等单位开展创新创业教育培养，形成了蓬勃向上的创新创业教育生态体系，取得了较好的成绩，这也为下一步创新创业教育奠定了很好的基础。叶静漪提出，高校创新创业工作的重点是教育，而教育的目标在于培养学生的创新创业意识，使之终生受益。在创新创业方面加强教育，应完善课程设置，促进资源整合，加强市场对接，尽可能在创新创业的大潮中为在校生和校友的创业活动以及培养创新创业能力方面提供支持与帮助。
       北京大学软件与微电子学院院长张兴随后为论坛致辞。他首先介绍了学院的发展历史，并指出：学院自成立以来，经过了十几年的前行摸索，已逐渐形成了较为完善的创新创业人才培养体系。与此同时，学院从加强素质教育、学科交叉与融合、强调互动式学习以及采用学苑式管理增强学生自我管理能力，在培养创新创业精神的优秀人才过程中不断探索。张兴表示，母校希望在创业方面取得一定成就的校友们能够经常与师弟师妹们分享自己的经验与体会，促进学院发展的同时，为社会输送更多创新创业领域的新鲜血液。
       快书包CEO徐智明进行了经验分享。徐智明先生通过剖析自己创业过程中的失败经历，提出了从自身经验中总结的用人方面的三点误区，并分享了宝贵的创业经验。
       随后，论坛举行了“2015软微创新创业之星”颁奖典礼，此次论坛有5位在创新创业方面取得优秀成绩的校友荣获“2015软微创新创业之星奖”，7位为软微创新创业方面做出突出贡献的校友荣获“2015软微创新创业特殊贡献奖”。北京大学软件与微电子学院党委书记、北京大学软件与微电子学院校友会会长陈向群作为颁奖嘉宾为获奖校友颁奖，并发表了讲话。
       北京大学校友办公室主任、北京大学校友总会秘书长李宇宁从北大的创新创业精神说起，介绍了北大校友创业活动的历史：从90年代起北大就有创业比赛，2012年，“北京大学创新创业扶持计划”项目启动，首次开设带学分的创业公选课程，随后，北京大学校友会建立北京大学创业训练营，汇集各界优秀校友，整合校友资源。可以说，北大一直在支持校友的创新创业活动。
       国务院参事汤敏教授进行了主题为“能不能不创业”的讲话，汤敏教授提出了自己对创业“不同的看法”。汤敏认为未来社会将会是个性化张扬的社会，要满足个性化消费，个性化生产，会需要很多企业。这样的企业不会很大，因为大型的企业满足不了个性化的需求。会需要更多的人来进行创业，未来，创业会变成社会必需品。现场观众反响热烈，为主会场论坛画上了圆满的句号。
       随后，北京大学软件与微电子学院副院长林慧苹作了以“软微创新创业”为主题的报告。林慧苹分享了软件与微电子学院在人才培养方面的经验与个人体会，她从学院建院定位、教育理念、学院学科设置的发展历程等方面介绍了学院的基本状况。她提到，学院的真正目标并不是让在校学生和校友都去创业，而是让他们拥有创新的思维、开拓的思路，为他们提供创新的起点。
       陈向群首先表达了对校友们的感谢，肯定了校友们对创新创业做出的贡献，并表示希望聘请这些优秀校友成为软微的创新创业导师，为在校师弟师妹指导或分享成功或失败的经验。5位“2015软微创新创业之星奖”获得者随后向在场观众分享了自己在创业道路上的经验与体会。
       本次论坛由北京大学软件与微电子学院金融信息与管理技术学科组副组长黄嵩主持。作为北大软微学院的教师和北大校友，黄嵩在论坛多个环节表达了自己对学校创新创业教育和软微校友创业的信心和肯定。
       此次论坛还结合金融教育，科技以及绿色环保等话题，在晚上举行了四场平行分论坛，与会嘉宾分别就“企业发展如何对接资本市场”、“科技创新如何变革教育”、“文化创业现在的趋势以及未来发展”、“创造未来的智能硬件”等主题进行了讨论。
         
       2005年3月19日上午，中共无锡市委书记杨卫泽一行来北京大学软件与微电子学院和学院理事长杨芙清院士、理事王阳元院士以及学院院长陈钟教授等有关同志，就利用双方优势，在无锡建设产学研基地的合作问题进行了会谈。会谈前杨卫泽书记详细参观了学院的教学实验环境和听取了理事长杨芙清院士的情况介绍。
      北京大学隆重召开2011年就业工作会议，会上我院获北京大学2011年毕业生就业工作创新集体奖和就业工作先进个人奖。
 
      北京大学校长周其凤，党委常务副书记、副校长张彦，校长助理、党办校办主任、学生工作部部长马化祥，医学部党委副书记李文胜，研究生院副院长刘明利，学生就业指导服务中心主任陈永利以及学校各职能部门领导、各院系党政负责人和就业工作负责老师近150人参加了会议。会议总结了2011年北京大学毕业生就业工作的成绩和经验，部署了2012年就业工作的目标和任务,并隆重表彰了2011年毕业生就业工作先进单位和先进个人。我院被授予“2011年毕业生就业工作创新集体”，这是软微学院第三次荣获集体荣誉称号，白志强书记代表学院领奖；许英老师被评选为“北京大学2011年毕业生就业工作先进个人”。
        会上，周其凤校长强调人才培养要服务国家战略，勉励全校各部门团结一心，协调一致，抓住毕业生就业工作的关键，努力做到“学有所用、人职匹配、人尽其才”，把全校毕业生就业工作做得更好。
      2011年是软微学院毕业生就业工作取得不菲成绩的一年。学院切实施“一把手”工程，积极组织，精心安排，创新想法，追求实效。发动和发挥全院教师、各系领导、各个部门力量参与和支持毕业生就业工作，聚全院之力促就业、保就业，实现了就业率100%，“就业单位质量高、毕业生满意度高”的“双高”好成绩。     2011年，学院共向社会输送毕业生888人。其中进机关事业单位总计287人（含高校、科研单位和军队）；国有企业138人，外资、三资企业142人、其他企业（含自主创业）279人；考取国内外学校博士、继续深造者30人。毕业生就业单位主要有：中共中央办公厅、国务院办公厅、省级人民政府、公安部、海关、安全部、银监会、证监会、国家外汇管理局、各大银行、航天航空、中石油、中石化、中移动等一大批政府部门和大型国有企业；还有英特尔、思科、甲骨文、朗讯、摩托罗拉、IBM、西门子、花旗、高盛、埃森哲、华为、中金、用友、中芯国际等一大批国内外知名企业；还有部分学生分配到高等学校和科研机构。特别提到的是软件系毕业生刘国亮同学积极响应国家号召，志存高远，顺应时代，选择到西藏工作，被北京大学树立为就业典范。
    
      
 
      2012年5月23-27日，第十五届中国北京国际科技产业博览会在中国国际展览中心拉开帷幕。我院数字艺术系学生团队产品“智铃”在此次展会上受到广泛关注。 
 
         2006年1月7日上午，北京大学软件与微电子学院2006年春季毕业典礼暨学位授予仪式在北京大学秋林报告厅举行，软件与微电子学院理事长杨芙清院士、学院院长陈钟教授、白志强和苏渭珍副院长以及学院导师出席了毕业典礼，188名毕业生被授予软件工程硕士学位。
      1月7日上午，北京大学软件与微电子学院在英杰交流中心新闻发布厅举行2012年研究生毕业典礼暨学位授予仪式。北京大学研究生院副院长刘明利教授、软件与微电子学院院长张兴教授、副院长吴中海教授、副院长苏渭珍教授、院长助理林慧苹副教授以及部分教师代表和221名毕业生参加了典礼。
      10时整，庄严的毕业典礼在国歌声中正式开始。典礼由副院长吴中海教授主持，研究生院副院长刘明利教授、院长张兴教授分别致辞。教师代表院长助理林慧苹副教授也做了讲话。他们希望同学们谨记踏实、勤奋的作风，砺练心志，带着“北大印记”尽快融入社会，发挥聪明才智，勇于担当，勇往直前！ 
     副院长苏渭珍教授宣读了《北京大学学位评定委员会关于授予工程硕士学位的决定》，经北京大学学位评定委员会第106次会议审查和表决，决定授予软件与微电子学院刘一等221位硕士研究生工程硕士学位。
     数字艺术设计专业的商乾倩同学代表2012届全体毕业生发言。言语中，充满了对领导、老师的敬意和感激。商乾倩同学表示，他们将带着梦想的翅膀，乘风破浪、奋勇前行，朝着精彩的未来启航，为母校增添荣誉，并祝愿母校不断发展壮大。
      最后，身着硕士服的毕业生从研究生院副院长刘明利教授和软微学院院长张兴教授手中接过证书。伴随着轻快的音乐和热烈的掌声，毕业典礼暨学位授予仪式圆满落下帷幕。
     建院九年来，软件与微电子学院始终按照“教书育人、管理育人、服务育人”的理念，积极为大家提供了良好的学习和生活环境，学院在管理服务、教育改革、学生质量、教学成果、后勤保障等方面都有了一定的发展，取得了喜人的成绩。学院根据产业发展需求，不断拓展人才培养类型，2011年，学院就软件工程一级学科、工程博士的申报、筹备方面作了大量工作，这对软微学院今后的可持续发展具有重要意义。目前学院已经涉及软件工程、集成电路工程等5个专业领域，研究生培养也正在从单一的工程硕士，逐步拓展到工学硕士、工学博士、工程博士。2012年10月18日是北京大学软件与微电子学院十周年院庆日，是学院发展史上的重要里程碑，届时全院师生、校友将共聚一堂，共同分享这个欢乐的时刻。
     教师代表林慧苹副教授发言
                                                              学生代表商乾倩同学发言  
            研究生院副院长刘明利教授为毕业生拨流苏
    研究生院副院长刘明利教授讲话 
   软微学院院长张兴教授讲话
      软微学院院长张兴教授为毕业生拨流苏
 
     采访手记     第一次见杨芙清院士时，我实在惊异于她的朴实与和蔼可亲，仿佛眼前的并不是那个叱咤软件业的女强人，也不是那个在熠熠生辉的"软件工程铺路人"，而只是一名普通的大学教授。而当她用如此浅显易懂的语言向我们诠释着深奥的科学哲理时，当她使得中国软件产业的未来在她的阐述下变得异样清晰时，我折服于她的大智慧；当她含着泪水为我们讲述为了事业而忽略了儿女时，当她对自己曾经的那些辉煌仅仅是淡淡的一笑而过时，我折服于她的敬业！我终于明白了，正是她朴素的学者风范，她的睿智和敬业以及她的奉献精神，再加上那伴随了杨芙清院士一生的八字箴言--"认真严谨，开拓进取"，成就了这位中国软件业之泰斗。杨芙清院士仿佛就是中国软件产业的一只青鸟，引领着中国软件产业前进的方向，飞越丛林，飞越山谷，从６０年代直到今天，还有未来。
     附：     杨芙清语录     关于软件和学科研究：     1、我这一生坚持8个字：认真严谨，开拓进取。     2、美国的软件还是很脆弱的，你说如果不是脆弱它怎么会有那么多病毒？     3、科学研究就是要抽象提炼，把复杂问题变成简单的问题，分而治之，有了简化才能有优化。     4、科学研究就是要把一层一层的神秘面纱揭掉，写论文就是告诉大家面纱是怎么揭的，按照原本研究时的步骤写出来即可。     关于软件产业：     1、把软件做成产业，就必须要解决生产力的问题，也就是说要解放劳动力。     2、软件产业的发展要靠5个方面的努力，即：政、产、学、研、用。     3、 "中国青年软件振兴计划"提出的理念很好，我觉得软件关键在于人才，软件的希望关键在于青年人才。     关于人才培养：     1、教学以学生为本，要体现在教学的各个环节。比如我觉得学校的管理部门不该叫管理部门，应该叫服务部门，要以服务于学生为本职。     2、别人说我在快到70岁的时候，找了最苦最累最难的活来干（创办北京大学软件与微电子学院），我说我这个人最喜欢挑战性工作，老想去创一点新的东西。     3、我的观念是把一件事情做起来以后，就让年轻人来接着做下去，把年轻人推到第一线。     杨芙清主要经历     1955年，杨芙清毕业于北京大学数学力学系。     1957年，杨芙清作为新中国选派的第一批留学生，前往前苏联科学院计算中心和莫斯科大学数力系学习；     1958年，杨芙清于北京大学数学力学系计算数学专业研究生毕业；     1961年，杨芙清、徐家福、闻人德泰联手撰写的《程序设计》一书问世，这是我国早期第一本有代表性的计算机程序设计通用教材；     1973年，杨芙清主持研制成功我国第一台百万次集成电路电子计算机--150机操作系统，这是由杨芙清院士主持研发的我国第一个多道运行操作系统；     1980年，杨芙清在北京大学主持了我国第一届软件工程研讨会，开创了中国软件界专题研讨软件工程的先河；     1983年，杨芙清被评为北京大学计算机学科的第一位教授；     1984年，杨芙清被批准为北京大学计算机学科的第一位博士研究生导师；     1984年，杨芙清主持研制成功DJ-240机上用XCY语言编写的DJS-200/XT2操作系统，这是我国最早用高级语言书写的操作系统；     1986年，杨芙清主持研制成功软件工程核心支撑环境BETA-85，这是我国第一个比较成型的软件工程支撑环境；     1990年，杨芙清主持研制成功第一个大规模的、综合的、通用的集成化软件工程支撑系统--青鸟I型（JB1）系统，这是我国第一个集成化软件工程环境；     1991年，杨芙清当选为中国科学院学部委员（院士）；     1995年，杨芙清院士主持研制成功中国第一个面向对象的大型软件开发环境--青鸟Ⅱ型（JB2）系统；     1997年，杨芙清院士主持研制成功基于构件/构架复用的应用系统集成（组装）环境--青鸟软件生产线系统，从管理、组织机制、技术和系统等方面为我国软件企业提供整体解决方案。
 
        12月7日下午，早稻田大学副校长江夏健一教授一行访问软件与微电子学院，苏渭珍副院长、吴中海院长助理以及相关教师出席了会议，就金融与商务的教学研究方面的问题进行了交流。
 
         近日，软件与微电子学院喜报频传，其数字艺术设计系学生作品分别在“北京电影学院第五届动画学院奖”、“首届中国学院奖”等大赛中获得多项大奖，为北京大学艺术学科跨入国内高等教育前列写下浓厚一笔。　　　　北京大学软件与微电子学院数字艺术设计系是适应我国动画产业对人才的迫切需求而设立，该系全球聘师，采用国际先进的课程体系、双语教学和学分制培养模式，培养动画、特技、影视、游戏、多媒体、广告、包装等领域的高层次、复合型、实用型、国际化数字艺术设计人才。经过2年多的发展建设，在国内外教师的辛勤工作和学生们的刻苦努力下，教学方法不断创新，教育水平稳步提高，学生创作的作品开始在国内崭露头角。送选作品分别在“北京电影学院第五届动画学院奖”、“首届中国学院奖”等大赛中获得下列奖项：　　1. 首届中国学院奖最佳技术制作奖：《种》－作者：廖莎莎、王理；指导老师：王强　　2. 首届中国学院奖最佳美术设计奖：《望夫石》－作者：赵贵胜、吴天琛、谭雷雷、李翔等　　3. 首届中国学院奖最佳视觉效果奖：《鸿》－作者：马宁洲、李明、王宁、朱江；指导老师：王强　　4. 首届中国学院奖优秀教师指导奖：王强　　5. 北京电影学院第五届动画学院奖优秀论文二等奖：《动画蒙太奇在动画电影中的应用》－作者：余丹；指导老师：王强　　6. 北京电影学院第五届动画学院奖评委会特别奖：《旅》－作者：李小牧、管筱梅、朱险峰、韩斌、张雯；指导老师：王强、Jerry.Verschoor　　7. 北京电影学院第五届动画学院奖最佳新人奖：《纤纤》－作者：李毅；指导老师：王强、Jerry.Verschoor、王伟　　8. 首届中国国际动漫节原创动漫大赛学院奖最佳动画短片奖银奖：《逝去的记忆》－作者：宋亦鹏、赵黎丹；指导老师：王强　　“中国学院奖”是国内高等教育艺术类作品顶尖级奖项，由中国艺术教育促进会、中国动画学会、中国版权保护中心、中国出版工作者协会电子与网络出版工作委员会等十多个全国性行业协会和机构共同设立和参与。首届中国学院奖涵盖多媒体、动漫、数字音乐、文艺理论四个方面。　　“北京电影学院动画学院奖(简称动画学院奖)”是由北京电影学院动画学院创立于2001年12月的专业性动画评奖活动，每年举办一届。学院奖的宗旨是鼓励与推动具有独立精神与创造性的动画创作，不断挖掘与充分展示动画作为艺术的多样性，为真正热爱动画艺术的人提供展现自我与互相交流的机会，促进动画创作中的学术发展。
　　评估会上，朱强馆长和张兴院长分别代表图书馆和软件微电子学院讲话，阐述了评估的意义和分馆建设对提升学院教学科研能力的重要性。林慧苹院长助理代表软件学院分馆从体制管理、办馆条件、信息资源建设、读者服务、信息素质教育、自动化网络化和数字化建设等方面做了自评报告。评估组通过听取报告、现场提问、听取老师和学生代表建议、现场考察等方式对软件微电子学院分馆进行了认真评估。　　评估组充分肯定软件学院领导对文献资源建设的重视，以及为分馆运行所提供的重要经费保障和规范的管理。分馆对学院的教学科研起到了重要的支持和保障作用。分馆的管理人员工作敬业，主动热情，有较高的责任心，在读者培训、学位论文数据库建设、异地还书和回溯编目方面业绩突出。同时评估组也希望软件与微电子学院分馆加大资源建设力度，丰富馆藏类型，除保障教学科研外，为学生素质教育的提高提供更多支持，并且在多媒体资源、学习研讨空间等多样化服务方面有所突破。　　为支持软件与微电子学院分馆更好的为教学科研服务，总馆将在资源建设、馆藏调拨、电子资源的检索利用、服务推广等方面给予更多的支持。
    12月21日下午，由北京大学图书馆朱强馆长和肖珑副馆长、文献典藏与分馆办潘筠主任、信息咨询部刘素清主任等7位专家组成的评估组，对软件与微电子学院进行了评估和实地考察。软件和微电子学院的张兴院长、白志强书记、吴中海副院长和林慧苹院长助理以及北大各院系分馆的馆员、软件微电子学院的教师、学生代表等共30多人参加了评估会。
      记得采访北京大学软件与微电子学院院长陈钟的时候，陈钟院长曾经这样对我们说："杨芙清院士是整个学院的总设计师，她是在设计，而我是在编程。"的确，在杨芙清院士独特而成功的教育理念的指导下，北京大学软件学院面向市场培养了一批高素质的软件人才，在同类学院中独领风骚。      然而，在创办北京大学软件与微电子学院时，杨芙清院士已近70岁。问及于此，杨芙清院士笑着对我们说："别人说我在快到70岁的时候，找了最苦最累最难的活来干，我说我这个人最喜欢挑战性工作，老想去创一点新的东西。"
 
       4月14日上午，美国国际科技大学（International Technological University，ITU）校长Yau-Gene Chan先生、电子与计算机工程系系主任May Huang教授、嵌入式教研室主任Karl Wang教授、生物电子教研室主任Dominik Schmidt教授、数字艺术系主任Wes Takahashi先生和大学关系合作专员Heyi Yuan女士到我院进行交流访问。
       Karl Wang教授和Dominik Schmidt教授作了题为“Research and Development Presentation”的报告，报告介绍了美国国际科技大学在嵌入式系统、人工智能、生物电子等方面的研究成果，分享了智能抄表系统、智能家居系统和三维空间重构系统的设计理念与思路。美国国际科技大学的几位教授，均来自硅谷工业界，他们与到场的同学分享了各自的职业规划和成长经历。座谈会气氛融洽活跃，开拓了同学们的视野，增加了对硅谷工业界的认知。
      
       演讲后，我院院长张兴教授、副院长吴中海教授、微纳电子与嵌入式系统领域学科组副组长于敦山教授就双方项目合作研究、人才联合培养等事宜交换了意见。
 
        在经历了几个月的紧张备战后，我院 “SMART FLOW” 代表队顺利杀入决赛，各代表队之间的激烈竞争于12月1日上午在北京大学国关大厦展开。此次大赛评委分别由来自于花旗集团、产业界、教育界的代表组成，其中包括花旗集团欧洲及中东区技术主管 Mr.Ian Cramb 、IBM中国研发中心首席架构师、IBM院士 王云先生、花旗软件技术服务（上海）有限公司总经理 何维忠先生、中国银联银行卡产业顾问委员会成员、中国科学院研究生院软件学院院长 潘辛平先生、复旦大学软件学院院长 臧斌宇先生等10位专家评委。在各院校代表队进行了精彩的作品演示、展示之后，专家评委于12月1日晚上给出了评审结果，并提交大赛顾问委员会审议。　　12月3日上午，花旗集团金融信息科技教育基金项目2005颁奖典礼暨第二届金融信息化人才培养论坛在北京大学国际关系大厦秋林报告厅举行。花旗银行亚洲技术中心主管曾昭河、北京大学党委副书记张彦、教育基金理事会代表沈鸿舒、教育部高等教育司副司长葛道凯为颁奖典礼先后致辞。教育基金项目顾问委员会主席、中国科学院院士杨芙清当场宣读了首届“花旗杯”科技应用大赛的最终获奖者名单。其中一、二、三等奖，分别由来自北京大学（我院代表队）、复旦大学、中国科技大学、同济大学、武汉大学和中国科学院在内的8支参赛队伍获得，其中我院 “SMART FLOW”小组作为北京大学代表队荣获二等奖。一等奖则被华中科技大学参赛队以名为“Bank-Mobile”的作品捧走。　　花旗银行集团还在现场颁发了“花旗集团金融信息科技优秀奖学金”。这一奖学金的设立主要是为了引导国内金融信息化人才培养的方向。奖励的对象为主修计算机、软件工程或金融管理专业大学生。今年全国共有80余名学生获得了奖学金，获奖学生是经过层层选拔最终入围的，其中北大共有四名学生获奖，其中我院学生高志强、陈昕两名同学荣获此优秀奖学金。　　颁奖典礼完毕后，在花旗集团的主持下，召开了金融信息化人才培养论坛，来自于政府、产业界、教育界的领导、专家分别就此主题作了精彩发言，其中我院院长陈钟教授作为教育界代表做了富有创新性思想的精彩演讲，获得了与会专家、代表的高度认可。我院作为此次活动的协办方，通过协调各方面资源，保证了此次活动的顺利举行，尤其感谢各位志愿者的努力工作，是他们的敬业负责、乐于奉献的态度保证了各方面工作的顺利开展。附：　　我院“SMART FLOW”小组名单：         张炜 张乃岳 李斌 黎鹏 谭峰　　我院志愿者名单：         武玉兰 刘荣华 李良美 孟 暾 李 殊 刘力涛 陈彦均 杨 睿 张彩虹 张 婧 段 莹
       11月29日晚，“超大流量网站的解决之道——阿里巴巴Web平台经验谈”专题讲座在大兴校区教学楼举办。阿里巴巴核心系统部朱照远先生应邀为同学们介绍技术业界相关情况。
       朱照远先生为大家介绍了阿里巴巴集团的基本概况，分析了互联网在中国的创新前景，讲解了阿里集团Web平台大体的原理及实际案例。朱照远先生还结合阿里巴巴集团的具体情况讲解了如何通过定制Web服务器、优化Web架构，搭建CDN等措施来支撑巨大的网络流量。最后，朱照远先生就同学们提出的问题给予了解答与经验分享，现场气氛十分热烈。
       本场讲座旨在帮助技术类专业同学了解业界现状、拓展视野和知识面，鼓励同学们积极与行业精英对话，为同学们更好地规划自身的职业生涯打下了良好基础。
 
　    2005年12月18日上午，中共无锡市委常委、北京大学软件与微电子学院无锡产学研基地联合筹备工作领导小组常务副组长盛克勤到北京大学大兴校区，与软件与微电子学院理事长杨芙清院士、理事王阳元院士以及学院院长陈钟教授等有关同志，就如何尽快开展无锡产学研基地建设等有关筹备工作交换了意见。
       3月26日 ,Imagine Cup 2014全球学生大赛北京大学校区赛在我院成功举办。经初步选拔，4支由软件与微电子学院同学组成的团队参加了本次比赛。软件与微电子学院副院长林慧苹、郁莲老师以及微软公司代表王艳老师出席了评审和颁奖仪式。比赛由蒋严冰老师主持。本次比赛同时作为本学期开设的微软实现技术课程的一部分，再次为选课同学带来一次生动的互动式学习机会。
       比赛中，参赛同学精心准备了PPT和项目演示视频，并对项目进行了详细的介绍。评审老师认真听取了各个项目汇报，对项目诸多方面提出质询，参赛同学则一一进行回答。比赛现场还引入了微博手机投票与评论，增强了观众的参与度与互动性。
       颁奖典礼后，林慧苹副院长对参赛情况进行了总结发言，她祝贺本次比赛取得圆满成功，肯定了本次大赛中各个团队的创意以及对新技术的钻研精神。同时，林老师针对参赛各团队的表现进行指导，并在需求把握和软件开发技术上对同学们提出了更高要求和期望。
       本次参赛的团队涉及微软最新的windows8、windows phone8、Kinect、Azure等诸多最新技术，体现了同学们对新技术的把握和综合运用能力。经过评委会公正认真的评选，微软王艳老师宣布try团队参赛的Kinect GooseGogs益智游戏获得一等奖，获得二等奖的是1110团队的创意手机游戏inkwind、Esprithippo团队的中医文化游戏中医药堂以及Paragon团队的云+端个人助理应用Cortana。之后，郁莲老师对各个团队进行了技术点评。
       Imagine Cup 微软“创新杯”全球学生大赛是目前全球规模最大、影响最广的学生科技大赛。2003 年创办以来，至今已有来自100 多个国家和地区，超过500,000 名学生参与了“创新杯”比赛和相关活动。Imagine Cup 2013微软“创新杯”设有 “世界公民”、“最佳创新”和“游戏”三个比赛项目以及Windows 8，Windows Phone和Windows Azure 三个全球挑战项目。校区赛是微软“创新杯”2013年新增的环节，旨在鼓励更多的同学参与到Imagine Cup的比赛中，通过比赛展现自己的创意和才华，通过动手实践掌握最新技术、提升相关技能，为将来就业或创业打下良好基础。
         2005年3月8日下午两点三十分，"嵌入式系统T-ENGINE技术中国论坛（2005）"在北京大学英杰交流中心阳光大厅拉开序幕。本次论坛由日本东京大学T-ENGINE研究中心、北京大学软件与微电子学院、中科院计算技术研究所、计算机世界共同主办，中国软件行业协会、计算机世界、信息产业部、中科院计算技术研究所、中国家用电器研究院等单位领导出席了论坛。来自东京大学的坂村健教授就嵌入式系统TRON（开放源代码实时操作系统内核）项目以及此项技术在汽车电子、手机、数码相机和其它数字家电等多个领域的应用进行了介绍。坂村健教授讲座之后，中国家用电器研究所邴旭卫副院长、北京大学软件与微电子学院院长陈钟教授、嵌入式系统系主任柳翔教授、中科院计算所隋雪青所长等加入了论坛，他们针对T-ENGINE技术在中国的发展和应用开展了讨论，并回答了场内听众的提问。本次论坛之后，将由东京大学派出的三名讲师在北京大学软件与微电子学院为中方学员进行为期三天的"T-ENGINE技术培训"。
       5月16日上午，北京大学软件与微电子学院第一届工会会员代表大会在学院大兴校区多功能厅举行。北京大学校长助理、校工会主席孙丽，校工会副主席迟春霞应邀莅临大会，学院党政领导班子成员、学院工会筹备小组成员以及来自学院各个部门的33位工会会员代表出席了本次大会。大会由学院党委书记陈向群主持。
       陈向群书记代表学院党政领导班子向学校工会给予的大力支持表示衷心感谢，尤其对2013年4月孙丽主席一行到学院调研之后对软微学院工会工作持续、悉心的指导和关心表示诚挚的谢意。她表示，学院召开第一次工会代表大会，意义重大，学院行政和党委会全力支持学院工会的工作，并希望学院工会在接下去的工作中，全面履行各项职能，切实把工作做好、做实，不断调动和发挥全院教职工的积极性和创造性，遇事多向校工会请示，凝心聚力，合力成金，把学院建设成为一个温馨、团结、向上的大家庭。
       随后，孙丽主席代表学校工会发表讲话。她对学院第一届工会会员代表大会的成功召开表示祝贺，对学院工会筹备小组认真细致的会议筹备工作给予了高度肯定，并对软微学院工会作为一个新成员加入北京大学工会表示欢迎。孙丽主席向在场代表讲解了工会在中国的特殊地位及作用，同大家分享了自己在学校工会多年工作的心得体会，并结合北大实际讲述了工会工作的重要意义。帮助与会人员普及和提升了工会知识，也为软件与微电子学院今后更好地开展工会工作指明了方向。
       大会依法按照既定议程，最后投票选举产生了软件与微电子学院学院第一届工会委员会9名委员。软件与微电子学院第一届工会会员代表大会的成功召开，是学院贯彻落实党的群众路线教育实践活动的整改具体措施之一，也是学院重视党群工作，调动好、发挥好全院教职员工的积极性和创造性的重要程序。学院党政领导班子将一如既往地支持学院工会工作，切实关心广大教职员工的诉求，保护教职工合法权益。
       软件与微电子学院院长助理、工会筹备小组组长张光红首先代表工会筹备小组向大会作工作报告，就学院工会代表的选举情况和工会委员会候选人推荐情况进行了回顾。张光红对筹备小组全体成员和相关工作人员扎实、细致的工作表示肯定，并希望即将通过选举产生的学院工会委员会在校工会及院党委的领导下，继续做好工会各项工作，使得工会工作再上一个新台阶。
       12月13日，北京大学软件与微电子学院校友会第二次理事大会在北京大学理科一号楼1504会议室成功召开。北京大学软件与微电子学院校友会会长陈向群，执行会长杜鹏，以及30余名校友会理事一起参加了此次大会。  
       首先，主持人向到场理事总结了校友会成立一周年来工作的开展状况。接着，到场理事成员用集体鼓掌的方式通过了增补步超、张韧禾为理事成员的决议。
       执行会长杜鹏对校友会提出下一年工作的计划。他希望校友会能够借助 “友爱杯”创新创业大赛的契机，筹办创新创业新年论坛。通过校友的积极讨论，校友会决定将在下一年筹办创新创业新年年会，组织第二届“友爱杯”创新创业大赛以及组建校友会秘书处学生联络部等。
       校友会会长陈向群对校友会年度工作计划、日常活动开展、执委会日常管理等相关事项做了相应的规划和部署。来自全国各地的校友理事都表示，将积极支持和关注学院的发展、校友的发展，努力为学院做出应有的贡献。
       1月11日上午，北京大学软件与微电子学院2014年春季毕业典礼在英杰交流中心月光厅举行。北京大学研究生院副院长高岱，软微学院院领导张兴、陈向群、吴中海、杜鹏、林慧苹与教师代表一同出席典礼，与2014届春季毕业生依依惜别。
       典礼以一段毕业视频拉开序幕，或温馨、或深情、或幽默的一幕幕场景让在场毕业生回忆起了几年软微的学习生活。这段视频是学院送给同学们的临别礼物，也是同学们对母校的一份馈赠。
       北京大学研究生院副院长高岱教授代表学校研究生院向即将毕业的131位硕士研究生表示祝贺。他说，软微学院从诞生之日起就担负着非常重要的历史责任，学院承担着探索软件、微电子及相关学科的工程技术人才培养的新模式的重任。高老师深情地和大家分享了自己学生时代的点滴回忆，并希望同学们走上工作岗位之后经常回北大看看，北大永远是大家人生路途中的加油站。
       随后，软微学院副院长吴中海教授宣读了北京大学学位委员会“关于授予软件与微电子学院131位硕士研究生工程硕士学位”的决议。
       学院教师代表林金龙教授寄语毕业生。林老师给同学们提出两点忠告：第一、同学们在离开校园之后要调整心态，以包容的态度和敢于挑战的精神使自己尽快融入社会；第二、除了掌握良好的技能外，优秀的心理素质和正确的价值观也是需要不断磨练的。
       饮水自当思源，2007级校友、有爱互动CEO胡冰和在场师弟师妹分享了自己的艰辛创业历程。他说，在学院的创新教学模式下，自己在软件技术、金融、管理等方面都得到了锻炼，为现在的创业铺下了坚实的基础。毕业生代表胡琴同学饱含深情地回忆了在软微学院度过的三年宝贵时光，表达了对学院老师的无限感激之情，以及北大人应有的历史责任和担当。
       张兴院长发表毕业致辞。张院长说，同学们应该学会忘记在北大学习带给你们的光环，忘记在学院取得的绩点。无论接下来同学们是在政府企业工作，还是出国深造，亦或是开启创业之路，都是新的开始。辉煌属于过去，可以品味，但不能就此停滞。希望大家能够再接再厉，继续努力，把你们取得的成功延续下去。同时，他希望同学们保持好奇心和时时学习的好习惯，北大软微永远是大家的人生港湾，大家随时可以回来看看。
       在庄严的学位授予仪式环节，毕业生们身穿学位服，头戴学位帽，分批走上讲台接受高岱和张兴两位老师拨穗，并一一合影留念。
       在毕业典礼开始前，学院老师与全体毕业生合影留念，瞬间的影像化为永恒的回忆，铭刻在每位毕业生的心中。
       2015年7月27日至8月17日，北京大学软件与微电子学院响应北京大学向社会共享教学资源的精神，成功举办了首期北京大学暑期创新培训班，为有志于成为创新人才的优秀青年提供了北京大学国际化学术生活和步入社会职业发展的全方位体验。来自全国六十余所高校的一百多名学员，全程积极主动身心投入，以班级为单位开展学习和研讨，以小组为单位进行调研和比赛，以个人为单位完成作业和报告，最终以商业策划案和结业展示的形式完成课程。全体学员都以高质量的达标通过考核，顺利获得北京大学结业证书，其中更有三十多位同学表现优异获得由学院领导签署的推荐信以资鼓励。课程学员更一致表示，最初参加项目的时候“因为北大所以选择软微”，经过暑期的学习和体验，深刻感到软微的学术氛围和创新魅力，将“因为软微所以选择北大”。
       7月27日，北大暑期创新培训班正式拉开帷幕。开幕仪式上，北大软件与微电子学院陈向群书记，吴中海副院长以及林慧苹副院长发表了热情洋溢的讲话，勉励同学珍惜来之不易的学习机会，学有所用，为北大争光，期望同学传承北大的历史传统，并将自己的理想与未来同国家的发展和命运紧密联系在一起，做一名真正的北大人。
       8月17日，项目闭幕式上，北大软微学院常务副院长杜鹏老师担任商业策划案评委。他对同学们的表现进行了高度评价，表达了对同学们成长成才的欣慰和对美好未来的期许，肯定了同学们一周的学习与生活，让同学们在各方面都得到了长足进步，他为同学们所获得的知识、能力、精神感到骄傲，鼓励大家在走出北大后，依旧能够不忘初心、无畏前行。参赛的各小组依次上台进行商业策划案展示，每小组各有特色，不仅是策划案吸引了大家的眼球，他们制作的PPT更是一个赛一个的精致和别出心裁。同学们的项目中既有开展“home party”厨师租赁的项目，也有建立创新型的英语培训班项目，还有校园社交app的创新。学员的创意涵盖了各行各业，从餐饮到社交，从娱乐到教育，充分展现了同学们各不相同的专业背景的活跃思维。策划案结束后，学员分组展示了结业报告，分享了各组最大的三个收获、最难忘的三个瞬间、最深刻的三个观点以及最期待的三个愿望。
       学员们普遍认为本次培训班，时间安排紧凑，内容丰富多彩，形式灵活多样。通过培训，学员们达到了相互交流、开阔眼界、培养能力、提供示范的目的。学员表示虽然来到北大只有短短的一个星期，但是北大精神却将永远存留在他们的心中，希望以后能有机会来到北大继续深造。回去以后积极思考，扎实学习，把所学的知识运用到实践中，为未来的创业之路积攒更多的力量。
       学习过程中，授课老师与同学充分交流，为同学们展示了北京大学的魅力——北京大学是享誉中外的著名学府，是莘莘学子向往的殿堂，是培养思想家、科学家、艺术家的摇篮，希望同学们能秉承北大的光荣传统，将北大精神继续发扬光大。北京大学软微学院一直探索一条多途径合作办学的管理运行之路，同时，为了培养“面向产业、面向领域、高层次、实用型、复合交叉型、国际化”的人才目标，学院与诸多国内外知名企业合作，采取“双导师”机制培养学生，积极探索“政产学研用协同创新”的高等工程教育新模式，形成了学校、企业、学生多赢的局面。
       通过学习同学们深刻认识到随着经济社会的发展，任何企业都不可避免地面临新的机遇和挑战，创业也面临着更加艰巨的挑战。而读书，是获取知识、提高素质、超越自我的重要前提和有效途径。《大学》有言，“静而后能安，安而后能虑，虑而后能得”。授课教师勉励同学们静心求学，潜心思考，为未来的事业与人生发展积累一股正能量；要求同学们“珍惜学习机会”、“圆满完成学习任务”、“ 严格遵守培训纪律”。并且作为创新人才，期待同学们还必须具有独立思考的能力和批判性思维。最后预祝全体学员们珍惜北大创造的这次难得的机会，更好地发现自己，实现自己。
       杜鹏老师鼓励大家，希望各位同学能吸收这次培训的精华，潜心思考，自我超越，以北大精神，启示于来路。“今日同窗、明日校友”，期望来自全国各地的同学们在这短短的一周时间里，不仅能够学习实战知识，而且还能结交事业发展的伙伴，在未来的创业发展道路上取得辉煌的成绩。北京大学软件与微电子学院暑期创新培训课程至此画上了圆满的句号。
       北京大学暑期创新培训班主要由精品课程、商业模拟比赛与商业策划案组成。北大软微学院顶尖老师以及各行业的创新创业领军人物带领大家一同探讨，一同学习在创新创业方面的知识，例如互联网金融，创业项目管理，创业与法律，创造力的心理学视角等多角度开拓大家对于创新创业的认识。商业模拟比赛与商业策划案以小组为单位，主要目标是通过培养和支持在校生在创业环节的能力的塑造和养成，通过对创业公司从0到1阶段各项任务的实践，以及商业计划书的撰写，全面模拟创业公司早期的重要环节，以达到“学以致用”的目的。项目期间安排了知名校友经验分享、北大校园实地考察和业界交流等新环节，给学员创造充分的交流沟通及向相关业界学习的机会，极大地丰富了学员的学习内容，努力将专业管理知识学习与企业实践相结合，真正帮助学员更加深入地理解当前我国宏观经济运行状况，充分领会创新创业的切入点，增强同学们的创新力和创业的能力。
 
       同学们普遍积极性很高，主观能动性很强，如饥似渴地学习，力求取得好成绩并拿到最终比赛的胜利。据多位同学反映，课程期间常常以小组为单位组织讨论，头脑风暴，大家在分享中学习，在疑问中探索，在知识中徜徉，为期一周的项目下来感到收获颇丰。不仅仅学到最新的创新创业方面的知识，更重要的是打开了思路，开拓了视野，与北大的顶尖教授近距离对话，与企业高管平等交流，创新培训班为大家创造如此难得的机会让他们离自己的创业梦想更近了一步。
       近日，由北京大学研究生院和北京大学研究生会举办的北京大学“学术十杰”系列活动之“论道杯”研究生学术演讲比赛决赛在校本部生命科学学院邓祐才报告厅落下帷幕，软件与微电子学院新兴交叉学科领域学科组语言工程方向2012级硕士研究生林毅超获得冠军。
       此次学术演讲比赛历时一个半月，分为初赛、复赛和决赛三轮，初赛按照理学、信息与工程学、人文学、社会科学、医学分为5个赛区，共选拔30人进入复赛，各赛区名额分配按照所包含院系人数所占全校研究生的比例决定。复赛分人文社科、理工医学两场进行，初赛、复赛阶段均采用自选题目5分钟演讲的形式，共决出10名选手晋级决赛。决赛的现场邀请到了平新乔、马伯强、査红彬、张永鹤以及李红印五位评委老师代表文社理工医等学科体系。
       决赛分为“两两PK”、“复活环节”和“即兴演讲”三个环节，其中两两PK环节围绕“学术与文明”展开，共有五个话题：社会文明、政治文明、物质文明、精神文明和生态文明，同组两位对决选手分别来自文科背景和理科背景，针对同一话题分别进行5分钟演讲，每组选手讲完后由五位评委老师现场投票，票数多者晋级决赛，另一位选手待定，等待复活。
       我院选手林毅超抽到的主题是“物质文明与学术”，他的演讲内容为通过语言信息技术看当代物质文明的发展，演讲过程中利用Google books Ngram viewer及Sketch Engine 等语料库工具对某些物质名词的检索结果，畅谈了当代物质文明的发展进程，以及在大数据互联时代下该如何记录物质文明，充分展现了软微学院应用型研究的风采。最终，以现场唯一一次五位评委全票通过的成绩直接晋级总决赛。
       据悉，北京大学研究生“学术十杰”系列活动是在北京大学研究生院和共青团北京大学委员会共同指导下，由北京大学研究生会主办的学术评选活动。“论道杯”研究生学术演讲比赛是今年在“学术十杰”活动基础上开创的新的重要组成部分，此次活动通过学术和演讲相结合的方式，提高北京大学研究生表达学术观点的能力和水平，作为全国高校首个研究生学术演讲比赛，整个活动的举办为繁荣北大学术、弘扬学术精神、促进学科交叉提供了契机。
       总决赛为一分钟即兴演讲，演讲主题为“学术也快乐”：阐述所在学科领域内的一个有趣的学术问题。林毅超用自己当前的研究给全场比赛做了一个很好的总结——“如果你有一个梦想，就让学术来承载你的梦想，这样你的学术也会很快乐”。最终，结合评委老师的评分与大众评审的现场投票，林毅超一举夺得本次“论道杯”学术演讲比赛的冠军，亚军、季军分别是来自对外汉语教育学院的陈娟和物理学院的邵鼎煜。活动的最后，各位评委老师为“十佳学术演讲家”颁发荣誉证书。
       12月18日晚19：00，“硅谷面对面——创业是一种时尚”主题讲座在大兴校区教学楼3203教室举行，同学积极响应、踊跃参加。此次讲座邀请到了“云巅”网络科技有限公司创始人CEO、前微软资深专家熊柳女士和前微软、Facebook首席架构师Daniel Walter先生作为主讲人。
       活动开始，熊柳女士首先介绍了“云巅”公司的相关发展情况，接着她和同学们分享了自己在微软总部的任职经历以及自己的创业探险过程与心得。Daniel Walter介绍了硅谷的行业现状，从专业的角度就如何把时下最流行的“创业”潮流和“云计算”概念结合起来等问题与同学们进行了深入的交流。最后是交流与互动环节，同学们提问踊跃，现场气氛十分热烈。
       活动最后，嘉宾与同学们合影留念，活动在热烈的气氛中圆满结束。此次专场讲座，为技术类、经管类等各个专业方向的同学搭建了与业界精英交流的平台，有助于同学们更好地规划自身的职业生涯，也为今后的就业与创业打下了良好的基础。
       2月20日上午，国家外国专家局中国国际人才交流基金会主任苏光明、科教文卫司副司长雷风云一行前往国家软件人才国际培训（北京）基地，在北京大学软件与微电子学院院长张兴、副院长吴中海、无锡基地主任王平、对外合作办公室主任李影的陪同下，实地考察了北京基地的发展建设进度，了解了基地建设对中高端人才的需求情况，并就引智工作举行了座谈和交流。
       调研会议上，北京基地依托单位——北京大学软件与微电子学院副院长吴中海教授首先对基地近年的建设成果进行了汇报，介绍了软微学院在国际交流合作、外专引智等方面的进展情况，并展望了北京基地的未来工作计划。其他院领导也对北京基地的建设成果和软微学院的国际化工作畅谈了感想，并与国家外专局领导进行了很好的互动交流。
       中国国际人才交流基金会主任苏光明介绍了外专局职能、日常事务、以及一些重点引智项目，同时对北京基地的工作进行了高度的肯定。北京基地作为一个国际交流与培训的基地名副其实，已经具有国内顶尖、国际一流的水平。高度赞赏了北京基地在学院领导的带领下所做的工作，促进了中国与国际相关学者就共同感兴趣的研究课题进行进一步的合作与交流，为国家在软件工程这一重要领域的发展做出了应有的贡献。
       最后，张兴院长介绍了北京基地今后的发展思路，通过全建制全方位的引进模式，以研究生培养为抓手，坚持国际化无缝链接，坚持产学研合作模式，充分发挥北京基地的辐射作用，共筑软件梦、北大梦、中国梦。
      9月3日，北京大学软件与微电子学院2012年开学典礼在北京大学大兴校区隆重举行。    上午八点整，开学典礼在庄严的国歌声中拉开帷幕。院长张兴，常务副院长徐雅文、副院长吴中海、苏渭珍等院领导出席了典礼，软微学院相关科系、职能部门负责人以及2012级新生参加了典礼。典礼由学院党委书记白志强主持。    张兴院长在开学典礼上致辞，他向新入学的同学表示热烈的欢迎和衷心的祝愿，欢迎大家成为软微大家庭的一份子。张兴院长给我院新生提了四点希望，他希望同学们在研究生阶段不仅要学习科学文化知识，更要不断掌握和改进学习方法，要思考问题，有针对性地解决问题；鼓励同学们主动学习，尽可能多地参与课题研究和项目实践，不断丰富自己的经验；告诫同学们既要积累知识的广度，也要挖掘学术的深度，在集中研究某个知识领域的过程中积累研究方法。同时，张兴院长还强调，软件与微电子领域知识更新很快，同学们要养成时刻关注和学习前沿知识的良好习惯。    教师代表、软件技术系副系主任林慧苹在发言中强调，研究生的学习是交互式的，需要更多与导师交流，她还勉励同学们培养自己做学术研究的韧劲，在坚持中进步成长。    在校生代表、2011级研究生张西晴与大家分享了她在软微学院走过的一年多时间，表达了自己对北大对软微的热爱。她希望新同学利用好研究生阶段的三年学习时间，使自己充分适应学院特有的教学方式，多探索、多实践，用踏实勤勉的态度使自己真正得到发展。    电子服务系2012级研究生杨超作为新生代表发言。他畅谈了自己对北大精神的感悟和理解，并表示，北大给予了青年学子广阔的发展空间，一定会珍惜三年的学习机会，秉承软微学院的优良传统，钻研学术、砥砺品格，不负青春的光荣使命。    开学典礼在全体师生热烈的掌声中圆满结束。北京大学软件与微电子学院全体2012级新生将从这里出发，继承北大百余年来的精神传统，肩负起北大人的责任和使命，以十周年院庆为契机，努力前行，创造一个更加美好的未来！
    中国共产党第十八次全国代表大会近日胜利闭幕。为更好地学习贯彻十八大精神，11月21日，由学院各新生党支部组织，全体学生干部在3303教室组织开展了以“做表率，强根基，创一流”为主题的学习贯彻十八大精神主题研讨会。出席出席研讨会的有北京大学党委组织部副部长孙明，学院党委书记白志强，学工办主任王柏艳，副主任郝群以及团委书记张强。会议由学生党支部书记杜微主持。
    研讨会上，北京大学党委组织部副部长孙明和院党委书记白志强分别对如何学习贯彻十八大精神做出了深刻的讲解，并为学生干部今后要进行的工作和学习提出了指导和建议。随后，学生干部代表赵玮、张博男、吴雷、张思羽分别进行发言，畅谈了对十八大精神的理解和感悟、提出自己对未来的规划以及努力做好工作的决心。    本次研讨会在同学们热烈的掌声中落下帷幕。
       12月30日上午，北京大学软件与微电子学院2013年《素质教育》课程优秀作品展评于大兴校区3302教室正式举行。15名同学现场展示了作品，并接受了学院有关领导和课程负责人等评委们的点评。
       本次参加展评的同学从全院15个苑共714名同学的期末展示考核中脱颖而出，他们展示的作品主题新颖多样，既有对历史人物与小说主角的深入阐释，也有对东西方文化差异的叩问和思考；既有对当前热点问题的分析，也有对虚拟游戏世界的探讨。展示内容丰富、视角独到，见解新奇。评委们从选题内容、表达效果、逻辑结构、礼貌仪表等多个方面对每位同学的展示分别进行了深入全面的点评，并最终评选出一等奖3名、二等奖5名、三等奖7名。
       每期讲座结束后，同学们踊跃发表读后感，反响强烈。伴随着韩光辉教授的指引，当北京城市的过去像一幅巨大的泼墨山水徐徐展开的时候，同学们对北京这座国际化大都市有了一个更加清晰的认识；而听了李晓明教授对“跨学科”和“计算思维”两个概念的讲解，同学们对网络群体与市场也有了一个更加深刻的认识，对未来市场趋势的预判也多了几分科学的依据。当中国载人航天事业的种种事迹在吴川生政委的口中娓娓道来的时候，同学们更加深刻地认识到自身综合素质的提高需要社会责任和国家荣誉的精神作为支撑。
       本学期《素质教育》课程共举办了五次讲座。每期讲座，课程负责人在甄选讲座主题、邀请业内权威方面都下足了功夫，目的就是为了让同学们在有限的课程时间内提高思想道德素养，了解和树立正确的世界观和价值观，启发创新意识和追求真理的精神，提高审美能力和管理沟通能力。
       《素质教育》课程拓展了同学们的视野，使得同学们培养了用现代科学的思维来学习、领悟和探索中国传统文化精髓的能力，提升了全院师生的综合素质，提高了北大学人的综合竞争力。
    由中国软件行业协会和马鞍山市人民政府主办，中国软件和服务外包网等承办的“2012中国（马鞍山）软件和服务外包大会”于2012年10月12日―14日在马鞍山举行，这次活动把中国软件出口（外包）领域里最优秀的20多家企业高管聚集到一起，共谋企业合作交流的契机。    本次会议举行了“2011（第八届）中国软件出口（服务外包）排行榜颁奖”仪式。吴中海副院长荣获2011年推动中国软件和服务外包发展年度杰出人物奖，学院荣获2011年推动中国软件和服务外包发展年度杰出机构奖。
       根据北京大学群众路线督导组的部署和要求，2013年12月16日上午，软微学院党政领导班子在学院B所会议室召开了专题民主生活会。北京大学第十一督导组组长李国斌及督导组成员刘亚奇出席会议并进行督导。学院院长张兴、副院长吴中海、常务副院长杜鹏、副院长林慧苹等参加了会议。会议由陈向群书记主持。 
       陈向群书记首先汇报了学院民主生活会的准备情况，接着代表学院党政领导班子汇报了对照检查材料的主要内容，认真剖析了学院领导班子在“四风”上存在的主要问题，分析了存在问题的主要原因，并提出了今后改进作风建设的努力方向和主要措施。
       会上，学院领导班子成员针对个人在“四风”方面存在的突出问题、存在问题的主要原因、今后努力方向和改进措施等方面进行自我剖析。大家敞开心扉、态度诚恳、开诚布公、意见中肯，各自从多方面查找问题、分析原因，开展批评与自我批评，并提出了今后整改措施。
       陈向群书记表示，在这次民主生活会结束后，将及时通报专题民主生活会情况。班子将从四个方面改进工作，一是继续深入开展实践活动，重视群众意见，及时处理问题；二是坚持边查边改。制订“四风”问题整改落实时间表，对群众意见做到件件有回应、有落实；三是以实践活动为契机，加强思想政治建设。在理想信念、宗旨意识、政治纪律等方面加强系统学习。通过加强沟通、增进信任、完善制度等途径加强领导班子的团结；四是坚持两手抓、两不误，把实践活动和学院工作结合起来，深入基层调研、建全规章制度、提高管理效率、加强研究高等教育发展规律，确保各项工作齐头并进。
       最后，李国斌组长针对学院领导班子民主生活会的召开情况进行了点评，充分肯定了学院群众路线教育实践活动的有效开展。他认为学院群众路线教育实践活动动作早，反应敏锐，学习活动贯彻始终，体现了用整风精神开展活动的要求，较好地运用了批评和自我批评的武器，从思想上认识到改正四风的必要性。各阶段工作有批次推进，把学习、征求意见、整改贯彻始终。同时，李国斌组长指出，接下来的整改阶段任务繁重，希望班子成员继续坚持实事求是，落实整改意见，把后续的工作做好。
     9月20日上午，由学生工作办公室副主任郝群老师带队,北京大学软件与微电子学院新生各学苑党支部书记、苑长组织全院百余学生参加了第三届孔庙国子监国学文化节的一项特色文化活动――第二届国子监儒商文化论坛。论坛在国子监彝论堂举办。     东城区区委相关领导一行莅临国子监，北京大学副校长、著名经济学家刘伟，哲学系教授陈少峰、北京师范大学哲学系教授、国学专家周桂钿，以及同仁堂集团、中国嘉德拍卖公司等知名企业的领导在论坛上进行了精彩的演讲，为兴旺文化经济献智献策。论坛由北京大学艺术学院党委副书记唐金楠主持。     第二届国子监儒商文化论坛以“国学文化与现代经济”为主题，围绕儒学、儒商精神，探讨时代转换和当代价值；整合历史文化资源，打造城市文化软实力等主题展开广泛而深入地探讨。     北京大学副校长刘伟以北大精神为核心，通过引入北大起源，阐述了北大的儒家文化。演讲中，刘校长多次肯定了软件与微电子学院的学生，对北大的理科学生充满信心，并表达了北大将跻身于世界一流大学的愿景。
    在全校喜迎党的十八大胜利召开、深入学习贯彻落实学校第十二次党代会精神之际，，软件与微电子学院第十一期党课开学典礼于11月7日中午在教学楼3303隆重举行。出席本次开学典礼的有北京大学软件与微电子学院党委书记白志强教授、学工办主任王柏艳老师、副主任郝群老师、团委书记张强老师、各学苑党支部书记以及全体入党积极分子。典礼由郝群老师主持。    典礼开始，郝群老师首先将本期党课的具体安排做了简单的介绍。接下来，白志强书记以《努力使自己成为一名先进青年》为题讲授了第一节党课。白书记首先论述了中国和世界的宏观发展局势，并结合了自身的经历为同学们讲述了中国近代发展历程的几个关键时间点，解读了“实事求是，敢创新路”的理论品质和井冈山精神，以此提出了中国需要先进青年并要努力使自己成为一名先进青年。他强调作为一名入党积极分子更要不断鞭策自己，从思想上、行动上先入党，努力使自己成为一名先进青年。最后，他对新一期的入党积极分子提出了三点希望：第一要加强政治理论学习、多关注时事动态，培养政治敏感性；第二要努力提高自身修养，特别是文化素养；第三要学会沟通，他强调提升个人魅力才是成功的关键。    开学典礼在同学们热烈的掌声中落下帷幕。
　　国家级教学成果奖与国家自然科学奖、技术发明奖、科学技术进步奖并称我国四大国家级奖励。此次评审全国共有1873个项目申报，北京大学软件与微电子学院作为教育部批准创办的35所示范性软件学院，以其创新的教育理念、创新的课程体系、创新的办学模式、创新的运做机制、创新的管理体制、以及努力开展国际国内合作赢得评审委员赞誉。此前，他们还获得了“北京大学教学成果一等奖”、“北京市教学成果一等奖”，在教育部组织的对示范性软件学院中期评估中综合评比第一，被誉为“示范中的示范”。
　　近几年，我国计算机人才培养大幅度增长，每年计算机专业毕业生超过十万之众，但学生质量有待进一步提高，示范性软件学院到底培养什么样的人？业界人士认为：“现在急缺的是懂技术、会管理的高素质人才，比如能够进行软件整体开发设计的软件设计师与系统分析师，具有国际眼光的高级项目经理等，这部分人将决定中国软件产业发展的方向和水平，决定中国将来在国际软件产业链的地位”。而北京大学软件与微电子学院学生培养目标正是朝着这个方向努力--面向领域、面向产业培养高层次、实用型、复合型、具有国际竞争力的软件人才。
　　在教学管理中，学院强调“人才培养与产业建设互动”，按照产业发展需求不断调整专业和课程设置，形成灵活的课程体系，动态的教学计划；将人文科学与前沿技术教育贯穿始终，文理渗透，全面加强素质教育，重点培养学生的创新创业精神和工程实践能力；在课程体系设置中，明确提出了多层次、多方向、多领域、模块化的课程体系。每个同学都可以根据自己的学历背景、个人爱好、职业需求来选择课程，并且通过灵活的学分制教学，设计出个人学习规划和未来发展方向。这种更具人性化、个性化的教学，利于调动学生学习的主动性，发挥他的创造力。学院通过从国际著名院校和企业聘请系主任，聘任著名外籍学者和企业专家作为国际顾问、兼职教授和专业顾问等做法，促进学科建设和课程体系与国际接轨。在已经开设的课程中采用的国际同领域前沿英文原文教材一百多套，形成了包括课程体系、技能训练、工程实践、素质教育、教学管理服务平台、教学质量保证体系在内的完整的软件工程硕士培养体系。
　　截止目前，学院已为社会输送了3届共450多名优秀毕业生，100%实现了就业，90%跨入IT企业。由于他们在校期间每个人都参加了8到10个月的实习实践活动，走上工作岗位后能够很快融入其中，许多人很短的时间就成长为PM(项目经理)。现在，北京大学软件与微电子学院已初步形成了一个学院、两个学科(软件工程学科、集成电路设计学科)、三个基地(国家软件人才国际(北京)培训基地、国家集成电路设计人才培养基地、软件工程国家工程研究中心北京工程化基地)的综合性软件与微电子人才培养实体。（文/金戈）
　　作为中国高等教育改革的实验区，北京大学软件与微电子学院走过了3年的发展历程，现设有8个系、26个专业方向，拥有100多人的专兼职教师队伍，开设出140多门专业课程，其中50%为面向产业需求的新课程，70%实行了双语教学。在校生规模超过2000人，其中95%为软件工程硕士，5%为第二学士学位学生。完成各类师资培训与人才培训2400人次，学生累计获得各级各类奖励205人次。
       2015年11月24日，国家外国专家局在武汉召开2015年国家软件与集成电路人才国际培训基地管委会会议。国家外专局、相关部委领导以及来自各省市培训基地管委会成员、相关高校、研究机构、企业和基金会代表参加了会议。国家软件与集成电路人才国际培训（北京）基地代表、北京大学软件与微电子学院常务副院长吴中海出席会议。
       国家外国专家局副局长陆明总结了基地建设工作的成果、经验和不足，肯定了各基地取得的成绩,结合国家信息产业发展战略和人才发展规划要求对基地未来的建设提出了要求与建议。
       随后，相关领域专家代表讲话。北京大学软件与微电子学院常务副院长吴中海就“国家示范性微电子学院建设思路”及“创新创业型人才培养情况”在大会上作了发言。吴中海表示，建设国家示范性微电子学院，一是要贴近产业，实现校企深度融合，深入开展产学合作协同育人 ，建立长效机制；二是要发挥北大软件与微电子学科相结合的优势，培养复合型人才。在“创新创业型人才培养情况”方面，吴中海向与会人员展示了北大软微学院部分校友创新创业的实例，并介绍了学院为适应“双创”、“四众”等国家战略需要在育人方面所采取的一系列有效措施，引起了与会人员的强烈共鸣。
 
       此次会议，进一步落实了国家关于软件与集成电路产业发展和人才培养的政策，与会领导和专家深入探讨了各培训基地未来发展方向和重点工作，将对国家软件与集成电路人才培养起到推动作用。
      10月22-23日，由软件与微电子学院曹喜信老师指导，马恺声、张立佳和马占刚等三位同学组建的创新团队在2011年ALTERA“亚洲创新设计竞赛”上崭露头角，该团队完成的“基于迭代算法的医学CT成像处理FPGA系统研究与SOC实现”项目进入本年度ALTERA“亚洲创新设计竞赛”决赛，并获得三等奖。
     据悉，Altera亚洲创新设计大赛目前已经连续举办八届，是亚太区最高荣誉的FPGA设计竞赛，大赛旨在提高学生对FPGA设计的兴趣与设计技巧，并使其创新智慧与创造能力得以发挥和实现。本次大赛从报名到决赛历时5个多月，共有来自清华大学、北京大学及台湾地区高校的近400支队伍参赛，历经初赛、复赛、决赛，最终有16支队伍获奖。
 
        4月14日至4月16日，北京大学举办了一年一度的春季校运会。有27个院系所等单位参加了比赛，我院师生在院党委书记白志强的带领下，身着鲜艳的运动服，迈着整齐的步伐走过主席台，参加了几乎所有项目的比赛，并获得了总分第八名的好成绩，充分显示出了我院师生积极向上的精神风貌和勇于拼搏的进取精神。
　　去年，厦门火炬高新区对软件园已有设施资源进行整合，成立了厦门软件促进中心，为全市软件企业提供专业化服务，包括公共技术支撑和人才服务。　　据悉，此次北京大学软件与微电子学院、厦门软件技术促进中心和厦门邦初培训中心联手实施的软件项目实训和高级研修班项目，主要是针对企事业单位的技术、管理骨干，由业内专家对进修人员进行知识与技术的更新。这两个项目的成功启动，将为我市软件行业源源不断地提供软件中高端人才，打造厦门软件业人才链，从而推动厦门软件业的发展。
     11月23日下午，软件与微电子学院召开了“学习十八 贯彻学校十二大 争创一流学院”座谈会。座谈会由学院党委书记白志强主持，张兴院长、吴中海副院长等学院领导及教职员工党员参加了座谈会。    白志强书记首先介绍了北京大学召开的关于学习贯彻十八大精神的专题讨论活动，并为学院党员解读了十八大报告中的重要理论成果及学习十八大报告的重要意义。    张兴院长结合文化强国的建设，阐述了软微学院可持续发展战略。张院长指出，人才的培养对文化强国建设是很重要的，而我们学院最重要的使命正是培养社会最急需的应用型人才，所以把学院办好也是积极践行十八大精神的具体行动。要培养高水平的人才，首先需要高水平的师资队伍，学院将采取吸引高水平的师资人才与培养现有师资人才相结合，帮助现有师资队伍做好可持续发展，从而促进学院的可持续发展。    吴中海副院长则结合学院的培养思路、办学理念等谈了自己的体会。吴院长指出，十八大报告中明确了以市场为导向、产学研相结合的技术创新体系，这些正是与软微学院的培养思路一致，软微学院在确定专业方向时都是以市场需求为导向，并且根据市场的需求动态地设置和调整专业。产学研结合也是软微学院办学理念的一个重要特点，杨芙清院士在2007年软微学院成立五周年的时候就提出了“深化改革，产学研结合，促进教学科研成果物化孵化”。另外，“牢牢把握发展实体经济”、“积极引进和用好海外人才”等精神与我们学院后十年发展规划也是相吻合的。    参会的全体党员根据自己对十八大报告的理解，结合学院的发展，结合自己的工作内容，谈了一些感想。    白志强书记在总结发言中指出，经过十年的发展，学院已经取得了很大的成绩，不只在领域内，在北京大学的兄弟院系中也得到了积极的好评，学院的每一位教职员工都为学院的建设做出了自己的贡献。在未来十年中，我们仍然要发扬埋头苦干的精神，为国家培养急需的高质量的应用型人才，为学院建设成一流学院，更是为北京大学在2018年跻身世界一流大学，做出我们应有的贡献。
      SIGGRAPH是全球最负盛名的国际图形图像专业组织机构。近日从 SIGGRAPH 获知，软件与微电子学院王珺、赖炜丹、卢云庚、朱启明四名同学原创的作品《门》（The Door）获得 SIGGRAPH2009 学生组动画竞赛一等奖，这是中国学生首次获得国际图形图像界的最高奖项。标志着北大在数字艺术专业教育领域已挤身世界一流水平。     作品《门》以计算机动画结合装置艺术的方式创作，通过装置动画这种特有的动画形式，表达出自我内心世界的矛盾。另外，夏国栋等四名同学的原创作品《灶》、李丽莎等三名同学的原创作品《飘》也入围该项国际赛事。     SIGGRAPH 2009 获奖者提名是从全球770个提交的作品中选择出来的，其中包含专业的工作室和学生的作品。SIGGRAPH2009（国际）电脑动画节将于8月3～7日在美国新奥尔良市举办，在电脑动画节期间，共有140部电影被展示，而优胜者将在大会召开期间宣布。      软件与微电子学院于2003年成立数字艺术系以来，以软件工程学科为依托，发挥北大文理综合优势，聘请高水平师资，已培养出300多名复合交叉型高端原创人才。 
      10月16日上午，北京大学与公安部联合培养2009年硕士研究生新生开学典礼在大兴校区教学楼举行。出席开学典礼的有公安部科技局刘硕副局长、北京大学软件与微电子学院吴中海副院长、姜淼院长助理等。开学典礼由院长助理姜淼主持。 
      自2003年起，北京大学已经与公安部连续合作培养了7届硕士研究生。学院的发展得到了公安部及其相关部门的大力支持。共有来自公安部系统34名同学参加了开学典礼。 
      公安部科技局刘硕副局长在开学典礼上讲话，他勉励同学们珍惜在校学习的机会，同时要求学员在校期间遵章守纪，当好学生，提高专业素质，以适应新形势下工作的需要。
      典礼上，吴中海副院长做了讲话，他对北京大学的历史做了简短回顾，对学院的现状做了介绍，希望新同学克服在职学习和研究中遇到的各种困难，主动、有效地学习，吴中海副院长还向新同学介绍了学院各系科和开设专业的情况，鼓励公安部新同学旁听其他各系的相关课程，参与学生联欢活动，融入学院这个大家庭，并预祝同学们圆满完成学业。
       在这次展览上，北京大学软件与微电子学院数字艺术系王强教授与其硕士研究生肖妍然、左梦巧、赵磊共同完成的综合材料装置艺术作品《殇》获得中国第三届舞台美术站暨视觉艺术双年展金奖；王强教授与其硕士研究生刘明亮、吴菲菲、陈露、郭艺伟共同完成的作品《运》获得中国第三届舞台美术站暨视觉艺术双年展铜奖；王强教授布面油画作品《面》获得中国第三届舞台美术站暨视觉艺术双年展戏剧人物画专题特别奖。
       由文化部艺术司与中国舞台美术学会联合主办的2015年中国第三届舞台美术展于2015年11月26日在北京798艺术区悦美术馆举行。本届展览主题为“创意空间与文化生态”，旨在提示当下“大舞美”观念的开放性，以及引发对文化发展可持续性的认知和思考。
 
 
       2015年9月19日，国内首家人力资源大数据联合实验室揭牌仪式在北京大学英杰交流中心月光厅隆重举行，北京大学软件与微电子学院院长张兴教授、副院长吴中海教授、院长助理李影教授、金融信息与管理技术领域学科组刘宏志副教授等和看准网创始人赵鹏等公司高管出席此次揭牌仪式。仪式由学院副院长吴中海教授主持。
       张兴院长致辞，他指出，软微学院有着深厚的技术积累，和看准网在人力资源大数据这样的前沿领域的合作将会对未来社会的发展起推动作用。
       随后，张兴院长和看准网创始人赵鹏共同为人力资源大数据联合实验室揭牌。
       揭牌后，看准网创始人赵鹏从自身经历说起，结合当前严峻的就业形势和其多年在人力资源领域的耕耘成果，和同学们分享了应该如何正确地面对并选择就业和创业。随后，看准网的其他高层和同学们分享了就业和创业过程中的一些切身经验，同学们提问踊跃，现场气氛十分热烈。
       陈钟院长对学院2008-2009学年的工作进行了总结。他从学院的教学改革、合作与科研、规范化运行和无锡基地建设等方面回顾了上学年学院的主要工作，充分肯定已经取得的成绩。教学质量稳步提高、毕业生就业保持良好势头和师生获奖成为学院标志性成果。陈钟院长还对下一步工作进行了部署，他表示，学院要坚持创新创业，提高教学质量和科研水平，希望在建院十周年时，学院发展能实现大的飞跃。    徐雅文常务副院长宣布2008-2009学年评优结果：郁莲、张齐勋、杨雅辉、邬国锐、赵占波、曹健、沈晴霓、马克宣、陈燕平、曹振洲、王海燕、赵泽宇、王柏艳、王永明、宋西国、王小春、周伟民、纪敬、杨家丽、邹自力、刘战奎等21人为学院“2008 - 2009学年先进个人”称号。
       10月30日，北京大学软件与微电子学院成立七周年暨2008-2009学年总结表彰大会在大兴校区教学楼3303室召开。陈钟院长、张兴常务副院长、徐雅文常务副院长、苏渭珍副院长、白志强副院长和吴中海副院长出席会议。会议由白志强副院长主持。 
                                                         学院领导为获奖代表颁奖
                                                                颁奖仪式现场
                                                                颁奖仪式现场
       北京大学软件与微电子学院是经教育部、国家计委批准成立的“国家示范性软件学院”，也是教育部和科技部设立的“国家集成电路人才培养基地”。学院设有电子与信息领域工程博士点，工程管理硕士点，软件工程、集成电路工程、项目管理、电子与通信工程、计算机技术等5个领域的工程硕士点，并且与软件工程国家工程研究中心、信息科学技术学院软件研究所合作建设软件工程一级学科博士点。
       软件与微电子学院从2002年建院起，就以“创建世界一流软件与微电子学院”为己任。学院秉承北京大学“民主科学、兼容并包”的精神，坚持北大“勤奋、严谨、求实、创新”的校风；以坚持改革开放、面向需求、质量第一为建院宗旨；以培养多层次、实用型、复合型、国际化软件与微电子人才为目标；按照企业和领域需求确定培养方向，按照产业需求不断调整专业方向，形成灵活的课程体系，动态的教学计划；按照社会主义办学方向，将人文科学与前沿技术教育贯穿始终，全面加强素质教育，重点培养学生的创新、创业精神和实践能力；学习借鉴国际人才培养经验，努力实现教学模式创新，管理体制创新，教学内容创新，课程设置创新，教学方法创新。
       为了培养高层次、实用型人才，贴近产业，北京大学软件与微电子学院经教育部批准（教高司函[2006]29号文件），选择信息技术、微电子产业高度发达的长三角地区—无锡建立了北京大学软件与微电子学院无锡产学研合作教育基地（以下简称无锡基地）。
       面向国民经济信息化建设和产业发展需要，培养学生具有扎实的工程理论基础、合理的专业知识结构、优秀的职业素养和团队精神，侧重提高学生的工程实践和管理能力，组织与协调能力，创新精神与国际竞争能力。通过课堂教学、专题研讨、案例分析、综合实践等多种形式，成长为能适应产业和技术发展要求的高素质创新型工程技术或管理人才。
       国民教育序列大学本科或本科以上毕业并取得毕业证书（一般应有学位证书），有工程实践经验者优先录取。
       研修班学习阶段为一般二年。
       采取申请-考核制录取方式。具有2014年考研成绩达到国家分数线，优先录取。
       有意报考相关硕士学位的，按相关学位的收费标准执行。具体收费按相关政策执行。
       首次考核时间计划为4月中旬，具体时间及地点详见学院网站通知。
       上课地点在北京大学大兴校区的全日制学员，由软件与微电子学院协助解决食宿，费用由学生自理；上课地点在北京大学无锡校区的全日制学员，由软件与微电子学院无锡产学研合作教育基地协助解决食宿，费用由学生自理。
       请有意参加研修班学习的学员登陆北京大学软件与微电子学院招生网（网址：http://zhaosheng.ss.pku.edu.cn），注册时请务必选择“2014年研修班招生简章”，并详细填报信息并打印《北京大学软件与微电子学院研修班报名表》，同时请将学历学位证书复印件、本科成绩单（如有考研成绩单也请提供）、身份证复印件以邮政快递（EMS）或挂号形式寄到：
       即日起开始报名，报名截止时间为： 2014年5月30日
       2014年9月上旬。具体时间另行通知
 
 
     11月13日，原微软（中国）总裁、现盛大公司总裁唐骏先生应约来我院作了题为《不断进取--未来企业领袖之路》的演讲，同学们对唐先生的到来给予了极大的关注，可容纳将近300人的教室座无虚席。唐先生从他自身的经验娓娓谈起，给大家介绍了很多他自己的感悟，他旁征博引、精彩的演讲不时博得大家的掌声。同学们的热情也给唐先生留下了深刻的印象，他表示今后有机会的话希望能再次来北大作演讲。
 
 
 
 
 
 
 
 
       12月15日晚，91金融创始人兼CEO许泽玮在软件与微电子学院3202教室为同学们作了题为“互联网金融发展趋势及创业创新”的讲座，本次讲座由软件与微电子学院学生工作办公室举办。
       讲座上，许泽玮与同学们分享了自己的人生经验及91金融的创办、发展过程，并对互联网金融的发展趋势发表了自己的见解。最后，许泽玮还对同学们提出了忠告：人要有能够安身立命的技能，还要有解决问题、处理事情的技巧。同学们通过此次讲座了解了91金融的创业过程，为今后创业之路增加了经验。
       2015年9月5日，秋雨蒙蒙之中，北京大学软件与微电子学院迎来了2015级新生入学，为确保全体学生可以顺利完成入学，软微学院在校本部、大兴校区、无锡校区分别设立工作小组，为入学新生提供了周到细致的接待工作。在三个校区紧密配合之下，软件与微电子学院圆满完成了2015级所有新生的入学工作，留下了无数精彩瞬间。迎新当天，北京大学软件与微电子学院共迎来了813名新生，其中包括硕士生726人，二学位学生69人，博士生18人。
       上午七点，虽然邱德拔体育馆外下着大雨，但场馆内各个学院的老师和志愿者们已经在迎新现场做好了准备，软微学院迎新点也已就位待命。报到的同学们陆陆续续地来到软微学院的站点报到，在现场老师和志愿者的引导和帮助下顺利完成注册。北京大学党委书记朱善璐，校长林建华等领导一行来到现场慰问。软件与微电子学院党委书记陈向群在现场陪同。
       软微学院老师和志愿者们为初来乍到的新生提供了热情周到的服务，为大家仔细讲解报到流程，为冒雨赶来的新生准备热水、毛巾等物品，同时，学院还加开了校车，以便让新生可以直达大兴校区。
       软件与微电子学院大兴校区的迎新工作是每年学院迎新的重要环节，学院大部分新生在此报到。
       9月5日上午，“京南燕园”也迎来了绵绵秋雨，同学们早早来到了现场，工作人员打开教学楼所有教室，让学生和家长在教室安顿休息。报到过程涉及学工、教务、财务、食宿等多个环节，现场工作人员紧密配合，尽量减少同学们的等待时间，迎新现场秩序井然。
       9月6日上午，学院进行了新生入学教育，刚刚放下行李的同学们怀着对研究生生活的向往，在3302和3303教室聆听了来自老师们的叮嘱。北京大学软件与微电子学院院长张兴、党委书记陈向群、常务副院长杜鹏、副院长吴中海、副院长林慧苹以及学院各学科组、职能部门的老师参加了入学教育仪式。
       在入学仪式上，张兴院长致欢迎辞，他祝贺来自五湖四海的新同学们进入北京大学软件与微电子学院学习，为学院注入了新的活力。他勉励大家以一个研究生的心态去主动探求知识，发挥更多自主性，也希望广大同学能够在研究生生涯中收获友谊和成长，真正做一名成功的北大人。林慧苹副院长向在场新生介绍了软微学院的教学成果与发展历史，并从实际出发向各位同学介绍了学院的培养体系。陈向群书记在最后的素质教育报告中指出，相比于知识的获得，同学们在研究生生涯期间，更重要的是品格的完善，身为一名北大人，更应如此，一个北大人不仅要有知识的沉积，更要有那一份来自燕园的情怀。
       在入学教育仪式上，来自学院综合办公室、教务办公室，学生工作办公室、图书馆的老师们，也就和同学们息息相关的话题，向大家进行了介绍。
       同一天，北京大学软件与微电子学院无锡校区的迎新工作也如火如荼地进行，老师们通过细致入微的服务让同学们在“江南燕园”感受到了北大的氛围，并顺利完成了迎新相关工作。
       我在软微遇见你，因为你的到来，北京大学软件与微电子学院注入了新的活力。祝愿新同学们尽快适应北大的学习与生活，创造属于自己的辉煌！软微欢迎你！
   
   在12月11日结束的2009年度IBM全国大型主机技术大赛总决赛上，我院代表北京大学参赛的三只队伍中， “Star warriors”团队凭借“碳排坝-IT能耗统一平台”团队获得了评委的一致好评，获得了最高奖-“最佳作品奖”，另外2支入围总决赛北大团队“Genius-blue”和“Transformer”也分别凭借“G-Center零售集中管理平台”和“下一代个人征信系统”的项目获得了大赛优胜奖。陈钟院长代表学院领取了IBM大学合作部授予的“2009年度教书育人”奖。这三只队伍的指导老师-信息化研究室主任邬国锐获得了“最佳指导奖”以及IBM主机大学合作项目“2009年度突出贡献奖”，这也是他连续四年获得的此项殊荣。 
       3月31日晚上，“云计算与移动互联网创新”讲座在我院成功举办。亚马逊AWS中国创业孵化和大学合作部负责人熊岳达，产品拓展经理庄富任；腾讯公司高校关系总监管刚针对该主题分别进行了讲座。吴中海副院长主持了该讲座。
       首先，亚马逊公司熊岳达、庄富仁做了“亚马逊AWS助力创业、拥抱大数据”的精彩讲座，结合AWS云计算平台的创业案例，就如何应用云计算和大数据技术进行创新创业与同学们进行了交流。
       紧接着，腾讯公司管刚先生以“从腾讯布局看移动互联网发展”为题进行了演讲，并邀请同学们参加腾讯举办的T派移动互联网创新大赛。在演讲中管刚先生进行了精彩的互动和问答，并为回答正确的同学发放了腾讯吉祥物，取得了在场同学的热烈响应。
       最后，吴中海副院长就学院创新创业平台建设，以及如何推动学院、学生、校友、企业协同创新进行了展望，并鼓励同学们踊跃参加亚马逊、腾讯、英特尔、微软、谷歌等公司组织的创新创业比赛。本次讲座取得了圆满的成功。
                                             Sun公司主任工程师Scott Rotondo
                                          陈钟院长在会上讲话
                                            
       北京大学软件与微电子学院是经教育部、国家计委批准成立的“国家示范性软件学院”，也是教育部和科技部设立的“国家集成电路人才培养基地”。学院设有电子与信息领域工程博士点，工程管理硕士点，软件工程、集成电路工程、项目管理、电子与通信工程、计算机技术等5个领域的工程硕士点，并且与软件工程国家工程研究中心、信息科学技术学院软件研究所合作建设软件工程一级学科博士点。
       软件与微电子学院从建院起，就以“创建世界一流软件与微电子学院”为己任。学院秉承北京大学“民主科学、兼容并包”的精神，坚持北大“勤奋、严谨、求实、创新”的校风；以坚持改革开放、面向需求、质量第一为建院宗旨；以培养多层次、实用型、复合型、国际化软件与微电子人才为目标；按照企业和领域需求确定培养方向，按照产业需求不断调整专业方向，形成灵活的课程体系，动态的教学计划；按照社会主义办学方向，将人文科学与前沿技术教育贯穿始终，全面加强素质教育，重点培养学生的创新、创业精神和实践能力；学习借鉴国际人才培养经验，努力实现教学模式创新，管理体制创新，教学内容创新，课程设置创新，教学方法创新。
       为了培养高层次、实用型人才，贴近产业，北京大学软件与微电子学院经教育部批准（教高司函[2006]29号文件），选择信息技术、微电子产业高度发达的长三角地区—无锡建立了北京大学软件与微电子学院无锡产学研合作教育基地（简称无锡基地）。
       2014年学院面向社会招收150名攻读软件工程专业第二学士学位学生。
       1、拥护中国共产党的领导，愿为社会主义现代化建设服务，品德良好，遵纪守法；
       2、非软件工程专业本科毕业生（含应届毕业生），有学士学位证书，具备一定的计算机基础知识，英语相当于四级以上者，均可报考；
       3、身体健康状况符合规定的体检标准。 二、招生专业       招生专业：软件工程
       招生方向：
       1、    软件开发
       3、    嵌入式软件
       4、    信息安全
       2、    软件应用技术
       5、    金融信息服务
       6、    商业与数据分析
       1、报名时间：凡是符合报考条件的学生从即日起报名；
       2、报名方式：报名采取网上报名方式。网上提交报考信息时间截至2014年5月30日；
       3、 报名手续：
       1) 考生登陆北京大学软件与微电子学院网上报名系统（网上报名主页地址: http://zhaosheng.ss.pku.edu.cn），先在网上申请用户名，并按要求录入本人信息；
       2) 认真核查报名信息，确认无误后，打印报名表一份，贴上近期一寸免冠照片，并在照片上加盖考生档案所在学校或单位人事部门公章，于2014年6月6日前随其它报名材料一同以邮政快递（EMS）或挂号形式寄往北京大学软件与微电子学院招生办公室。（北京大学理科一号楼1723N房间，邮编：100871）（以其他快递方式邮寄造成不能收取材料的后果自负）。
       3) 报名材料包括：
       （1）网上打印报名表一份；
       （2）本人身份证复印件一份；
       （3）本科毕业证书、学位证书复印件各一份（2014年的应届本科毕业生需递交学校证明，往届生与海外毕业学生需递交学位认证证书）；
       （4）大学已修课程成绩单原件（如为复印件，非应届生需加盖档案所在单位人事部门公章，应届生需加盖所在学校教务部门章）；
       （5）一寸免冠照片一张（与资格审查表所贴同底，用于办理准考证等）；
       （6）攻读第二学士学位期间本人想致力研究的问题和未来职业发展设想的陈述书；
       （8）其他能够证明个人学习、科研等方面能力的材料。
       （7）外语等级证明；
       4、申请者应对提交的所有材料的真实性负责，如有不符将取消资格。
   四、招生方式 
       招生将采用“申请-考核制”方式，即考生申请，经专家推荐，学院考核的方式。为确保选拔的公平、公正、公开，学院成立相应的招生委员会。
       申请人须按招生简章要求进行报名并提交申请材料。
       1、我院根据申请人的申请材料，进行审核，确定进入考核的候选人；
       2、考核采取面试、笔试相结合的方式进行考核，对学生的学科背景、专业素质、实践能力、外语水平、思维能力、创新能力等方面进行考察；
       3、择优确定初取名单并进行公示，报经学校批准后录取
    五、考核时间、地点 
       考核时间将根据报考学生的具体情况决定。首次考核时间和地点请考生注意学院网上通知。     六、录取            根据考生的申请材料和考核的总成绩择优录取,于2014年6月底公布录取结果并发放录取通知书。2014年应届本科毕业生可将户口和档案转入北京大学，培养费由本人负担，毕业后按我校有关规定就业。    七、入学            2014年9月入学。办理报到注册手续时，须出示本人本科毕业证书、学位证书原件，否则取消录取资格。     八、培养与管理 
       1、按照北京大学制定的软件工程第二学士学位的培养方案进行培养，并由北京大学软件与微电子学院负责学生的培养管理；
       2、培养方式为脱产学习，学生必须遵守学校的有关规定，切实保证学习时间。     九、学位授予
       完成教学计划规定的课程，成绩合格者，颁发北京大学本科毕业证书，符合学位授予条件者，授予工学学士学位。     十、 学杂费 
       学制2年，共80学分，学费总计32000元。学生可一次性交费，也可以分两次付费，新生入学时交纳20000元，第二学年性交纳12000元。     十一、 上课地点及食宿
       食宿由学院协助解决，费用由学生自理。
    十二、 联系办法 
       咨询电话：010-62767180、62767181、62767168
       地址：北京大学软件与微电子学院招生办公室（北京大学理科一号楼1723N房间）
       邮编：100871
       电子邮件： 
 
 <!--
 var prefix = '&#109;a' + 'i&#108;' + '&#116;o';
 var path = 'hr' + 'ef' + '=';
 var addy91642 = 'zh&#97;&#111;sh&#101;ng' + '&#64;';
 addy91642 = addy91642 + 'ss' + '&#46;' + 'pk&#117;' + '&#46;' + '&#101;d&#117;' + '&#46;' + 'cn';
 var addy_text91642 = 'zh&#97;&#111;sh&#101;ng' + '&#64;' + 'ss' + '&#46;' + 'pk&#117;' + '&#46;' + '&#101;d&#117;' + '&#46;' + 'cn';
 document.write('<a ' + path + '\'' + prefix + ':' + addy91642 + '\'>');
 document.write(addy_text91642);
 document.write('<\/a>');
 //-->\n 
 <!--
 document.write('<span style=\'display: none;\'>');
 //-->
 该Email地址已收到反垃圾邮件插件保护。要显示它您需要在浏览器中启用JavaScript。
 
 <!--
 document.write('</');
 document.write('span>');
 //-->
 
       软件与微电子学院主页地址：http://www.ss.pku.edu.cn
       网上报名主页地址: http://zhaosheng.ss.pku.edu.cn
                                                                                      
 
                                                                                         北京大学软件与微电子学院招生办公室
                                                                                                          2014年2月28日
     8月17日上午，北京大学党委副书记、纪律检查委员会书记于鸿君教授专程来到软件与微电子学院调研并指导工作，学院理事长杨芙清院士、学术委员会主任王阳元院士、院长张兴教授、党委书记白志强教授等院领导接待了来访。
    于鸿君副书记首先参观了研发楼、教学楼、学院展室、图书馆，他认真询问了学院近年来发展取得的成绩和遇到的困难，观看了学院的宣传板，并就学院组织管理和人才培养等方面提出了指导意见。之后，于鸿君副书记来到学生宿舍，看望了暑期留校同学，并叮嘱他们暑期外出要注意安全，在校要抓紧时间多学习。
    在随后的座谈会上，张兴院长分别从“学院过去十年的发展概况”和“未来十年的发展规划”两方面对学院进行了介绍。在谈到我院产学研结合培养人才模式时，他说，学院正积极探索政产学研用协同创新的高层次工程技术人才教育新模式，坚持德育为先、能力为重、德才兼备，并充分发挥企业参与人才培养的积极性和能动性，以此实现学院和企业的互联互动和深度合作，做到学院和企业的“无缝”链接。针对学院未来十年的发展，张兴院长具体介绍了“精品化、国际化、规模化”的战略思想，并就探索工程博士培养新模式的构想向于鸿君副书记作了汇报。
    于鸿君副书记在听取汇报后表示，软件与微电子学院的办学理念、建设成绩、创新创业等方面的一系列发展改革值得充分肯定。同时，他还用“耳目一新”一词表达了他对学院人才培养模式的感受，他指出，这是对北京大学人才培养体制的补充和贡献，应当努力深入探索和完善，进一步发挥学院特色优势。针对学院在发展过程中遇到的一些瓶颈和问题，于鸿君副书记表示，学校今后将继续全力支持软微学院的发展。
       8月14日，由中共北京市委农工委、北京市农委，北京广播电视台、北京农商银行共同主办，北京大学软件与微电子学院新兴交叉学科领域组、中央美术学院团委协办的“美丽乡村 筑梦有我”——讲述昔日抗战故事，共绘今天乡村风采月度主题活动在通州区宋庄镇大地美术馆举办。
       在纪念中国人民抗日战争暨世界反法西斯战争胜利70周年之际，“美丽乡村，筑梦有我”大型主题公益行动组委会从京郊众多乡村中遴出29个具备红色故事背景的乡村，组织主持人携手北京大学软件与微电子学院、中央美院、清华美院的多位艺术大家，以及宋庄小堡村团支部的青年画家和北京大学软件与微电子学院、中央美院的学生们共同走进曾被战火洗礼的京郊乡村采风创作，寻找可歌可泣的英雄事迹。
       软件与微电子学院新兴交叉学科领域组王伟教授应邀携手著名主持人郭伟走进房山水峪村。新农村的变化让王伟感受良多，心生感慨。王伟说：“我觉得自己很幸运也很荣幸，因为在纪念抗战胜利60周年的时候，我曾有幸参加了那次盛大的纪念活动。时隔十年，已经60岁的我又一次有幸地参与到纪念抗战胜利70周年点活动当中，意义非同。想到那些牺牲的抗日英雄，想到当时老百姓困苦的生活，所有的这些情绪，幻化出激烈的笔触，就像在打一套拳法一样，行云流水间在画布上倾泻而来。” 活动中王伟捐赠大幅写生画作，同时指导学生创作绘画8米大幅油画作品并捐赠。
       活动当天，“美丽乡村 筑梦有我”大型公益活动组委会向所有艺术家和青年艺术工作者颁发了荣誉证书，中国美术馆馆长吴为山向组委会赠送书法作品。
 
    欢聚北京，享受动漫！首届国际动漫博览会闭幕式暨中国主题日——中国学院奖颁奖典礼于2012年12月9日在北京蟹岛国际会展中心举行。我院数字艺术系参赛作品《牛仔裤鲸鱼》荣获中国学院奖二等奖，吴萧鈅的《King》获得了中国学院奖单项奖。《牛仔裤鲸鱼》是导演姚丹、三维制作周炯生、美术设计康欣、后期合成李超、音乐创作王文倩历时一年时间创作完成的。数字艺术系在此对他们表示祝贺，同时，希望本系更多作品能够在动漫界大奖赛中获得佳绩，为软件与微电子学院的发展多做贡献!
       “团结拼搏，再创佳绩！”响亮的口号响彻云霄，矫健的身姿，整齐的步伐彰显了北京大学软件与微电子学院运动健儿们昂扬向上的精神风貌。4月25、26日，北京大学迎来了第二十一届体育文化节暨2014年田径运动会。在陈向群书记的带领下，学院师生参与了本届运动会并取得骄人成绩。经过激烈角逐，总成绩为184分，列北大院系排名第4名，乙组中名列第二，成绩喜人。
       坚持凝聚力量，实力造就非凡。我们的运动健儿在运动场上飒爽英姿，挥汗如雨，不仅赛出了成绩，更加赛出了品格。在坚持不懈的努力与精诚团结的配合下，学院在以下运动项目取得优异成绩：
       男子铅球，赵瑶明，兰铁，胡乔平包揽一、二、四名；
       男子铁饼，肖伟，赵瑶明，兰铁包揽第一、二、四名；
       男子1500米，罗翔获得亚军；
       女子1500米，白洁，李文婷分获三、四名；
       男子4*400米，我院获得亚军；
       男子4*100米，我院获得小组第一、总分第四名；
       男子800米，张定法，代世喆分获二、三名；
       男子跳远，肖伟，程柯柯分获第三、第六名；
       男子100米，胡乔平，程柯柯分获第四、第五名；
       女子铅球，邵巾芮，郜景霞，王楠分获第三、四、六名；
       集体项目蛟龙出海，我院获得总分第三的成绩。
       ……
       本届运动会不仅是个人能展示的舞台，更是集体精神冶炼的熔炉；不仅是拼搏进取精神的迸发，更激发了学生对体育的爱好和对“更高、更快、更强”奥林匹克精神的理解。不畏困难、顽强拼搏的体育精神将永伴软微人，激励大家“团结拼搏，再创佳绩！”
    5月9～10日，由北京电子学会教育委员会主办的ALTERA“北京EDA/SOPC技术分会”成立大会在北京交通大学举行，同时，还举行了首届“京津地区EDA/SOPC技术应用与教学研讨会”。北京电子学会教育委员会张思东主任，美国ALTERA公司亚太区徐平波总经理，清华大学、北京大学等六所驻京高校ALTERA联合实验室的负责人等出席了会议。我院集成电路设计与工程系曹喜信副教授被任命为“北京EDA/SOPC技术分会”副主任。
    近年来，随着EDA/SOPC技术的快速发展，从事EDA/SOPC教学、设计及应用的教师及专业人士希望有一个相对稳定的学术平台，通过定期的交流、研讨、培训来进行EDA/SOPC的教学、研究和新技术推广，以达到提高北京地区EDA/SOPC技术的教学与实训水平、深化FPGA在教学科研中的应用水平的目的。
       2015年11月10日，“互联网金融产品经理大会”在北京大学英杰交流中心阳光厅隆重举行。北京大学软件与微电子学院副院长吴中海、工程管理硕士教学中心主任黄嵩和零壹财经CEO柏亮出席此次活动。
       北京大学软件与微电子学院副院长吴中海为本次大会致辞。吴中海副院长在致辞中讲到，产品经理最重要的两件事情，一是引领未来，要创造新的产品出来，二是把现有的产品更好地经营好，更好地提供服务。产品经理是互联网金融领域最重要的人才，要引领未来，同时也要把握现在。
       零壹财经CEO柏亮、大同行董事长李鑫、美利金融的高级副总裁史志隽先后发表了主题演讲。
       零壹研究院院长李耀东、联动优势助理总裁徐海东、时间戳互联网金融部总经理邢东岩、懒财网CTO李子拓、零壹研究院研究院奚玉莉就互联网产品的安全和体验进行了圆桌对话。
       宜人贷的CTO段念、掌众金融的产品副总裁朱宇分别介绍了各自公司特色的互联网产品。
       软件与微电子学院工程管理硕士教学中心主任黄嵩，介绍了学院在互联网金融与金融大数据人才培养方面的情况，并欢迎大家报考工程管理硕士。
       “团结拼搏，再创佳绩！”响亮的口号响彻云霄，矫健的身姿，整齐的步伐彰显了北京大学软件与微电子学院运动健儿们昂扬向上的精神风貌。4月25、26日，北京大学迎来了第二十一届体育文化节暨2014年田径运动会。在陈向群书记的带领下，学院师生参与了本届运动会并取得骄人成绩。经过激烈角逐，总成绩为184分，列北大院系排名第4名，乙组中名列第二，成绩喜人。
       坚持凝聚力量，实力造就非凡。我们的运动健儿在运动场上飒爽英姿，挥汗如雨，不仅赛出了成绩，更加赛出了品格。在坚持不懈的努力与精诚团结的配合下，学院在以下运动项目取得优异成绩：
       男子铅球，赵瑶明，兰铁，胡乔平包揽一、二、四名；
       男子铁饼，肖伟，赵瑶明，兰铁包揽第一、二、四名；
       男子1500米，罗翔获得亚军；
       女子1500米，白洁，李文婷分获三、四名；
       男子4*400米，我院获得亚军；
       男子4*100米，我院获得小组第一、总分第四名；
       男子800米，张定法，代世喆分获二、三名；
       男子跳远，肖伟，程柯柯分获第三、第六名；
       男子100米，胡乔平，程柯柯分获第四、第五名；
       女子铅球，邵巾芮，郜景霞，王楠分获第三、四、六名；
       集体项目蛟龙出海，我院获得总分第三的成绩。
       ……
       本届运动会不仅是个人能展示的舞台，更是集体精神冶炼的熔炉；不仅是拼搏进取精神的迸发，更激发了学生对体育的爱好和对“更高、更快、更强”奥林匹克精神的理解。不畏困难、顽强拼搏的体育精神将永伴软微人，激励大家“团结拼搏，再创佳绩！”
       5月16日上午，北京大学软件与微电子学院第一届工会会员代表大会在学院大兴校区多功能厅举行。北京大学校长助理、校工会主席孙丽，校工会副主席迟春霞应邀莅临大会，学院党政领导班子成员、学院工会筹备小组成员以及来自学院各个部门的33位工会会员代表出席了本次大会。大会由学院党委书记陈向群主持。
       软件与微电子学院院长助理、工会筹备小组组长张光红首先代表工会筹备小组向大会作工作报告，就学院工会代表的选举情况和工会委员会候选人推荐情况进行了回顾。张光红对筹备小组全体成员和相关工作人员扎实、细致的工作表示肯定，并希望即将通过选举产生的学院工会委员会在校工会及院党委的领导下，继续做好工会各项工作，使得工会工作再上一个新台阶。
       陈向群书记代表学院党政领导班子向学校工会给予的大力支持表示衷心感谢，尤其对2013年4月孙丽主席一行到学院调研之后对软微学院工会工作持续、悉心的指导和关心表示诚挚的谢意。她表示，学院召开第一次工会代表大会，意义重大，学院行政和党委会全力支持学院工会的工作，并希望学院工会在接下去的工作中，全面履行各项职能，切实把工作做好、做实，不断调动和发挥全院教职工的积极性和创造性，遇事多向校工会请示，凝心聚力，合力成金，把学院建设成为一个温馨、团结、向上的大家庭。
       随后，孙丽主席代表学校工会发表讲话。她对学院第一届工会会员代表大会的成功召开表示祝贺，对学院工会筹备小组认真细致的会议筹备工作给予了高度肯定，并对软微学院工会作为一个新成员加入北京大学工会表示欢迎。孙丽主席向在场代表讲解了工会在中国的特殊地位及作用，同大家分享了自己在学校工会多年工作的心得体会，并结合北大实际讲述了工会工作的重要意义。帮助与会人员普及和提升了工会知识，也为软件与微电子学院今后更好地开展工会工作指明了方向。
       大会依法按照既定议程，最后投票选举产生了软件与微电子学院学院第一届工会委员会9名委员。软件与微电子学院第一届工会会员代表大会的成功召开，是学院贯彻落实党的群众路线教育实践活动的整改具体措施之一，也是学院重视党群工作，调动好、发挥好全院教职员工的积极性和创造性的重要程序。学院党政领导班子将一如既往地支持学院工会工作，切实关心广大教职员工的诉求，保护教职工合法权益。
       北京大学软件与微电子学院是经教育部、国家计委批准成立的“国家示范性软件学院”，也是教育部和科技部设立的“国家集成电路人才培养基地”。学院设有电子与信息领域工程博士点，工程管理硕士点，软件工程、集成电路工程、项目管理、电子与通信工程、计算机技术等5个领域的工程硕士点，并且与软件工程国家工程研究中心、信息科学技术学院软件研究所合作建设软件工程一级学科博士点。
       软件与微电子学院从2002年建院起，就以“创建世界一流软件与微电子学院”为己任。学院秉承北京大学“民主科学、兼容并包”的精神，坚持北大“勤奋、严谨、求实、创新”的校风；以坚持改革开放、面向需求、质量第一为建院宗旨；以培养多层次、实用型、复合型、国际化软件与微电子人才为目标；按照企业和领域需求确定培养方向，按照产业需求不断调整专业方向，形成灵活的课程体系，动态的教学计划；按照社会主义办学方向，将人文科学与前沿技术教育贯穿始终，全面加强素质教育，重点培养学生的创新、创业精神和实践能力；学习借鉴国际人才培养经验，努力实现教学模式创新，管理体制创新，教学内容创新，课程设置创新，教学方法创新。
       为了培养高层次、实用型人才，贴近产业，北京大学软件与微电子学院经教育部批准（教高司函[2006]29号文件），选择信息技术、微电子产业高度发达的长三角地区—无锡建立了北京大学软件与微电子学院无锡产学研合作教育基地（以下简称无锡基地）。
       面向国民经济信息化建设和产业发展需要，培养学生具有扎实的工程理论基础、合理的专业知识结构、优秀的职业素养和团队精神，侧重提高学生的工程实践和管理能力，组织与协调能力，创新精神与国际竞争能力。通过课堂教学、专题研讨、案例分析、综合实践等多种形式，成长为能适应产业和技术发展要求的高素质创新型工程技术或管理人才。
       国民教育序列大学本科或本科以上毕业并取得毕业证书（一般应有学位证书），有工程实践经验者优先录取。
       研修班学习阶段为一般二年。
       采取申请-考核制录取方式。具有2014年考研成绩达到国家分数线，优先录取。
       首次考核时间计划为4月中旬，具体时间及地点详见学院网站通知。
       有意报考相关硕士学位的，按相关学位的收费标准执行。具体收费按相关政策执行。
       2014年9月上旬。具体时间另行通知
       上课地点在北京大学大兴校区的全日制学员，由软件与微电子学院协助解决食宿，费用由学生自理；上课地点在北京大学无锡校区的全日制学员，由软件与微电子学院无锡产学研合作教育基地协助解决食宿，费用由学生自理。
       即日起开始报名，报名截止时间为： 2014年5月30日
       请有意参加研修班学习的学员登陆北京大学软件与微电子学院招生网（网址：http://zhaosheng.ss.pku.edu.cn），注册时请务必选择“2014年研修班招生简章”，并详细填报信息并打印《北京大学软件与微电子学院研修班报名表》，同时请将学历学位证书复印件、本科成绩单（如有考研成绩单也请提供）、身份证复印件以邮政快递（EMS）或挂号形式寄到：
 
       3月20日上午，北京大学软件与微电子学院在北京大学举行了与中国银监会共同开设的“金融实务”专题课程开课仪式。
       中国银监会信息科技监管部副主任李丹作为学院与中国银监会共同开设的“金融实务”课程首讲嘉宾出席了开课仪式。李丹主任以“信息科技风险监管之信息科技监管制度规范解读”为主题，为我院同学进行了精彩的授课。学院常务副院长杜鹏代表学院对李丹主任的授课表示热烈的欢迎和诚挚的感谢，对学院与中国银监会联合开设的“金融实务”系列课程的启动表达了衷心的祝贺，并对参加学习的同学提出了期望和要求，希望同学们遵守学习纪律，刻苦学习，学有所获。
 
 
 
       李主任进行了以“信息科技风险监管之信息科技监管制度规范解读”为主题的课程讲座。他介绍了银监会的监管政策，并分别对香港、英国、美国、新加坡的金融监管政策进行了详述，对我国银行监管政策与国外的银行监管政策进行了详细而深入的比较分析。李主任还详细介绍了我国金融业的监管体制、监管理念、外界评价及法律规则体系，阐述了国际主流监管模式，以典型的案例分析深入浅出的对中外银行监管模式、政策和手段进行了透澈的阐释。李丹主任的授课理论与具体案例相结合，整个上午的授课中，他还系统的讲解了银行业重要信息系统突发事件应急管理规划及其制定时的背景、银行业金融结构重要信息系统投产变更管理办法以及商业银行数据中心监管指引等相关内容。
       李丹主任的授课赢得了同学的高度好评，授课现场掌声不断。在授课结束后，同学们结合自身学习体会和感想与李主任就相关议题进行了更加深刻的探讨和交流。
                                                                                   来源：大连日报主 题：尖峰对话--IT产业发展与教育改革时 间：7月29日上午地 点：大连东软信息技术学院主持人：中央电视台曲向东 嘉 宾：国家教育部高教司副司长葛道凯       北京大学软件学院院长陈钟       国务院发展研究中心研究员王继成       HP全球副总裁、大中国区总裁孙振耀       IBM大中华区人力资源总监郭希文女士　　学校教育有得有失 　　郭希文认为，学校教育成功的地方在于培养了学生的积极性、形成非常集中开放的教育，同时学生在学校可以加强"全球化"能力，即在学校受到分析能力和创新能力，以及最后混合的能力的培训。郭希文指出，中国的教育需要更开放一些，更有互动性。比如，在课堂上面让学生及早能够了解企业是怎么回事，在教育里面做这样类似互动式教育，启发式教育非常重要。 　　孙振耀说，学校本身对人才的要求基本上是跟其战略目标连接在一起的。学校提供了一个非常好的教育环境：包括知识的教育、学习方法的教育，也包含技能方面的训练，我觉得这样的训练，对于企业来说可以降低很多成本。学生多接受这样的训练，对我们而言是最理想的，因为我们特别需要具有特殊的知识技能的员工。　　继续教育塑造 I T人才 　　陈钟说，实际上这两年培养 I T人才的学校也在变，不是悄悄地变，而是明显地变。陈钟将学校与企业的关系概括为八个字：企业参与教育，教育理解企业，企业支持教育，教育服务企业。比如北大软件学院，有7个系，系主任全部都是从公司聘请的。他们可以用非常好的实际案例教学，学生经过这样的训练，会受到企业的欢迎。葛道凯则提出，教育是服务于不同层次，不同类型的所有企业，而对于具体的企业所需要的特定人才，这中间肯定是有差别的，不会有一一对应的关系。教育是一个大概念，分为学校教育、培训。不管怎么说主要还是打基础，学校教育是立足于培养人的基础上培养人才。从学校出来的人直接走向工作岗位完全适应企业的岗位需求，这是不现实的，中间一定要有一个桥梁，这个桥梁就是培训。培训是企业和社会的职能，是培养人才的关键。大公司可以自己培养，小公司则需要社会培训为其提供人才。对于一个企业的发展，对于一个社会的发展，除了就业前的教育之外，在一定程度上终身教育、继续教育更重要。 　　多元化教育解决 I T人才缺口 　　葛道凯指出，今年我国普通高等教育招生数字是750万人。毕业的学生99％要到企业去工作，直接为企业发展服务，这就要求高等教育的方向必须是培养更多社会需要的，而且能够适应社会发展需要的人才。 　　王继成认为，解决 I T人才缺口的问题，政策导向非常重要。比如与多元化的教育方向相配合的是对教育资源的多元评估。一个著名的企业家进入高校，怎么认定其教授、副教授的资格？能不能指导研究生？企业家从商界到学术界就有很大差别，所以我想这也是政策需要解决的问题。
       3月31日晚上，“云计算与移动互联网创新”讲座在我院成功举办。亚马逊AWS中国创业孵化和大学合作部负责人熊岳达，产品拓展经理庄富任；腾讯公司高校关系总监管刚针对该主题分别进行了讲座。吴中海副院长主持了该讲座。
       首先，亚马逊公司熊岳达、庄富仁做了“亚马逊AWS助力创业、拥抱大数据”的精彩讲座，结合AWS云计算平台的创业案例，就如何应用云计算和大数据技术进行创新创业与同学们进行了交流。
       紧接着，腾讯公司管刚先生以“从腾讯布局看移动互联网发展”为题进行了演讲，并邀请同学们参加腾讯举办的T派移动互联网创新大赛。在演讲中管刚先生进行了精彩的互动和问答，并为回答正确的同学发放了腾讯吉祥物，取得了在场同学的热烈响应。
       最后，吴中海副院长就学院创新创业平台建设，以及如何推动学院、学生、校友、企业协同创新进行了展望，并鼓励同学们踊跃参加亚马逊、腾讯、英特尔、微软、谷歌等公司组织的创新创业比赛。本次讲座取得了圆满的成功。
    2004年7月28日，“第二届中国国际软件和信息服务交易会”在大连举办，学院应邀参会。中共中央政治局委员、国务院副总理吴仪（中）、教育部部长周济（右一）亲临学院展位参观，并对北京大学软件与微电子学院的办学成果表示了称赞。图为学院陈钟院长（左一）向吴仪副总理一行介绍北京大学软件与微电子学院办学情况。
       12月30日上午，北京大学软件与微电子学院2013年《素质教育》课程优秀作品展评于大兴校区3302教室正式举行。15名同学现场展示了作品，并接受了学院有关领导和课程负责人等评委们的点评。
       本次参加展评的同学从全院15个苑共714名同学的期末展示考核中脱颖而出，他们展示的作品主题新颖多样，既有对历史人物与小说主角的深入阐释，也有对东西方文化差异的叩问和思考；既有对当前热点问题的分析，也有对虚拟游戏世界的探讨。展示内容丰富、视角独到，见解新奇。评委们从选题内容、表达效果、逻辑结构、礼貌仪表等多个方面对每位同学的展示分别进行了深入全面的点评，并最终评选出一等奖3名、二等奖5名、三等奖7名。
       本学期《素质教育》课程共举办了五次讲座。每期讲座，课程负责人在甄选讲座主题、邀请业内权威方面都下足了功夫，目的就是为了让同学们在有限的课程时间内提高思想道德素养，了解和树立正确的世界观和价值观，启发创新意识和追求真理的精神，提高审美能力和管理沟通能力。
       每期讲座结束后，同学们踊跃发表读后感，反响强烈。伴随着韩光辉教授的指引，当北京城市的过去像一幅巨大的泼墨山水徐徐展开的时候，同学们对北京这座国际化大都市有了一个更加清晰的认识；而听了李晓明教授对“跨学科”和“计算思维”两个概念的讲解，同学们对网络群体与市场也有了一个更加深刻的认识，对未来市场趋势的预判也多了几分科学的依据。当中国载人航天事业的种种事迹在吴川生政委的口中娓娓道来的时候，同学们更加深刻地认识到自身综合素质的提高需要社会责任和国家荣誉的精神作为支撑。
       《素质教育》课程拓展了同学们的视野，使得同学们培养了用现代科学的思维来学习、领悟和探索中国传统文化精髓的能力，提升了全院师生的综合素质，提高了北大学人的综合竞争力。
       12月18日晚19：00，“硅谷面对面——创业是一种时尚”主题讲座在大兴校区教学楼3203教室举行，同学积极响应、踊跃参加。此次讲座邀请到了“云巅”网络科技有限公司创始人CEO、前微软资深专家熊柳女士和前微软、Facebook首席架构师Daniel Walter先生作为主讲人。
       活动开始，熊柳女士首先介绍了“云巅”公司的相关发展情况，接着她和同学们分享了自己在微软总部的任职经历以及自己的创业探险过程与心得。Daniel Walter介绍了硅谷的行业现状，从专业的角度就如何把时下最流行的“创业”潮流和“云计算”概念结合起来等问题与同学们进行了深入的交流。最后是交流与互动环节，同学们提问踊跃，现场气氛十分热烈。
       活动最后，嘉宾与同学们合影留念，活动在热烈的气氛中圆满结束。此次专场讲座，为技术类、经管类等各个专业方向的同学搭建了与业界精英交流的平台，有助于同学们更好地规划自身的职业生涯，也为今后的就业与创业打下了良好的基础。
       朱照远先生为大家介绍了阿里巴巴集团的基本概况，分析了互联网在中国的创新前景，讲解了阿里集团Web平台大体的原理及实际案例。朱照远先生还结合阿里巴巴集团的具体情况讲解了如何通过定制Web服务器、优化Web架构，搭建CDN等措施来支撑巨大的网络流量。最后，朱照远先生就同学们提出的问题给予了解答与经验分享，现场气氛十分热烈。
       本场讲座旨在帮助技术类专业同学了解业界现状、拓展视野和知识面，鼓励同学们积极与行业精英对话，为同学们更好地规划自身的职业生涯打下了良好基础。
       根据北京大学群众路线督导组的部署和要求，2013年12月16日上午，软微学院党政领导班子在学院B所会议室召开了专题民主生活会。北京大学第十一督导组组长李国斌及督导组成员刘亚奇出席会议并进行督导。学院院长张兴、副院长吴中海、常务副院长杜鹏、副院长林慧苹等参加了会议。会议由陈向群书记主持。 
       陈向群书记首先汇报了学院民主生活会的准备情况，接着代表学院党政领导班子汇报了对照检查材料的主要内容，认真剖析了学院领导班子在“四风”上存在的主要问题，分析了存在问题的主要原因，并提出了今后改进作风建设的努力方向和主要措施。
       会上，学院领导班子成员针对个人在“四风”方面存在的突出问题、存在问题的主要原因、今后努力方向和改进措施等方面进行自我剖析。大家敞开心扉、态度诚恳、开诚布公、意见中肯，各自从多方面查找问题、分析原因，开展批评与自我批评，并提出了今后整改措施。
       陈向群书记表示，在这次民主生活会结束后，将及时通报专题民主生活会情况。班子将从四个方面改进工作，一是继续深入开展实践活动，重视群众意见，及时处理问题；二是坚持边查边改。制订“四风”问题整改落实时间表，对群众意见做到件件有回应、有落实；三是以实践活动为契机，加强思想政治建设。在理想信念、宗旨意识、政治纪律等方面加强系统学习。通过加强沟通、增进信任、完善制度等途径加强领导班子的团结；四是坚持两手抓、两不误，把实践活动和学院工作结合起来，深入基层调研、建全规章制度、提高管理效率、加强研究高等教育发展规律，确保各项工作齐头并进。
       11月29日晚，“超大流量网站的解决之道——阿里巴巴Web平台经验谈”专题讲座在大兴校区教学楼举办。阿里巴巴核心系统部朱照远先生应邀为同学们介绍技术业界相关情况。
       最后，李国斌组长针对学院领导班子民主生活会的召开情况进行了点评，充分肯定了学院群众路线教育实践活动的有效开展。他认为学院群众路线教育实践活动动作早，反应敏锐，学习活动贯彻始终，体现了用整风精神开展活动的要求，较好地运用了批评和自我批评的武器，从思想上认识到改正四风的必要性。各阶段工作有批次推进，把学习、征求意见、整改贯彻始终。同时，李国斌组长指出，接下来的整改阶段任务繁重，希望班子成员继续坚持实事求是，落实整改意见，把后续的工作做好。
    中国共产党第十八次全国代表大会近日胜利闭幕。为更好地学习贯彻十八大精神，11月21日，由学院各新生党支部组织，全体学生干部在3303教室组织开展了以“做表率，强根基，创一流”为主题的学习贯彻十八大精神主题研讨会。出席出席研讨会的有北京大学党委组织部副部长孙明，学院党委书记白志强，学工办主任王柏艳，副主任郝群以及团委书记张强。会议由学生党支部书记杜微主持。
    研讨会上，北京大学党委组织部副部长孙明和院党委书记白志强分别对如何学习贯彻十八大精神做出了深刻的讲解，并为学生干部今后要进行的工作和学习提出了指导和建议。随后，学生干部代表赵玮、张博男、吴雷、张思羽分别进行发言，畅谈了对十八大精神的理解和感悟、提出自己对未来的规划以及努力做好工作的决心。    本次研讨会在同学们热烈的掌声中落下帷幕。
     11月23日下午，软件与微电子学院召开了“学习十八 贯彻学校十二大 争创一流学院”座谈会。座谈会由学院党委书记白志强主持，张兴院长、吴中海副院长等学院领导及教职员工党员参加了座谈会。    白志强书记首先介绍了北京大学召开的关于学习贯彻十八大精神的专题讨论活动，并为学院党员解读了十八大报告中的重要理论成果及学习十八大报告的重要意义。    张兴院长结合文化强国的建设，阐述了软微学院可持续发展战略。张院长指出，人才的培养对文化强国建设是很重要的，而我们学院最重要的使命正是培养社会最急需的应用型人才，所以把学院办好也是积极践行十八大精神的具体行动。要培养高水平的人才，首先需要高水平的师资队伍，学院将采取吸引高水平的师资人才与培养现有师资人才相结合，帮助现有师资队伍做好可持续发展，从而促进学院的可持续发展。    吴中海副院长则结合学院的培养思路、办学理念等谈了自己的体会。吴院长指出，十八大报告中明确了以市场为导向、产学研相结合的技术创新体系，这些正是与软微学院的培养思路一致，软微学院在确定专业方向时都是以市场需求为导向，并且根据市场的需求动态地设置和调整专业。产学研结合也是软微学院办学理念的一个重要特点，杨芙清院士在2007年软微学院成立五周年的时候就提出了“深化改革，产学研结合，促进教学科研成果物化孵化”。另外，“牢牢把握发展实体经济”、“积极引进和用好海外人才”等精神与我们学院后十年发展规划也是相吻合的。    参会的全体党员根据自己对十八大报告的理解，结合学院的发展，结合自己的工作内容，谈了一些感想。    白志强书记在总结发言中指出，经过十年的发展，学院已经取得了很大的成绩，不只在领域内，在北京大学的兄弟院系中也得到了积极的好评，学院的每一位教职员工都为学院的建设做出了自己的贡献。在未来十年中，我们仍然要发扬埋头苦干的精神，为国家培养急需的高质量的应用型人才，为学院建设成一流学院，更是为北京大学在2018年跻身世界一流大学，做出我们应有的贡献。
    由中国软件行业协会和马鞍山市人民政府主办，中国软件和服务外包网等承办的“2012中国（马鞍山）软件和服务外包大会”于2012年10月12日―14日在马鞍山举行，这次活动把中国软件出口（外包）领域里最优秀的20多家企业高管聚集到一起，共谋企业合作交流的契机。    本次会议举行了“2011（第八届）中国软件出口（服务外包）排行榜颁奖”仪式。吴中海副院长荣获2011年推动中国软件和服务外包发展年度杰出人物奖，学院荣获2011年推动中国软件和服务外包发展年度杰出机构奖。
    欢聚北京，享受动漫！首届国际动漫博览会闭幕式暨中国主题日——中国学院奖颁奖典礼于2012年12月9日在北京蟹岛国际会展中心举行。我院数字艺术系参赛作品《牛仔裤鲸鱼》荣获中国学院奖二等奖，吴萧鈅的《King》获得了中国学院奖单项奖。《牛仔裤鲸鱼》是导演姚丹、三维制作周炯生、美术设计康欣、后期合成李超、音乐创作王文倩历时一年时间创作完成的。数字艺术系在此对他们表示祝贺，同时，希望本系更多作品能够在动漫界大奖赛中获得佳绩，为软件与微电子学院的发展多做贡献!
   十年，探索高等工程教育新模式；十年，培养高端工程技术创新人才。2012年10月18日上午，“北京大学软件与微电子学院成立十周年暨首届工程博士研究生开学典礼”在北大英杰交流中心举行。教育部科技司副司长娄晶、国务院学位办专业学位处处长唐继卫、教育部高教司理工处处长李茂国、公安部11局副局长顾坚等领导、校友代表、合作企业及兄弟院校代表出席了此次大会。北京大学党委常务副书记、副校长张彦，秘书长杨开忠等校领导及学校各部门负责人、软件与微电子学院理事长杨芙清院士、学术委员会主任王阳元院士与学院300余名师生一起参加了此次庆典。庆典活动由软件与微电子学院党委书记白志强主持。
    大会在雄壮的国歌声中拉开帷幕。张彦首先代表学校向学院表示祝贺，对学院十年的发展进行了高度评价。他说，软微学院顺应时代发展、结合国家战略应运而生、顺势而上、独具特色、充满活力，是学校学科建设新的增长点，是北大发展工程教育和培养高层次应用性人才的重要阵地，学校对软微学院寄予厚望。希望学院紧跟学科发展的新趋势，紧扣产业发展的新需求，在教育科研、人才培养、社会服务、文化传承创新等各方面做出新的贡献，为学校加快创建世界一流大学注入更加强大的动力，以优异的成绩迎接党的十八大胜利召开。
    国务院学位办专业学位处处长唐继卫在发言中就我国专业学位建设的发展作了一个简要的回顾。他说，北京大学软微学院在过去的十年中艰苦创业、不断创新，创建了有北京大学特色的工程硕士研究生培养模式和教育管理制度，希望在工程博士的培养探索方面，创造出更加辉煌的成绩。
    教育部高教司理工处处长李茂国充分肯定了36所示范性软件学院在过去十年中所取得的成绩。他表示，创新是重中之重。软件学院之所以飞速发展，是因为它们的创新，在未来的道路上，需要继续地创新。同时，他表示将一如既往地支持示范性软件学院的发展，为我国建设信息化社会做出贡献服务。
    北京大学软件与微电子学院院长张兴在发言中分别从课程体系建设、师资队伍建设、人才培养、党政建设与保证服务、科研工作、面向行业和地区培养高端人才、国际合作办学等七个方面回顾和总结了学院十年以来的发展历程。张兴表示，软微学院将继续推进高端工程应用人才培养改革，,进一步面向产业培养人才，面向需求建设学科，面向领域凝炼方向，坚持国际合作办学，稳步扩大定向培养规模。同时，他强调学院将致力于结合工程博士培养探索工程技术领军人才培养新模式。
    学院理事长杨芙清院士作了题为《面向国家战略需求，培养工程技术领军人才》的重要报告。首先，杨院士指出，在建设创新型国家的战略大背景下，新兴信息产业急需培养能成为高端工程技术创新型人才的工程博士及其创新团队。随后，杨院士向在场嘉宾介绍了工程博士专业学位教育的相关内容，在此基础上，就北京大学工程博士培养模式的探索及构想作了详细介绍。杨芙清院士希望，学院在今后的十年发展中发挥办学优势，踏实开拓、锐意创新，不断实现新的超越，为国家高端工程技术创新人才的培养做出重要贡献。
    随后，张彦常务副书记走上台，和杨芙清院士共同为电子与信息领域工程博士教育中心揭牌。北京大学秘书长杨开忠和研究生院常务副院长王仰麟共同为软微学院和联想、IBM等10家首批企业共建的工程博士研究生工作站授牌。随后，10位首届北京大学工程博士研究生走到台上，学校导师和企业导师分别给他们佩戴了校徽和胸花。
    兄弟院校代表清华大学软件学院党委书记王建民、合作单位代表公安部11局副局长顾坚、合作企业代表IBM中国研究院院长王云、软微学院12级工程博士研究生史劲峰、校友代表张磊等分别发言，对软微学院表达了真诚的祝福。
    王阳元院士最后作了即兴讲话。王院士认为国家要更加重视实体经济的发展，这离不开工程人才的培养。他希望北京大学把工程人才培养的一系列规划写入学校的五十年规划中，学院要将全体师生员工的士气和力量凝聚起来，创造更多尖端显著的科研成果，培养更多高素质的创新型人才。最后王院士告诫全院师生“做学问要有活力，也要耐下心来”。
    十余载，风雨前行； 数磨难，砥砺成钢；承载北大百年积淀，续写软微今日辉煌。在全场人员集体合唱《歌唱祖国》中，软件与微电子学院成立十周年暨首届工程博士研究生开学典礼圆满落下帷幕。
    在全校喜迎党的十八大胜利召开、深入学习贯彻落实学校第十二次党代会精神之际，，软件与微电子学院第十一期党课开学典礼于11月7日中午在教学楼3303隆重举行。出席本次开学典礼的有北京大学软件与微电子学院党委书记白志强教授、学工办主任王柏艳老师、副主任郝群老师、团委书记张强老师、各学苑党支部书记以及全体入党积极分子。典礼由郝群老师主持。    典礼开始，郝群老师首先将本期党课的具体安排做了简单的介绍。接下来，白志强书记以《努力使自己成为一名先进青年》为题讲授了第一节党课。白书记首先论述了中国和世界的宏观发展局势，并结合了自身的经历为同学们讲述了中国近代发展历程的几个关键时间点，解读了“实事求是，敢创新路”的理论品质和井冈山精神，以此提出了中国需要先进青年并要努力使自己成为一名先进青年。他强调作为一名入党积极分子更要不断鞭策自己，从思想上、行动上先入党，努力使自己成为一名先进青年。最后，他对新一期的入党积极分子提出了三点希望：第一要加强政治理论学习、多关注时事动态，培养政治敏感性；第二要努力提高自身修养，特别是文化素养；第三要学会沟通，他强调提升个人魅力才是成功的关键。    开学典礼在同学们热烈的掌声中落下帷幕。
       1月11日上午，北京大学软件与微电子学院2014年春季毕业典礼在英杰交流中心月光厅举行。北京大学研究生院副院长高岱，软微学院院领导张兴、陈向群、吴中海、杜鹏、林慧苹与教师代表一同出席典礼，与2014届春季毕业生依依惜别。
       典礼以一段毕业视频拉开序幕，或温馨、或深情、或幽默的一幕幕场景让在场毕业生回忆起了几年软微的学习生活。这段视频是学院送给同学们的临别礼物，也是同学们对母校的一份馈赠。
       随后，软微学院副院长吴中海教授宣读了北京大学学位委员会“关于授予软件与微电子学院131位硕士研究生工程硕士学位”的决议。
       北京大学研究生院副院长高岱教授代表学校研究生院向即将毕业的131位硕士研究生表示祝贺。他说，软微学院从诞生之日起就担负着非常重要的历史责任，学院承担着探索软件、微电子及相关学科的工程技术人才培养的新模式的重任。高老师深情地和大家分享了自己学生时代的点滴回忆，并希望同学们走上工作岗位之后经常回北大看看，北大永远是大家人生路途中的加油站。
       饮水自当思源，2007级校友、有爱互动CEO胡冰和在场师弟师妹分享了自己的艰辛创业历程。他说，在学院的创新教学模式下，自己在软件技术、金融、管理等方面都得到了锻炼，为现在的创业铺下了坚实的基础。毕业生代表胡琴同学饱含深情地回忆了在软微学院度过的三年宝贵时光，表达了对学院老师的无限感激之情，以及北大人应有的历史责任和担当。
       学院教师代表林金龙教授寄语毕业生。林老师给同学们提出两点忠告：第一、同学们在离开校园之后要调整心态，以包容的态度和敢于挑战的精神使自己尽快融入社会；第二、除了掌握良好的技能外，优秀的心理素质和正确的价值观也是需要不断磨练的。
       张兴院长发表毕业致辞。张院长说，同学们应该学会忘记在北大学习带给你们的光环，忘记在学院取得的绩点。无论接下来同学们是在政府企业工作，还是出国深造，亦或是开启创业之路，都是新的开始。辉煌属于过去，可以品味，但不能就此停滞。希望大家能够再接再厉，继续努力，把你们取得的成功延续下去。同时，他希望同学们保持好奇心和时时学习的好习惯，北大软微永远是大家的人生港湾，大家随时可以回来看看。
       在庄严的学位授予仪式环节，毕业生们身穿学位服，头戴学位帽，分批走上讲台接受高岱和张兴两位老师拨穗，并一一合影留念。
       在毕业典礼开始前，学院老师与全体毕业生合影留念，瞬间的影像化为永恒的回忆，铭刻在每位毕业生的心中。
       12月9日晚， “INTERACTIVE STORYTELLING - How to grow audiences: The art of creating technology to form organic dialogues with users”专题讲座在我院举行。本次讲座邀请到知名媒体人Herwig Kopp先生，他为同学们介绍了交互式故事的相关内容。此次讲座由对外合作办公室承办。
       Herwig介绍到，交互式故事是一种新型数字媒体模式，用户可以通过肢体动作给故事主角下命令或是指导整个叙述过程来设计或影响故事情节。交互式故事使用户能够实时地影响故事的叙述和发展。讲座围绕”Interactive Thinking”，”Interactive Arts”，”Interactive Media”三个方面展开，分别就交互式在实践中的应用、艺术文化中的交互性以及交互性和故事叙述的交叉点等内容和同学们进行了分享和交流。
       演讲过程中，Herwig先生与现场同学的幽默互动让现场的交流气氛十分活跃。讲座内容丰富，立意新颖，为同学们了解世界先进媒体理念与技术提供了一次宝贵的机会。本次讲座在热烈的讨论中圆满结束。
                                                       新生党员大会现场
     本次大会首先由党委书记白志强讲话。白志强书记首先代表学院向各位新生的到来表示祝贺。随后，他从学校、家长等各个角度提出了对同学们的学习和生活方面方面的感想和建议。最后，他对各位新生党员提出了几点希望，希望各位党员发挥党员的先锋模范作用，扎实做好党员的本职工作。
       随后，学生工作办公室主任王柏艳老师发言。她对各位新生党员提出了“五个一”的建议，希望各位新生党员在未来的三年中认真学习，牢记自己的党员使命。       最后，2012级学苑党支部选举面试大会正式开始。选举委员会许伟民同学向大家介绍了本次党支部面试选举大会的整体流程和学生干部选举考察委员会成员的情况。面试环节主要包括5部分，涵盖了党员的基本常识、党的基本常识、对未来工作规划、表达能力等众多方面。来自我院13个苑的36名党员依次做了精彩的自我宣讲，并回答了各评委提出的问题。选举结果将在近期予以公布。      本次大会的召开为新生党员入学后的思想、学习和生活各方面予以了明确的方向指导，为接下来学苑党支部活动的开展奠定了良好的基础。
       4月14日上午，美国国际科技大学（International Technological University，ITU）校长Yau-Gene Chan先生、电子与计算机工程系系主任May Huang教授、嵌入式教研室主任Karl Wang教授、生物电子教研室主任Dominik Schmidt教授、数字艺术系主任Wes Takahashi先生和大学关系合作专员Heyi Yuan女士到我院进行交流访问。
       Karl Wang教授和Dominik Schmidt教授作了题为“Research and Development Presentation”的报告，报告介绍了美国国际科技大学在嵌入式系统、人工智能、生物电子等方面的研究成果，分享了智能抄表系统、智能家居系统和三维空间重构系统的设计理念与思路。美国国际科技大学的几位教授，均来自硅谷工业界，他们与到场的同学分享了各自的职业规划和成长经历。座谈会气氛融洽活跃，开拓了同学们的视野，增加了对硅谷工业界的认知。
      
       演讲后，我院院长张兴教授、副院长吴中海教授、微纳电子与嵌入式系统领域学科组副组长于敦山教授就双方项目合作研究、人才联合培养等事宜交换了意见。
     9月20日上午，由学生工作办公室副主任郝群老师带队,北京大学软件与微电子学院新生各学苑党支部书记、苑长组织全院百余学生参加了第三届孔庙国子监国学文化节的一项特色文化活动――第二届国子监儒商文化论坛。论坛在国子监彝论堂举办。     东城区区委相关领导一行莅临国子监，北京大学副校长、著名经济学家刘伟，哲学系教授陈少峰、北京师范大学哲学系教授、国学专家周桂钿，以及同仁堂集团、中国嘉德拍卖公司等知名企业的领导在论坛上进行了精彩的演讲，为兴旺文化经济献智献策。论坛由北京大学艺术学院党委副书记唐金楠主持。     第二届国子监儒商文化论坛以“国学文化与现代经济”为主题，围绕儒学、儒商精神，探讨时代转换和当代价值；整合历史文化资源，打造城市文化软实力等主题展开广泛而深入地探讨。     北京大学副校长刘伟以北大精神为核心，通过引入北大起源，阐述了北大的儒家文化。演讲中，刘校长多次肯定了软件与微电子学院的学生，对北大的理科学生充满信心，并表达了北大将跻身于世界一流大学的愿景。
    12月21日下午，由北京大学图书馆朱强馆长和肖珑副馆长、文献典藏与分馆办潘筠主任、信息咨询部刘素清主任等7位专家组成的评估组，对软件与微电子学院进行了评估和实地考察。软件和微电子学院的张兴院长、白志强书记、吴中海副院长和林慧苹院长助理以及北大各院系分馆的馆员、软件微电子学院的教师、学生代表等共30多人参加了评估会。
　　评估会上，朱强馆长和张兴院长分别代表图书馆和软件微电子学院讲话，阐述了评估的意义和分馆建设对提升学院教学科研能力的重要性。林慧苹院长助理代表软件学院分馆从体制管理、办馆条件、信息资源建设、读者服务、信息素质教育、自动化网络化和数字化建设等方面做了自评报告。评估组通过听取报告、现场提问、听取老师和学生代表建议、现场考察等方式对软件微电子学院分馆进行了认真评估。　　评估组充分肯定软件学院领导对文献资源建设的重视，以及为分馆运行所提供的重要经费保障和规范的管理。分馆对学院的教学科研起到了重要的支持和保障作用。分馆的管理人员工作敬业，主动热情，有较高的责任心，在读者培训、学位论文数据库建设、异地还书和回溯编目方面业绩突出。同时评估组也希望软件与微电子学院分馆加大资源建设力度，丰富馆藏类型，除保障教学科研外，为学生素质教育的提高提供更多支持，并且在多媒体资源、学习研讨空间等多样化服务方面有所突破。　　为支持软件与微电子学院分馆更好的为教学科研服务，总馆将在资源建设、馆藏调拨、电子资源的检索利用、服务推广等方面给予更多的支持。
       3月26日 ,Imagine Cup 2014全球学生大赛北京大学校区赛在我院成功举办。经初步选拔，4支由软件与微电子学院同学组成的团队参加了本次比赛。软件与微电子学院副院长林慧苹、郁莲老师以及微软公司代表王艳老师出席了评审和颁奖仪式。比赛由蒋严冰老师主持。本次比赛同时作为本学期开设的微软实现技术课程的一部分，再次为选课同学带来一次生动的互动式学习机会。
       比赛中，参赛同学精心准备了PPT和项目演示视频，并对项目进行了详细的介绍。评审老师认真听取了各个项目汇报，对项目诸多方面提出质询，参赛同学则一一进行回答。比赛现场还引入了微博手机投票与评论，增强了观众的参与度与互动性。
       本次参赛的团队涉及微软最新的windows8、windows phone8、Kinect、Azure等诸多最新技术，体现了同学们对新技术的把握和综合运用能力。经过评委会公正认真的评选，微软王艳老师宣布try团队参赛的Kinect GooseGogs益智游戏获得一等奖，获得二等奖的是1110团队的创意手机游戏inkwind、Esprithippo团队的中医文化游戏中医药堂以及Paragon团队的云+端个人助理应用Cortana。之后，郁莲老师对各个团队进行了技术点评。
       颁奖典礼后，林慧苹副院长对参赛情况进行了总结发言，她祝贺本次比赛取得圆满成功，肯定了本次大赛中各个团队的创意以及对新技术的钻研精神。同时，林老师针对参赛各团队的表现进行指导，并在需求把握和软件开发技术上对同学们提出了更高要求和期望。
       Imagine Cup 微软“创新杯”全球学生大赛是目前全球规模最大、影响最广的学生科技大赛。2003 年创办以来，至今已有来自100 多个国家和地区，超过500,000 名学生参与了“创新杯”比赛和相关活动。Imagine Cup 2013微软“创新杯”设有 “世界公民”、“最佳创新”和“游戏”三个比赛项目以及Windows 8，Windows Phone和Windows Azure 三个全球挑战项目。校区赛是微软“创新杯”2013年新增的环节，旨在鼓励更多的同学参与到Imagine Cup的比赛中，通过比赛展现自己的创意和才华，通过动手实践掌握最新技术、提升相关技能，为将来就业或创业打下良好基础。
      10月22-23日，由软件与微电子学院曹喜信老师指导，马恺声、张立佳和马占刚等三位同学组建的创新团队在2011年ALTERA“亚洲创新设计竞赛”上崭露头角，该团队完成的“基于迭代算法的医学CT成像处理FPGA系统研究与SOC实现”项目进入本年度ALTERA“亚洲创新设计竞赛”决赛，并获得三等奖。
     据悉，Altera亚洲创新设计大赛目前已经连续举办八届，是亚太区最高荣誉的FPGA设计竞赛，大赛旨在提高学生对FPGA设计的兴趣与设计技巧，并使其创新智慧与创造能力得以发挥和实现。本次大赛从报名到决赛历时5个多月，共有来自清华大学、北京大学及台湾地区高校的近400支队伍参赛，历经初赛、复赛、决赛，最终有16支队伍获奖。
      北京大学隆重召开2011年就业工作会议，会上我院获北京大学2011年毕业生就业工作创新集体奖和就业工作先进个人奖。
 
      北京大学校长周其凤，党委常务副书记、副校长张彦，校长助理、党办校办主任、学生工作部部长马化祥，医学部党委副书记李文胜，研究生院副院长刘明利，学生就业指导服务中心主任陈永利以及学校各职能部门领导、各院系党政负责人和就业工作负责老师近150人参加了会议。会议总结了2011年北京大学毕业生就业工作的成绩和经验，部署了2012年就业工作的目标和任务,并隆重表彰了2011年毕业生就业工作先进单位和先进个人。我院被授予“2011年毕业生就业工作创新集体”，这是软微学院第三次荣获集体荣誉称号，白志强书记代表学院领奖；许英老师被评选为“北京大学2011年毕业生就业工作先进个人”。
        会上，周其凤校长强调人才培养要服务国家战略，勉励全校各部门团结一心，协调一致，抓住毕业生就业工作的关键，努力做到“学有所用、人职匹配、人尽其才”，把全校毕业生就业工作做得更好。
      2011年是软微学院毕业生就业工作取得不菲成绩的一年。学院切实施“一把手”工程，积极组织，精心安排，创新想法，追求实效。发动和发挥全院教师、各系领导、各个部门力量参与和支持毕业生就业工作，聚全院之力促就业、保就业，实现了就业率100%，“就业单位质量高、毕业生满意度高”的“双高”好成绩。     2011年，学院共向社会输送毕业生888人。其中进机关事业单位总计287人（含高校、科研单位和军队）；国有企业138人，外资、三资企业142人、其他企业（含自主创业）279人；考取国内外学校博士、继续深造者30人。毕业生就业单位主要有：中共中央办公厅、国务院办公厅、省级人民政府、公安部、海关、安全部、银监会、证监会、国家外汇管理局、各大银行、航天航空、中石油、中石化、中移动等一大批政府部门和大型国有企业；还有英特尔、思科、甲骨文、朗讯、摩托罗拉、IBM、西门子、花旗、高盛、埃森哲、华为、中金、用友、中芯国际等一大批国内外知名企业；还有部分学生分配到高等学校和科研机构。特别提到的是软件系毕业生刘国亮同学积极响应国家号召，志存高远，顺应时代，选择到西藏工作，被北京大学树立为就业典范。
        2011年10月18日，全院师生齐聚大兴校区，共同庆贺北京大学软件与微电子学院九周岁生日。上午10时，学院成立九周年暨2010-2011学年总结表彰大会在大兴校区研发楼1410多功能厅隆重召开。    
       出席会议的有学院理事长、名誉院长杨芙清院士、王阳元院士，张兴院长、徐雅文常务副院长、白志强书记兼副院长、吴中海副院长、苏渭珍副院长以及全体教职员工。
      2010-2011学年，学院的各项工作在理事长杨芙清院士的领导下，学院全体教职员工的共同努力下，全面推进教学改革和校园建设，学院面貌发生了可喜的变化。张兴院长工作报告中肯定了学院“管理有创新、教改见成效、学生质量高、成果有突破、后勤有保障”的好成绩。
      在张兴院长总结报告之后，徐雅文常务副院长、白志强书记、吴中海副院长、苏渭珍副院长分别发言，表示过去的一年是全体教职员工求真、务实、高效工作的探索与实践，成果来之不易，将认真做好经验总结，共同努力，共同发展，共创学院美好的明天。
       杨芙清院士从学院发展战略角度做了重要讲话，她指出，北大软微学院依托北京大学综合学科优势，面向国家产业发展需求，发展交叉学科，培养实用型、复合交叉型、国际化的高端人才，全院师生员工，以国家需求为已任，以创新创业的全新精神面貌，团结奋斗在探索实践的第一线。在学校的领导下，在国家改革开放政策的环境下，在国内外合作高校、IT企业的支持下，艰难创业，取得良好的成果，学院的生源和质量不断提高，双师型师资队伍不断壮大和年轻化，服务理念深入人心，贯彻在办学的全过程中，毕业生深受企业欢迎，就业率达到100%。特别是2011年，北京大学软件工程一级学科和工程博士点申请获得国务院学位办批准，培养软件工程领域的领军人才已成为当前国家急需、产业急需，这对软微学院今后的可持续发展具有重要意义，将是今后一段时间的工作重点。
       王阳元院士也在会上做了富有哲理的即兴演讲，他说，学院是一片没有浮躁，可以全心做教学研究和培养人才的静土。他以宋代教育家胡瑷的“致天下之治者在人才，成天下之才者在教化”寄语富有朝气的教职工队伍，希望他们凝练心境，“铁肩担道义，妙手著文章”，踏踏实实地做好教学、科研工作。
       杨芙清院士、王阳元院士还为2010-2011学年先进个人颁发了证书。
    获得年度先进个人称号的有：陈燕平、褚伟杰、丁玉、沈晴霓、宋西国、俞敬松、张光红、赵泽宇、赵占波、罗正忠、刘京、周筱兰、谢国强等13人。会议对“曹健、蒋严冰、马克宣、郁莲、曹威海、曹振洲、韩薇、郝群、王海燕、俞鹏”等10人，由于工作突出、成绩显著，给予通报表扬。
 
        4月14日至4月16日，北京大学举办了一年一度的春季校运会。有27个院系所等单位参加了比赛，我院师生在院党委书记白志强的带领下，身着鲜艳的运动服，迈着整齐的步伐走过主席台，参加了几乎所有项目的比赛，并获得了总分第八名的好成绩，充分显示出了我院师生积极向上的精神风貌和勇于拼搏的进取精神。
     采访手记     第一次见杨芙清院士时，我实在惊异于她的朴实与和蔼可亲，仿佛眼前的并不是那个叱咤软件业的女强人，也不是那个在熠熠生辉的"软件工程铺路人"，而只是一名普通的大学教授。而当她用如此浅显易懂的语言向我们诠释着深奥的科学哲理时，当她使得中国软件产业的未来在她的阐述下变得异样清晰时，我折服于她的大智慧；当她含着泪水为我们讲述为了事业而忽略了儿女时，当她对自己曾经的那些辉煌仅仅是淡淡的一笑而过时，我折服于她的敬业！我终于明白了，正是她朴素的学者风范，她的睿智和敬业以及她的奉献精神，再加上那伴随了杨芙清院士一生的八字箴言--"认真严谨，开拓进取"，成就了这位中国软件业之泰斗。杨芙清院士仿佛就是中国软件产业的一只青鸟，引领着中国软件产业前进的方向，飞越丛林，飞越山谷，从６０年代直到今天，还有未来。
     附：     杨芙清语录     关于软件和学科研究：     1、我这一生坚持8个字：认真严谨，开拓进取。     2、美国的软件还是很脆弱的，你说如果不是脆弱它怎么会有那么多病毒？     3、科学研究就是要抽象提炼，把复杂问题变成简单的问题，分而治之，有了简化才能有优化。     4、科学研究就是要把一层一层的神秘面纱揭掉，写论文就是告诉大家面纱是怎么揭的，按照原本研究时的步骤写出来即可。     关于软件产业：     1、把软件做成产业，就必须要解决生产力的问题，也就是说要解放劳动力。     2、软件产业的发展要靠5个方面的努力，即：政、产、学、研、用。     3、 "中国青年软件振兴计划"提出的理念很好，我觉得软件关键在于人才，软件的希望关键在于青年人才。     关于人才培养：     1、教学以学生为本，要体现在教学的各个环节。比如我觉得学校的管理部门不该叫管理部门，应该叫服务部门，要以服务于学生为本职。     2、别人说我在快到70岁的时候，找了最苦最累最难的活来干（创办北京大学软件与微电子学院），我说我这个人最喜欢挑战性工作，老想去创一点新的东西。     3、我的观念是把一件事情做起来以后，就让年轻人来接着做下去，把年轻人推到第一线。     杨芙清主要经历     1955年，杨芙清毕业于北京大学数学力学系。     1957年，杨芙清作为新中国选派的第一批留学生，前往前苏联科学院计算中心和莫斯科大学数力系学习；     1958年，杨芙清于北京大学数学力学系计算数学专业研究生毕业；     1961年，杨芙清、徐家福、闻人德泰联手撰写的《程序设计》一书问世，这是我国早期第一本有代表性的计算机程序设计通用教材；     1973年，杨芙清主持研制成功我国第一台百万次集成电路电子计算机--150机操作系统，这是由杨芙清院士主持研发的我国第一个多道运行操作系统；     1980年，杨芙清在北京大学主持了我国第一届软件工程研讨会，开创了中国软件界专题研讨软件工程的先河；     1983年，杨芙清被评为北京大学计算机学科的第一位教授；     1984年，杨芙清被批准为北京大学计算机学科的第一位博士研究生导师；     1984年，杨芙清主持研制成功DJ-240机上用XCY语言编写的DJS-200/XT2操作系统，这是我国最早用高级语言书写的操作系统；     1986年，杨芙清主持研制成功软件工程核心支撑环境BETA-85，这是我国第一个比较成型的软件工程支撑环境；     1990年，杨芙清主持研制成功第一个大规模的、综合的、通用的集成化软件工程支撑系统--青鸟I型（JB1）系统，这是我国第一个集成化软件工程环境；     1991年，杨芙清当选为中国科学院学部委员（院士）；     1995年，杨芙清院士主持研制成功中国第一个面向对象的大型软件开发环境--青鸟Ⅱ型（JB2）系统；     1997年，杨芙清院士主持研制成功基于构件/构架复用的应用系统集成（组装）环境--青鸟软件生产线系统，从管理、组织机制、技术和系统等方面为我国软件企业提供整体解决方案。
         2005年3月8日下午两点三十分，"嵌入式系统T-ENGINE技术中国论坛（2005）"在北京大学英杰交流中心阳光大厅拉开序幕。本次论坛由日本东京大学T-ENGINE研究中心、北京大学软件与微电子学院、中科院计算技术研究所、计算机世界共同主办，中国软件行业协会、计算机世界、信息产业部、中科院计算技术研究所、中国家用电器研究院等单位领导出席了论坛。来自东京大学的坂村健教授就嵌入式系统TRON（开放源代码实时操作系统内核）项目以及此项技术在汽车电子、手机、数码相机和其它数字家电等多个领域的应用进行了介绍。坂村健教授讲座之后，中国家用电器研究所邴旭卫副院长、北京大学软件与微电子学院院长陈钟教授、嵌入式系统系主任柳翔教授、中科院计算所隋雪青所长等加入了论坛，他们针对T-ENGINE技术在中国的发展和应用开展了讨论，并回答了场内听众的提问。本次论坛之后，将由东京大学派出的三名讲师在北京大学软件与微电子学院为中方学员进行为期三天的"T-ENGINE技术培训"。
       2月20日上午，国家外国专家局中国国际人才交流基金会主任苏光明、科教文卫司副司长雷风云一行前往国家软件人才国际培训（北京）基地，在北京大学软件与微电子学院院长张兴、副院长吴中海、无锡基地主任王平、对外合作办公室主任李影的陪同下，实地考察了北京基地的发展建设进度，了解了基地建设对中高端人才的需求情况，并就引智工作举行了座谈和交流。
       调研会议上，北京基地依托单位——北京大学软件与微电子学院副院长吴中海教授首先对基地近年的建设成果进行了汇报，介绍了软微学院在国际交流合作、外专引智等方面的进展情况，并展望了北京基地的未来工作计划。其他院领导也对北京基地的建设成果和软微学院的国际化工作畅谈了感想，并与国家外专局领导进行了很好的互动交流。
       中国国际人才交流基金会主任苏光明介绍了外专局职能、日常事务、以及一些重点引智项目，同时对北京基地的工作进行了高度的肯定。北京基地作为一个国际交流与培训的基地名副其实，已经具有国内顶尖、国际一流的水平。高度赞赏了北京基地在学院领导的带领下所做的工作，促进了中国与国际相关学者就共同感兴趣的研究课题进行进一步的合作与交流，为国家在软件工程这一重要领域的发展做出了应有的贡献。
       最后，张兴院长介绍了北京基地今后的发展思路，通过全建制全方位的引进模式，以研究生培养为抓手，坚持国际化无缝链接，坚持产学研合作模式，充分发挥北京基地的辐射作用，共筑软件梦、北大梦、中国梦。
         热烈祝贺我院男篮升入北大杯男子甲级联赛         此次北大杯男子篮球乙级联赛从3月22日开始比赛，持续到4月8号结束。一共12个院系参加了这次联赛。我院男篮在经历了8场比赛之后，不仅成功地升入了甲级联赛，而且勇夺了这次比赛的冠军。         此次比赛的日程安排非常紧，几乎是每隔一天一场比赛，再加上比赛安排在中午，每次来回的奔波也是非常考验队员们的体力和意志。而我们的队员们克服了种种困难，在这次比赛中顽强拼搏，不畏强敌，真正地打出了软件学院的精神风貌，实现了质的突破。队员们在队长胡劼的带领下，战胜了众多强队后成功升入甲级，圆了前两届学长的心愿，也实现了我们的目标。这次联赛的胜利是每一位队员努力拼搏的结果，是所有队员团结一心共同奋斗的结果，更是学院全力支持的结果，感谢所有支持者。        最后，请关注这些响亮的名字：李想（场外指导）张达明（后卫） 庄凝（前锋） 林岚云（前锋） 胡劼（前锋兼队长） 尤赟（前锋） 阎鹏飞（中锋） 周晓杰（前锋） 王晓东（后卫） 李金涛（后卫）许鑫（后卫） 李民（后卫） 邱磊（后卫）。
     8月17日上午，北京大学党委副书记、纪律检查委员会书记于鸿君教授专程来到软件与微电子学院调研并指导工作，学院理事长杨芙清院士、学术委员会主任王阳元院士、院长张兴教授、党委书记白志强教授等院领导接待了来访。
    于鸿君副书记首先参观了研发楼、教学楼、学院展室、图书馆，他认真询问了学院近年来发展取得的成绩和遇到的困难，观看了学院的宣传板，并就学院组织管理和人才培养等方面提出了指导意见。之后，于鸿君副书记来到学生宿舍，看望了暑期留校同学，并叮嘱他们暑期外出要注意安全，在校要抓紧时间多学习。
    在随后的座谈会上，张兴院长分别从“学院过去十年的发展概况”和“未来十年的发展规划”两方面对学院进行了介绍。在谈到我院产学研结合培养人才模式时，他说，学院正积极探索政产学研用协同创新的高层次工程技术人才教育新模式，坚持德育为先、能力为重、德才兼备，并充分发挥企业参与人才培养的积极性和能动性，以此实现学院和企业的互联互动和深度合作，做到学院和企业的“无缝”链接。针对学院未来十年的发展，张兴院长具体介绍了“精品化、国际化、规模化”的战略思想，并就探索工程博士培养新模式的构想向于鸿君副书记作了汇报。
    于鸿君副书记在听取汇报后表示，软件与微电子学院的办学理念、建设成绩、创新创业等方面的一系列发展改革值得充分肯定。同时，他还用“耳目一新”一词表达了他对学院人才培养模式的感受，他指出，这是对北京大学人才培养体制的补充和贡献，应当努力深入探索和完善，进一步发挥学院特色优势。针对学院在发展过程中遇到的一些瓶颈和问题，于鸿君副书记表示，学校今后将继续全力支持软微学院的发展。
    研究生院副院长刘明利教授讲话 
     副院长苏渭珍教授宣读了《北京大学学位评定委员会关于授予工程硕士学位的决定》，经北京大学学位评定委员会第106次会议审查和表决，决定授予软件与微电子学院刘一等221位硕士研究生工程硕士学位。
      1月7日上午，北京大学软件与微电子学院在英杰交流中心新闻发布厅举行2012年研究生毕业典礼暨学位授予仪式。北京大学研究生院副院长刘明利教授、软件与微电子学院院长张兴教授、副院长吴中海教授、副院长苏渭珍教授、院长助理林慧苹副教授以及部分教师代表和221名毕业生参加了典礼。
   软微学院院长张兴教授讲话
     数字艺术设计专业的商乾倩同学代表2012届全体毕业生发言。言语中，充满了对领导、老师的敬意和感激。商乾倩同学表示，他们将带着梦想的翅膀，乘风破浪、奋勇前行，朝着精彩的未来启航，为母校增添荣誉，并祝愿母校不断发展壮大。
      最后，身着硕士服的毕业生从研究生院副院长刘明利教授和软微学院院长张兴教授手中接过证书。伴随着轻快的音乐和热烈的掌声，毕业典礼暨学位授予仪式圆满落下帷幕。
      10时整，庄严的毕业典礼在国歌声中正式开始。典礼由副院长吴中海教授主持，研究生院副院长刘明利教授、院长张兴教授分别致辞。教师代表院长助理林慧苹副教授也做了讲话。他们希望同学们谨记踏实、勤奋的作风，砺练心志，带着“北大印记”尽快融入社会，发挥聪明才智，勇于担当，勇往直前！ 
     教师代表林慧苹副教授发言
                                                              学生代表商乾倩同学发言  
            研究生院副院长刘明利教授为毕业生拨流苏
      软微学院院长张兴教授为毕业生拨流苏
     建院九年来，软件与微电子学院始终按照“教书育人、管理育人、服务育人”的理念，积极为大家提供了良好的学习和生活环境，学院在管理服务、教育改革、学生质量、教学成果、后勤保障等方面都有了一定的发展，取得了喜人的成绩。学院根据产业发展需求，不断拓展人才培养类型，2011年，学院就软件工程一级学科、工程博士的申报、筹备方面作了大量工作，这对软微学院今后的可持续发展具有重要意义。目前学院已经涉及软件工程、集成电路工程等5个专业领域，研究生培养也正在从单一的工程硕士，逐步拓展到工学硕士、工学博士、工程博士。2012年10月18日是北京大学软件与微电子学院十周年院庆日，是学院发展史上的重要里程碑，届时全院师生、校友将共聚一堂，共同分享这个欢乐的时刻。
 
         热烈祝贺我院男篮升入北大杯男子甲级联赛         此次北大杯男子篮球乙级联赛从3月22日开始比赛，持续到4月8号结束。一共12个院系参加了这次联赛。我院男篮在经历了8场比赛之后，不仅成功地升入了甲级联赛，而且勇夺了这次比赛的冠军。         此次比赛的日程安排非常紧，几乎是每隔一天一场比赛，再加上比赛安排在中午，每次来回的奔波也是非常考验队员们的体力和意志。而我们的队员们克服了种种困难，在这次比赛中顽强拼搏，不畏强敌，真正地打出了软件学院的精神风貌，实现了质的突破。队员们在队长胡劼的带领下，战胜了众多强队后成功升入甲级，圆了前两届学长的心愿，也实现了我们的目标。这次联赛的胜利是每一位队员努力拼搏的结果，是所有队员团结一心共同奋斗的结果，更是学院全力支持的结果，感谢所有支持者。        最后，请关注这些响亮的名字：李想（场外指导）张达明（后卫） 庄凝（前锋） 林岚云（前锋） 胡劼（前锋兼队长） 尤赟（前锋） 阎鹏飞（中锋） 周晓杰（前锋） 王晓东（后卫） 李金涛（后卫）许鑫（后卫） 李民（后卫） 邱磊（后卫）。
         2005年3月27日，2005年中国国际人才交流大会在南京国际展览中心正式拉开帷幕。来自全国各省、自治区、直辖市和有关部门，以及36个国家、地区的247个外国专家组织和境外人才交流机构的代表参加了本次交流会。北京大学软件与微电子学院作为国家软件人才国际培训（北京）基地参加了此次大会，并在引智成果展示推介会上展示了“软件工程”、“数字艺术”两项引进外国专家项目的主要成果。         本次大会以“融全球智力，促共同发展”为主题，主要内容分为5大板块：引进外国经济、技术、管理、文教专家及出国（境）培训项目洽谈；留学人员项目洽谈；引智成果展示推介会；国际资质证书展示推介会；国际化人才招聘会。中国国际人才交流大会已是第四次在南京举行，据统计，前三届大会共达成合作意向9600多项，许多专家引进项目和出国（境）培训项目都取得了显著的成效。仅在2004年，全国引进外国专家项目的62％是通过宁交会实现的。中国国际人才交流大会现已成为国际人才交流的重要舞台，成为中国引进海外人才智力的重要渠道。
      9月3日，北京大学软件与微电子学院2012年开学典礼在北京大学大兴校区隆重举行。    上午八点整，开学典礼在庄严的国歌声中拉开帷幕。院长张兴，常务副院长徐雅文、副院长吴中海、苏渭珍等院领导出席了典礼，软微学院相关科系、职能部门负责人以及2012级新生参加了典礼。典礼由学院党委书记白志强主持。    张兴院长在开学典礼上致辞，他向新入学的同学表示热烈的欢迎和衷心的祝愿，欢迎大家成为软微大家庭的一份子。张兴院长给我院新生提了四点希望，他希望同学们在研究生阶段不仅要学习科学文化知识，更要不断掌握和改进学习方法，要思考问题，有针对性地解决问题；鼓励同学们主动学习，尽可能多地参与课题研究和项目实践，不断丰富自己的经验；告诫同学们既要积累知识的广度，也要挖掘学术的深度，在集中研究某个知识领域的过程中积累研究方法。同时，张兴院长还强调，软件与微电子领域知识更新很快，同学们要养成时刻关注和学习前沿知识的良好习惯。    教师代表、软件技术系副系主任林慧苹在发言中强调，研究生的学习是交互式的，需要更多与导师交流，她还勉励同学们培养自己做学术研究的韧劲，在坚持中进步成长。    在校生代表、2011级研究生张西晴与大家分享了她在软微学院走过的一年多时间，表达了自己对北大对软微的热爱。她希望新同学利用好研究生阶段的三年学习时间，使自己充分适应学院特有的教学方式，多探索、多实践，用踏实勤勉的态度使自己真正得到发展。    电子服务系2012级研究生杨超作为新生代表发言。他畅谈了自己对北大精神的感悟和理解，并表示，北大给予了青年学子广阔的发展空间，一定会珍惜三年的学习机会，秉承软微学院的优良传统，钻研学术、砥砺品格，不负青春的光荣使命。    开学典礼在全体师生热烈的掌声中圆满结束。北京大学软件与微电子学院全体2012级新生将从这里出发，继承北大百余年来的精神传统，肩负起北大人的责任和使命，以十周年院庆为契机，努力前行，创造一个更加美好的未来！
 
        1月24至25日，北京大学软件与微电子学院、北大软件教育发展有限公司在北京举行了2005年新春团拜会及2004年工作总结大会。新春团拜会上，学院理事长、公司董事长杨芙清院士通过电话连线向参加会议的100多名教职员工致以新春的问候以及亲切的祝辞，学院院长、公司总经理陈钟教授在讲话中总结了2004年工作、提出了2005年工作设想。在25日举行的2004年工作总结大会上，学院、公司共18个系科、办公室、部门的代表分别对各单位2004年的工作进行了总结汇报，并提出了2005年工作计划。
       3月14日下午，由学院研究生会主办的“北京大学软件与微电子学院软件设计大赛暨China Stars软微专场”在学院3305教室隆重开幕，本次比赛共有近20支队伍参赛，分别来自北京大学软件与微电子学院、信息科技学院、地球与空间科技学院、环境科学与工程学院等院系。北京大学软件与微电子学院学生工作办公室副主任、团委书记张强老师，Trilogy Ventures风险投资公司董事长Steve Bell等出席了此次活动。
       首先，院研究生会主席李玮同学代表主办方讲话。李玮同学认为，“创业者气质”和“软件技术”能很好地代表此次大赛参赛者所具备的特质。他希望本次大赛提供的平台能够促进参赛选手与投资方的交流合作，并最终诞生真正的企业家。
       随后，Trilogy Ventures风险投资公司董事长Steve Bell为同学们讲述了自己的创业经历，详细介绍了整个比赛的情况，并鼓励同学们不断创新创业。
       进入陈述环节，每支队伍代表各有60秒时间讲解商业计划书，并由现场的嘉宾评委进行提问和建议。随着交流不断深入，嘉宾评委引导选手们逐渐将想法变为可行的方案。
       大赛启动后，每只参赛队伍将有三天时间制作或者完善自己的产品，被VC公司选中的创业团队将进入为期三个月的孵化期。孵化期间，投资方将会为优秀团队提供资金、人力和物力支持，帮助有梦想和有能力的学生步入创业之路，最终将视情况为优秀的团队提供天使投资。大赛将会切实挑选出优秀的团队和产品，为孵化出优秀的团队和企业而努力。
       10月15日中午，北京大学软件与微电子学院组织召开学生骨干院长座谈会，学院院长张兴教授、党委书记陈向群教授、副院长林慧苹副教授出席。2014级各苑、团委、研究生会的学生骨干参加了座谈会，会议围绕全校即将开展的“深化综合改革、聚力科学发展”主题活动展开充分讨论。会议由陈向群书记主持。
       张院长首先阐述了学院的办学理念：定位于工程开发能力和产业需求，根据产业发展动态调整系和专业方向，让人才培养与产业需求互动，实现多途径合作办学的管理体制与运行机制；与国内外企业合作，拉动社会资金投入，实行运作企业化、办学专业化和后勤社会化，实现培养高层次、实用型、复合交叉型、国际化人才的目标。张院长强调毕业生如何得到社会各界认可需要老师和同学的共同努力。
       随后各位学生骨干围绕同学们学习生活中的诉求、学院发展与学生发展的关系以及如何深化综合改革、加强办学设施的建设等问题展开讨论。通过这次讨论使他们对学院的历史、现状和未来有了更好的认识。
       最后，陈书记进行了总结，她希望通过此次座谈会由院团委与研究生会联合牵头，各苑积极配合，让学院各项学生活动轰轰烈烈搞起来，值此学院12周年院庆来临之日，各学生骨干畅所欲言，为学院的发展建言献策，学院的明天定会更美好。
       北京大学软件与微电子学院是经教育部、国家计委批准成立的“国家示范性软件学院”，也是教育部和科技部设立的“国家集成电路人才培养基地”。学院设有电子与信息领域工程博士点，工程管理硕士点，软件工程、集成电路工程、项目管理、电子与通信工程、计算机技术等5个领域的工程硕士点，并且与软件工程国家工程研究中心、信息科学技术学院软件研究所合作建设软件工程一级学科博士点。
       软件与微电子学院从建院起，就以“创建世界一流软件与微电子学院”为己任。学院秉承北京大学“民主科学、兼容并包”的精神，坚持北大“勤奋、严谨、求实、创新”的校风；以坚持改革开放、面向需求、质量第一为建院宗旨；以培养多层次、实用型、复合型、国际化软件与微电子人才为目标；按照企业和领域需求确定培养方向，按照产业需求不断调整专业方向，形成灵活的课程体系，动态的教学计划；按照社会主义办学方向，将人文科学与前沿技术教育贯穿始终，全面加强素质教育，重点培养学生的创新、创业精神和实践能力；学习借鉴国际人才培养经验，努力实现教学模式创新，管理体制创新，教学内容创新，课程设置创新，教学方法创新。
       为了培养高层次、实用型人才，贴近产业，北京大学软件与微电子学院经教育部批准（教高司函[2006]29号文件），选择信息技术、微电子产业高度发达的长三角地区—无锡建立了北京大学软件与微电子学院无锡产学研合作教育基地（简称无锡基地）。
       2014年学院面向社会招收150名攻读软件工程专业第二学士学位学生。
       1、拥护中国共产党的领导，愿为社会主义现代化建设服务，品德良好，遵纪守法；
       2、非软件工程专业本科毕业生（含应届毕业生），有学士学位证书，具备一定的计算机基础知识，英语相当于四级以上者，均可报考；
       3、身体健康状况符合规定的体检标准。 二、招生专业       招生专业：软件工程
       招生方向：
       1、    软件开发
       2、    软件应用技术
       3、    嵌入式软件
       4、    信息安全
       5、    金融信息服务
       6、    商业与数据分析
       1、报名时间：凡是符合报考条件的学生从即日起报名；
       2、报名方式：报名采取网上报名方式。网上提交报考信息时间截至2014年5月30日；
       3、 报名手续：
       1) 考生登陆北京大学软件与微电子学院网上报名系统（网上报名主页地址: http://zhaosheng.ss.pku.edu.cn），先在网上申请用户名，并按要求录入本人信息；
       2) 认真核查报名信息，确认无误后，打印报名表一份，贴上近期一寸免冠照片，并在照片上加盖考生档案所在学校或单位人事部门公章，于2014年6月6日前随其它报名材料一同以邮政快递（EMS）或挂号形式寄往北京大学软件与微电子学院招生办公室。（北京大学理科一号楼1723N房间，邮编：100871）（以其他快递方式邮寄造成不能收取材料的后果自负）。
       3) 报名材料包括：
       （1）网上打印报名表一份；
       （2）本人身份证复印件一份；
       （3）本科毕业证书、学位证书复印件各一份（2014年的应届本科毕业生需递交学校证明，往届生与海外毕业学生需递交学位认证证书）；
       （4）大学已修课程成绩单原件（如为复印件，非应届生需加盖档案所在单位人事部门公章，应届生需加盖所在学校教务部门章）；
       （5）一寸免冠照片一张（与资格审查表所贴同底，用于办理准考证等）；
       （6）攻读第二学士学位期间本人想致力研究的问题和未来职业发展设想的陈述书；
       （7）外语等级证明；
       （8）其他能够证明个人学习、科研等方面能力的材料。
       4、申请者应对提交的所有材料的真实性负责，如有不符将取消资格。
   四、招生方式 
       招生将采用“申请-考核制”方式，即考生申请，经专家推荐，学院考核的方式。为确保选拔的公平、公正、公开，学院成立相应的招生委员会。
       申请人须按招生简章要求进行报名并提交申请材料。
       1、我院根据申请人的申请材料，进行审核，确定进入考核的候选人；
       2、考核采取面试、笔试相结合的方式进行考核，对学生的学科背景、专业素质、实践能力、外语水平、思维能力、创新能力等方面进行考察；
       3、择优确定初取名单并进行公示，报经学校批准后录取
    五、考核时间、地点 
       考核时间将根据报考学生的具体情况决定。首次考核时间和地点请考生注意学院网上通知。     六、录取            根据考生的申请材料和考核的总成绩择优录取,于2014年6月底公布录取结果并发放录取通知书。2014年应届本科毕业生可将户口和档案转入北京大学，培养费由本人负担，毕业后按我校有关规定就业。    七、入学            2014年9月入学。办理报到注册手续时，须出示本人本科毕业证书、学位证书原件，否则取消录取资格。     八、培养与管理 
       1、按照北京大学制定的软件工程第二学士学位的培养方案进行培养，并由北京大学软件与微电子学院负责学生的培养管理；
       2、培养方式为脱产学习，学生必须遵守学校的有关规定，切实保证学习时间。     九、学位授予
       完成教学计划规定的课程，成绩合格者，颁发北京大学本科毕业证书，符合学位授予条件者，授予工学学士学位。     十、 学杂费 
       学制2年，共80学分，学费总计32000元。学生可一次性交费，也可以分两次付费，新生入学时交纳20000元，第二学年性交纳12000元。     十一、 上课地点及食宿
       食宿由学院协助解决，费用由学生自理。
    十二、 联系办法 
       咨询电话：010-62767180、62767181、62767168
       地址：北京大学软件与微电子学院招生办公室（北京大学理科一号楼1723N房间）
       邮编：100871
       电子邮件： 
 
 <!--
 var prefix = '&#109;a' + 'i&#108;' + '&#116;o';
 var path = 'hr' + 'ef' + '=';
 var addy41579 = 'zh&#97;&#111;sh&#101;ng' + '&#64;';
 addy41579 = addy41579 + 'ss' + '&#46;' + 'pk&#117;' + '&#46;' + '&#101;d&#117;' + '&#46;' + 'cn';
 var addy_text41579 = 'zh&#97;&#111;sh&#101;ng' + '&#64;' + 'ss' + '&#46;' + 'pk&#117;' + '&#46;' + '&#101;d&#117;' + '&#46;' + 'cn';
 document.write('<a ' + path + '\'' + prefix + ':' + addy41579 + '\'>');
 document.write(addy_text41579);
 document.write('<\/a>');
 //-->\n 
 <!--
 document.write('<span style=\'display: none;\'>');
 //-->
 该Email地址已收到反垃圾邮件插件保护。要显示它您需要在浏览器中启用JavaScript。
 
 <!--
 document.write('</');
 document.write('span>');
 //-->
 
       网上报名主页地址: http://zhaosheng.ss.pku.edu.cn
       软件与微电子学院主页地址：http://www.ss.pku.edu.cn
                                                                                      
 
                                                                                         北京大学软件与微电子学院招生办公室
                                                                                                          2014年2月28日
         2005年3月3日下午14：00-16：00，国际游戏开发教育联合会 (IGDEA)主席、视频游戏之父诺兰•布什内尔先生(Nolan Bushnell)应邀到学院，就游戏的娱乐性、凝聚力及对其他行业的影响力等方面进行专题讲座，阐述了游戏是未来的媒体，游戏技术不再局限于游戏本身，更是一个强有力的交流工具。讲座后与学院数字艺术系全体教师进行了深入的交流，双方初步达成了进一步的合作意向。
       1月13日下午，学院在教学楼一楼会议室召开党的群众路线教育实践活动总结大会。学院党政领导班子、教职工党员和非党员教师代表参加会议。北京大学群众路线教育实践活动第十一督导组组长李国斌、副组长王强参加会议。
       党委书记陈向群代表班子对我院开展党的群众路线教育实践活动进行了总结。按照中央精神和学校党委的要求，学院党委高度重视，精心部署，周密实施，扎实推进党的群众路线教育实践活动各项工作深入开展。学院领导班子认真总结前十年的发展成果，结合学科发展前沿和学院实际，牢牢把握学院发展方向，继承优良传统，理清发展思路，着眼全局，超前谋划，重内涵，强特色，抓创新，以作风建设的新成效汇聚推动学院发展的强大动力。
       陈书记表示，学院党委把中央精神和学校党委的要求与学院实际结合起来，在完成规定动作的同时，做好自选动作，以教育实践活动为契机，以这次教育实践活动为开端，切实解决学院事业发展，学院党建工作以及师生反应强烈的突出问题，以优良作风把师生拧成一股绳，同心同德、同舟共济，以改进党风推动教风学风建设，不断增强学院师生归属感和自豪感，为实现“一流学院”的“学院梦”而不断努力。
       会上，学院各部门负责人就本次教育活动中本部门和自身的整改分别谈了自己的感想，普遍感到本部门的服务意识增强了，教学水平提高了，工作流程规范了，整体工作状态改进了。
       学校督导组李国斌组长肯定了学院党的群众路线教育实践活动的成果，对学院在这次活动中的主动学习、认真查摆、脚踏实际、及时整改表示赞扬。
       总结大会结束后，全体参会人员对学院领导班子及成员进行了满意度测评，测评表由学校督导组收回统计。党的群众路线教育实践活动总结大会圆满结束。
       近日，由北京大学研究生院和北京大学研究生会举办的北京大学“学术十杰”系列活动之“论道杯”研究生学术演讲比赛决赛在校本部生命科学学院邓祐才报告厅落下帷幕，软件与微电子学院新兴交叉学科领域学科组语言工程方向2012级硕士研究生林毅超获得冠军。
       此次学术演讲比赛历时一个半月，分为初赛、复赛和决赛三轮，初赛按照理学、信息与工程学、人文学、社会科学、医学分为5个赛区，共选拔30人进入复赛，各赛区名额分配按照所包含院系人数所占全校研究生的比例决定。复赛分人文社科、理工医学两场进行，初赛、复赛阶段均采用自选题目5分钟演讲的形式，共决出10名选手晋级决赛。决赛的现场邀请到了平新乔、马伯强、査红彬、张永鹤以及李红印五位评委老师代表文社理工医等学科体系。
       决赛分为“两两PK”、“复活环节”和“即兴演讲”三个环节，其中两两PK环节围绕“学术与文明”展开，共有五个话题：社会文明、政治文明、物质文明、精神文明和生态文明，同组两位对决选手分别来自文科背景和理科背景，针对同一话题分别进行5分钟演讲，每组选手讲完后由五位评委老师现场投票，票数多者晋级决赛，另一位选手待定，等待复活。
       我院选手林毅超抽到的主题是“物质文明与学术”，他的演讲内容为通过语言信息技术看当代物质文明的发展，演讲过程中利用Google books Ngram viewer及Sketch Engine 等语料库工具对某些物质名词的检索结果，畅谈了当代物质文明的发展进程，以及在大数据互联时代下该如何记录物质文明，充分展现了软微学院应用型研究的风采。最终，以现场唯一一次五位评委全票通过的成绩直接晋级总决赛。
       总决赛为一分钟即兴演讲，演讲主题为“学术也快乐”：阐述所在学科领域内的一个有趣的学术问题。林毅超用自己当前的研究给全场比赛做了一个很好的总结——“如果你有一个梦想，就让学术来承载你的梦想，这样你的学术也会很快乐”。最终，结合评委老师的评分与大众评审的现场投票，林毅超一举夺得本次“论道杯”学术演讲比赛的冠军，亚军、季军分别是来自对外汉语教育学院的陈娟和物理学院的邵鼎煜。活动的最后，各位评委老师为“十佳学术演讲家”颁发荣誉证书。
       据悉，北京大学研究生“学术十杰”系列活动是在北京大学研究生院和共青团北京大学委员会共同指导下，由北京大学研究生会主办的学术评选活动。“论道杯”研究生学术演讲比赛是今年在“学术十杰”活动基础上开创的新的重要组成部分，此次活动通过学术和演讲相结合的方式，提高北京大学研究生表达学术观点的能力和水平，作为全国高校首个研究生学术演讲比赛，整个活动的举办为繁荣北大学术、弘扬学术精神、促进学科交叉提供了契机。
       
  紧 急 通 知参加今年6月份全国大学英语四、六级考试的同学请注意：北大考试中心特为软件学院安排在大兴校区进行照片采集工作，请已报名交费的同学于4月21日（周四）上午8：00-12：00在3201进行拍照。照相时请务必认真核对自己的数据，如有错误请在现场进行及时更正！！凡错过照片采集者均不办理退费手续。        请相互转告！教学管理办公室2005．4．19 
      记得采访北京大学软件与微电子学院院长陈钟的时候，陈钟院长曾经这样对我们说："杨芙清院士是整个学院的总设计师，她是在设计，而我是在编程。"的确，在杨芙清院士独特而成功的教育理念的指导下，北京大学软件学院面向市场培养了一批高素质的软件人才，在同类学院中独领风骚。      然而，在创办北京大学软件与微电子学院时，杨芙清院士已近70岁。问及于此，杨芙清院士笑着对我们说："别人说我在快到70岁的时候，找了最苦最累最难的活来干，我说我这个人最喜欢挑战性工作，老想去创一点新的东西。"
    
      
      2012年5月23-27日，第十五届中国北京国际科技产业博览会在中国国际展览中心拉开帷幕。我院数字艺术系学生团队产品“智铃”在此次展会上受到广泛关注。 
 
 
 
         3月3日上午9时，北京市万安火灾防治咨询中心李强教官来到北京大学软件与微电子学院大兴校区，为学院教职员工做了一场专业、生动的消防知识讲座。通过这次学习，大家对火灾从防范、形成、种类；灭火器的种类、使用方法等有了基本的了解，讲座同时提高了大家防患未然的意识。
         
       2005年3月19日上午，中共无锡市委书记杨卫泽一行来北京大学软件与微电子学院和学院理事长杨芙清院士、理事王阳元院士以及学院院长陈钟教授等有关同志，就利用双方优势，在无锡建设产学研基地的合作问题进行了会谈。会谈前杨卫泽书记详细参观了学院的教学实验环境和听取了理事长杨芙清院士的情况介绍。
 
       陈向群书记随后宣读了2013-2014学年评优教职工名单，并鼓励他们在今后的工作中再接再厉，扎实做好每一项工作，为学院做出更大的贡献。随后，杨芙清院士为白志强教授颁发了纪念铭牌。
       张兴院长首先做《北京大学软件与微电子学院2013-2014学年工作总结报告》，他从教育教学，科研与成果转化，人才队伍建设，对外合作与交流，招生就业工作，行政事务管理等九个方面回顾总结了上一个学年的工作，并阐述了今后一个阶段学院工作要点。最后，张兴院长鼓励全体教职工向着保持国内领先、发展世界一流软件与微电子教育的目标团结协作，不断前行。
       杨芙清院士对全体教职员工一年来的工作做出肯定，表示软微学院能取得如今的成绩，离不开全体教职员的辛勤努力。杨芙清院士表达了四点感想：第一，软微学院要从国家示范性软件学院的标准来要求自身发展，要不断创新以满足国家对人才的需求，创新创业的话题要不断有新的思考；第二，软件工程一级学科来之不易，要将工学和理学的模式结合起来，综合二者优势培养学生；第三，要摸准时代脉搏来确定培养方向，探索新的学科建设；第四，要深化素质教育模式，按照社会主义核心价值观来培养人才。杨芙清院士随后还就青年教师的自身建设，改进工程硕士培养模式，学院精品教材出版，加强在校生与毕业生工作，学院制度建设等方面的话题发表了体会。
       王阳元院士对学院就业与招生工作表示赞赏，指出要把软微学院发展看作教育改革的重要使命或教育改革的重要探索。王阳元院士对学院今后的工作提出五点希望：第一，希望学院做好产学研深化建设的工作，培养国家需要的人才；第二，注重国际化运作，和全球化资源配置的国家战略需求相结合；第三，继续发挥软微学院的学科交叉应优势；第四，教师队伍质量决定学校质量，学生质量决定学院发展，所以要更加注重教师工作；第五，创造更多的机会让学院毕业生与在校生之间的有更多的交流机会。
       陈向群书记最后发言，她希望各位学院同仁能在面对不断变化的就业形势，不断变化的产业结构，不断变化的人才需求中加强团结，配合协调，求真务实，开拓创新，扎实做好今后的各项工作，不断地去庆祝学院的丰收，学生的丰收，自己的丰收。
       大会在热烈的掌声中落下帷幕。
       白志强教授表示，他在软件与微电子学院工作了11年，这成为他人生中的一笔宝贵财富，他要感谢软微学院的领导班子的各位同仁，感谢所有老师与工作人员，正因为有了全体同仁的努力，才使学院从无到有，从弱到强走到今天。白志强老师祝愿软微学院越办越好，也期待软微学院与深圳研究生院之间进行更多的联系与合作。
       10月17日上午，北京大学软件与微电子学院成立十二周年暨2013-2014学年总结大会在学院大兴校区举行。北京大学软件与微电子学院理事长杨芙清院士，北京大学软件与微电子学院学术委员会主任王阳元院士，北京大学深圳研究生院常务副院长白志强教授，软微学院全体领导班子成员和全体教职员工出席会议。大会由学院党委书记陈向群教授主持。
       2014年6月7日上午，以“燕园聚首，软微大兴”为主题的北京大学软件与微电子学院校友返校活动在北京大学英杰交流中心举行。北京大学软件与微电子学院理事长杨芙清院士，学术委员会主任王阳元院士，北京大学校友会秘书长李宇宁，北京大学副秘书长兼任软微学院副院长白志强等领导、院友代表及学校各职能部门代表出席了此次活动。软微学院院长张兴、常务副院长杜鹏、副院长苏渭珍、副院长林慧苹等与300余名院友、在校师生一起参加了此次活动。活动由学院党委书记陈向群主持。
       上午9点，杨芙清院士、王阳元院士到达会场，与在场校友、师生一一握手，进行了亲切的交谈。9点30分，活动以师生共同演绎的诗朗诵《京南燕园》正式拉开序幕。“十二年软微，创业创新进取，展露头角；春去秋来，画卷铺开；人来人往，精神接棒”，“十二年，勇攀软微科技育人之巅，我们居于京南燕园，时常回望坎坷之路。”诗歌声情并茂地展现了北大精神在京南燕园和太湖之滨结出的丰硕果实，回顾了十几年来软微学院所取得的教学成果和精神追求。
       李宇宁秘书长首先祝贺活动胜利召开，他介绍了北大校友会的发展历史和现状，分享了部分优秀的校友会组织及其对母校的贡献，并希望软微学院校友会能够持续下去，越办越好，不断增强学校、老师和校友之间的沟通与合作。
       活动上，杨芙清院士致辞并寄语校友。“欢迎你们回家”，杨老师亲切的问候让在场的每一位校友都倍感温暖。杨老师首先肯定了校友们在各行各业的努力和取得的成就，并表示，希望校友们能够“常回家看看”，不断增进与学院、老师的交流与合作，并将自身积累的经验传授给学弟学妹。杨老师说，希望大家能够团结在软微这个大家庭里，共同为实现中国梦而努力奋斗。
       随后，张兴院长在活动上讲话，他在发言中指出，毕业生院友应充分发挥积极作用，将社会对产业的需求及时反馈给学院，促进教学计划的改进和人才的培养。“要保持国内一流，争创世界领先”，张兴院长表示，通过师生的共同努力，软微的未来一定会更好。
       白志强老师曾担任软微学院党委书记多年，对软微有着深厚的感情。他说，近年来软微学院愈发兴盛，毕业生院友已经逐步形成良好的社会资源并为学院和在校学生搭建了越来越广阔的发展平台。白老师回忆了软微学院创业时的艰辛与创业者们的努力，他希望学院能给在校同学们提供更加广阔的发展平台，毕业生校友们也不要忘记经常“回家看看”，为母校贡献自己的一份力量。
       王阳元院士高度概括了软微学院的产学研结合理念、工程应用型人才培养思路及创业创新精神。王老师劝诫大家胜不骄、败不馁，教导大家埋头苦干，并希望各位校友能够把自己的命运同国家的发展联系在一起，把北大精神与核心价值观传承下去。王老师还说，同学们走上工作岗位之后要经常回母校看看，软微永远是大家人生路途中的加油站。
     在校友发言环节，软微学院三届校友代表------2002级的孔令博，2008级的蒲俊，2012级的姜楠依次发言。他们表达了对过去学院学习生活的怀念，介绍了各自的职业发展历程，畅谈了对母校未来发展的建议。
       活动上，张兴院长还向在场全体人员详细介绍了软微学院新十年的发展规划等内容。同时，活动现场还发布了软微学院校友会的相关信息，包括由软微在校同学建设的信息分享微信平台，校友联谊网站等相关内容的建设进展等。 
      十二年的创新创业历程见证了软微学院的变化和发展，也见证了软微学子的成长和壮大。此次校友返校活动上，众多校友们深情回忆起在软微学院的学习生活经历，并对学院的培养教育表达了深深的感激之情。学院将在接下去的工作中进一步推进院友会的建设，加强广大院友和母校的多重沟通渠道和联谊合作。软微学院将永远是广大院友拼搏前行的坚强后盾，是大家停驻依靠的人生港湾！
       2014年7月5日，由华北地区EDA/PLD技术研究会主办，北京大学软件与微电子学院和信息科学技术学院共同承办的华北地区EDA/PLD技术研究会2014年第七届教学研讨会在北京大学顺利召开。来自北京、天津、河北、山东、江苏、上海等地EDA/PLD技术研究会名誉理事长、理事长以及副理事长、常务理事、理事、嘉宾、老师和同学代表130多人参加了会议。华北地区EDA/PLD技术研究会理事长、北京交通大学计算机学院丁晓明教授代表主办方致辞！北京大学电子信息科学基础实验中心主任王志军教授代表承办方致欢迎词。会议由研究会副理事长、软件与微电子学院微纳电子与嵌入式系统学科组曹喜信教授主持。  
       上午的会议分为三个主题：“口袋实验室”教学经验交流、高层次系统设计在教学科研中的应用，以及最新技术及教学资源介绍。来自北京大学、清华大学、北方工业大学和北京交通大学的老师分别介绍了自己的教学经验和实验心得。下午进行了实验观摩。 与会代表正在进行学术交流
       本次会议有两个显著特点： 一是来自第一线的实验教学的老师较多，他们对新的实验教学工具和设计工具很感兴趣；二是更加关注实验教学和企业大学计划政策，以及新技术如何更快地引入学校校园。本次会议的召开，将对各个大学开展电子信息科学基础教学起到促进作用，也对贯彻近期颁布的《国家集成电路产业发展纲要》起到积极推动作用。
 
       9月7日上午，北京大学软件与微电子学院2014年开学典礼在学院大兴校区隆重举行。北京大学软件与微电子学院院长张兴，常务副院长杜鹏，副院长吴中海、林慧苹、张光红，以及学院各职能部门的负责老师与全体新生一起参加了活动。开学典礼由北京大学软件与微电子学院党委书记陈向群主持。
       2005届毕业生孔令博首先发言。他通过自身在软微的学习生活经历，向2014级新生分享了自己的一些感悟，他勉励师弟师妹珍惜硕士阶段的三年时间，通过软微独具特色的学科设置，成为一名全面发展的人才，培养自信的气质和谦虚的内涵，最终收获浓浓的友谊。
       2014级的金融信息方向的汤思同学通过一首歌曲的歌词表达了广大新生对于来到软微学院的向往。她表示要努力学习传承往届软微学长的精神，在软微这个大家庭中用心学习，生活，并且取得不断进步。
       赵占波老师向新同学提出了三点要求。他希望广大新生在自己的硕士生涯中树立明确目标，不断优化和改进学习方法，适应新的学习环境并且不断强健自己的精神和体魄，多读书多交友，在学院收获一份属于自己的情感。
       在热烈的掌声中，北京大学软件与微电子学院2014年开学典礼落下帷幕。在学院领导、老师的殷切期望与悉心关怀下，软微学院2014级新生定会度过一段最精彩的学习时光，成长为在软件与微电子领域和其他各个领域可堪大任的栋梁之才，为国家的前行和民族的发展贡献力量！
       陈向群书记做最后总结发言，她希望广大新生既要有脚踏实地的实干精神，又要有心怀家国的北大情怀。祝愿2014级新生和软微学院一起共同见证彼此成长，共同取得傲人的成绩。
       张兴院长代表学院向2014新生表达了祝贺。他首先讲述了软微学院培养高端工程型人才的办学目标和学院 “面向产业，培养人才；面向需求，建设学科；面向领域，凝炼方向”的办学特色，希望大家在软微学院三年的学习生涯中养成正确的学习方法和不断进取的精神，培养自己的团队精神和集体意识，成为一名值得信赖和尊敬的人。最后张兴院长还祝愿2014级新生传承起往届师生为软微学院所带来的良好声誉，为学院的发展做出自己的贡献。
       2014年6月11日下午，本学期选修软件实现技术课程的25位同学在蒋严冰老师的带领下，再次来到微软亚洲研究院，向微软亚洲研究院的老师们汇报各个小组一学期来研发的“云+端”应用。微软亚洲研究院创新工程总监田江森、高级开发主管殷秋丰、工程师杨帆、工程师郭旭、学术合作经理孙丽君以及微软（中国）公司平台事业部的资深技术顾问王艳参加本次活动，并就每个小组的展示内容与同学们进行了深入的探讨和互动。
   本次展示的项目全部由选课同学独立创意，在当前“云+端”的软件发展背景下，结合学习综合微软的windowphone8、windows8、windows azure等技术，以小组为单位完整实现。所有项目都比较成熟和完善，有些应用已经在微软应用市场发布。在完整的微项目的开发过程中，不仅学到了微软“云+端”最新的技术知识，也锻炼了创新创意、团队合作、项目推进等能力。
      整个答辩过程紧张、有趣、生动、活泼。答辩同学与微软的技术专家从需求、技术架构、开发细节、测试方案直到盈利模式进行了广泛的交流和讨论，专家对如何进一步完善同学们的项目给出了指导。最后经过专家的评定，Paragon小组的一款人机语音协助应用“小二语音助手”获得了本次课程最佳项目称号，Try小组的一款师生课堂实时互动应用“CLassRoom”获得了本次课程最佳项目称号。田江森老师为获奖团队颁发了证书，并邀请选课同学来微软研究院实习。最后孙丽君老师带领同学们参观了微软亚洲研究院的工作环境。
      本次课程积极寻求微软各个部门及其合作伙伴的各种教学资源，为选课同学提供了丰富的实践机会，综合运用和践行“反转课堂”、“做中学”等崭新教学理念，为选课同学提供了开放、互动、宽松、有效的全套多维教学和实践环境。课程先后邀请了10多位来自学院、微软及其合作公司的老师为同学们讲解新技术或在项目各阶段进行指导。微软云计算创新中心（上海）为每位选课同学提供了azure云账号，可在全球范围内部署自己开发的云服务程序。借助微软的各项活动，很多同学得到了属于自己平板和手机设备，并应用到课程项目的端开发和调试中。在课程中成功举行了微软创新杯北京大校园选拔赛；一只主要由本次选课同学组成的团队进入微软创新杯中国区决赛，并获得二等奖；5支选课团队都参加了微软Imagine Camp，并获得奖金；一位选课同学获得微软全球应用开发马拉松（北京）活动，并获得第一名。本课程在今年4月也获得了“微软云计算先锋课程”称号。
 
       5月29日上午，由北京大学学生工作部主办的第5期“教授茶座”在光华管理学院院史馆举行。北京大学信息科学技术学院杨芙清院士与通过“燕园学子微助手”微信平台报名的22位同学围绕“人生之路”的主题展开了交流讨论。学生工作部部长张庆东、副部长陈征微参加了活动。
       杨老师在茶座开始时表示，为了参加这次茶座，对同学们的问题她都事先作了一些思考，希望同学们畅所欲言，话题不必局限于学术范畴，也可以一起讨论“人生的实践”等话题。杨老师说：“人生之路，既是奋斗之路、报国之路、奉献之路，也是人生价值观的实践之路、实现之路。”
       信息科学技术学院的周宗楷请杨老师与同学们分享她的读书经历与感悟，杨老师便回忆了少年时期获得数学启蒙的过程。谈到曾因解题思路独特得到老师加分的事情，杨老师说道：“学习不仅是学知识，更要思考学习的规律，寻找不同方法之间的关联。”她还结合自己文学和历史方面的爱好，建议同学们拓宽知识面，广泛涉猎不同的专业。
       杨老师特别讲道：“一个人没有一直顺利的时候，我中学时的数学成绩是最好的，所以老师建议我报数学系，但是大学的第一次数学考试——微积分考糊了，当时我想不通，就给我的老师冯其庸写了一封信，想回到中学，冯先生回信说‘一个人的一生都会碰到困难，遇到挫折，都要经历坎坷，这种时候只有你勇往直前，克服困难，跨过挫折。回到原点是走下坡，只有往前走才能够有所发展、有所成就’。老师给我的教育，我终生受益。在那之后我解开了心结，很好地去注意别人是怎么学的，学习别人的长处，把握学习规律，后来在江泽培老师的实变函数的课上考试，我考得最好，所以我的信心又回来了。”
       对外汉语教育学院的王媛媛提出了如何克服瓶颈期的问题。杨老师认为，要把个人理想融入集体之中，集体的力量会克服个人成长的瓶颈。大学阶段，即青年时期，是人生的成长阶段，是人生观、价值观的形成阶段，要学习知识，提高能力，更要提高道德修养，不要把德和智分开。她说，五六十年代没有那么多诱惑，青年学生的思想都是要为国家和人民服务。所以熄灯后去教师宿舍用报纸罩着灯“开夜车”，背着“饭盆”先去图书馆占座再去食堂打饭，都不觉得辛苦。杨老师在回忆被派往苏联学习的经历时说，因为怀着对国家的感恩，她格外能静心，能坐得住，在苏联她是第一次看到计算机，而编程序一次就成功了，连老师都很惊讶。
       杨老师希望同学们把握青春时光，严格要求自己，“青春一生只有一次，不能做没有意义的事情，要做就要做到最好。常常有人说我看起来很年轻，我想这是因为我总和年轻人在一起，沾染了你们的朝气，使我心态年轻。我有为国家富强和民族复兴而奋斗的追求，这种追求使我年轻。”
       在回答光华管理学院尹俊同学问题时，杨老师谦虚地说：“我不是‘学术泰斗’，我仅仅是一块铺路石。科技发展很快，一个人的能力是有限的，只有依靠团队才能作出贡献。我不过是团队中兢兢业业的一员，最多算一个带头人。带头人身上的担子很重，如果带头人领错了方向，影响的不是你自己一个人，而是一批人。”
       在回答软件与微电子学院金乾同学关于择业的问题时，杨老师说：“工作无高低之分，人无贵贱之分。尊重别人就是尊重自己，尊重别人，别人也就会尊重你。”她希望同学们带着心怀感恩，服务社会的心态走上工作岗位，“机缘对每个人都是公平的，就看你怎么才能抓住机缘。我的建议是，为国家作贡献，顺应时代大潮流去成长。”她寄语在场同学：“勤奋出天才，务实创大业”，勉励同学们把学到的本领用到实处。
    “教授茶座”是知名教授与青年学生分享成长经历、共话科学精神和人文素养的校园文化品牌活动，由学生工作部于本学期创办，至今已举办5期。今后，学生工作部将继续邀请各领域的知名教授做客“教授茶座”，与同学们进行交流，也将通过“燕园学子微助手”微信平台等途径发布各场次活动的报名通知、新闻动态和“教授茶座”微语录。
 
       1、人生之路，既是奋斗之路、报国之路、奉献之路，也是人生价值观的实践之路、实现之路。       2、要有理想，有目标；要勤奋，要坚韧；要有团队精神，多为别人着想，学会换位思考。       3、学习不只是学知识，更是学能力，学获取知识的能力。本科是打基础的阶段，是通过学习知识，提高思维能力，提高分析问题和解决问题的能力。这时，知识才能真正内化于心。       4、北大是多学科综合性大学，不同学科的学生在一起，接触、交流，可以吸取不同学科的知识、理念，开阔视野，拓展、深化自己的专业。“三人行必有我师”。       5、要多读书，多思考，特别是经典著作，是数千年的积淀，它的作用是无形的。会陶冶你的情操，提高你的文化素养。       6、教学是培养学生的思维能力和创新精神。       7、教师的责任是发现学生潜质，激发兴趣，启迪智慧，培养自信。       8、做学问要静心、潜心、坚忍不拔。       9、确定研究方向时要认真、严谨，要有前瞻性，面向国家需求，还要考虑国际科技发展趋势，时刻关注发展动向，把握方向。       10、在研究方向确定后，就要坚持，有韧性。遇到困难、阻力或不被理解时，要有信心，有克服困难的勇气和坐冷板凳的精神。       11、人要有诚信，做事要认真，答应的事一定要认真去做，而且要尽力做到最好。“世界上怕就怕认真二字”。       12、北大是常为新的。在“常为新”氛围的培育下，我总喜欢干创新而又有挑战性的事。越有挑战性就越兴奋，越困难越有斗志。       13、我不是“学术泰斗”，我仅仅是一块铺路石。我很荣幸人们称我是“软件工程的铺路石”。       14、科技发展很快，一个人的能力有限，只有依靠团队才能做出贡献。我不过是团队中兢兢业业的一员，最多算一个带头人。       15、我的收获是，成果用上了，团队成长了，学科发展了。我的遗憾是，由于环境和条件的限制，很多事没能做，我希望能与你们共同努力。老骥伏枥嘛！       16、国家需要就是我的志愿。       17、常常有人说我看起来很年轻，我想这是因为我总和年轻人在一起，沾染了你们的朝气，使我心态年轻。我有为国家富强和民族复兴而奋斗的追求，这种追求使我年轻。       18、要有一颗感恩之心、一腔报国之情，把个人理想融入国家事业中，把感恩转化为对国家的责任。历史的际遇、机缘就在你身边。       19、执着地奋斗、无私地奉献，必将使你成长为国家的好儿女、实现中国梦的栋梁之才，你也会在奋斗、奉献中拥有无穷的乐趣，享受到无比的幸福。       20、勤奋出天才，务实创大业。
       为深入开展学校素质教育活动，进一步推进校园文化建设，2014年6月25日上午，北京大学软件与微电子学院2014年上半年《素质教育》课程优秀作品展评于大兴校区3302教室正式举行。13名同学现场展示了作品，并接受了评委们的点评。截至比赛当天，本学期的《素质教育》课程已经成功举办了5次讲座，期末时700多位同学作了展示。经过层层选拔，优中选优，有13名同学脱颖而出。       比赛未开始，3302教室已座无虚席。比赛进程中，高潮迭起，亮点频出。进入决赛的13名选手各有特色，来自科技三苑的陈朝明面向国家发展需求，制定个人的未来职业发展规划；科技二苑的关启强用其独特的视角解析了成功的定义和“无为”的职业规划；经管五苑的李林晓自信坦然，介绍了互联网创新思维对个人职业规划的影响；文艺二苑的孙洁，以轻松的方式侃侃而谈她眼中的偶像——天生没有四肢但勇于面对身体残障、创造生命的奇迹的尼克•胡哲，并以偶像的经历思考个人的人生发展及职业规划，强调了态度决定高度的重要性，令人耳目一新；科技一苑的夏桂芳清晰规划了个人职业生涯，并根据SMART原则对规划进行了论证；经管一苑的张凌宇则强调兴趣与现实的结合的理性思维；经管四苑的王赟极致地把四象限时间管理法应用到个人学习生活中；经管二苑的李思洋以其独立的思考能力提出了真理是简洁的而不是简陋的等一系列令人耳目一新的见解；经管三苑的史乐以情动人，讲述了“现代钱学森”施一公博士留美学成报效祖国的不平凡经历，深深打动和震撼了在座的同学。       最后，来自文艺二苑的孙洁以新颖的立意、入情入理的演讲风格得到绝大多数评审们的肯定，夺得本次演讲比赛的第一名。       《素质教育》课程通过文献阅读、专家和企业家讲座、专题讨论、演讲实践、专题活动等形式，实现在学生自身基础上逐步提高思想道德素养，了解和树立正确的世界观和价值观，启发其创新意识和追求真理的精神，提倡健康的体魄和心理，提高审美能力和管理沟通能力，做到既有独特的个性，又能全面综合发展。
 
       北京大学软件与微电子学院在国内首先开设“计算机辅助翻译与写作”方向专业硕士课程，致力于培养现代化的语言服务人才，毕业后学生将能胜任诸如技术写作、技术翻译、翻译管理、电子出版及关联技术开发等岗位。近年来，该方向毕业生从事技术写作行业工作的人数逐年增多，在行业内有了一定的影响力。此方向的开设与发展不但得益于北大在技术传播领域较多的理论积累，更依托于软件与微电子学院的办学背景和思路。但技术传播是实践性非常强的学科领域，理论的发展远远跟不上实践的脚步，只有进一步加强该领域的科研与教学实力，才能更好地增强毕业生的就业竞争力。       技术资料包括用户手册是成熟技术产品的必要组成部分。华为公司在资料开发和技术传播领域有着深厚积累和广泛实践，建立了信息架构设计和文档写作的合理的业务流程、技术方法、标准规范、工具平台，其内部人才培养已经形成比较完整的体系。无论是生产量还是技术成熟度上，在行业内都居于领先地位。为顺应行业趋势和用户需求变化，更好地支撑公司的发展战略，华为公司资料部与学院语言信息工程系达成意向共同合作研发，培养适用人才。       双方在科研与人才培养领域都有着类似的需求，通过多次交流会谈，确立了强强联合、合作共赢的产学研发展道路。双方在培训认证、技术研究、合作开发等方面探讨了合作的意向。 作为合作的开端，2014年4月至5月期间，华为公司资料部门的资深工程师为北大学生提供了多次研讨课程，课程形式新颖生动，与产业实践紧密结合，大大提高了学生的动手能力，在学生中获得了广泛的好评。       双方将进一步在自然语言处理技术的写作技术研发、综合性技术写作人才培养标准和实践等领域展开合作交流，稳步推进更深层次的合作发展，为技术传播学科在中国的发展贡献力量。
       在学科前沿报告部分，黄莹博士作了题为《大数据及其应用》的主题报告；窦文章教授在演讲中深入浅出地阐述了创新管理的相关思想，并就互联网思维的创新和在场同学们作了热烈的互动和分享；黄嵩副教授则就当前十分火热的互联网金融向同学们进行了前沿领域讲授。
       据悉，为期三天的夏令营活动日程安排紧凑，形式多样，开设了学科前沿报告、专业领域论坛、科目笔试、实验室参观、面试等环节，在增进相关学科大学生之间思想和学术交流的同时，也有助于北大软微学院遴选出适合本院的学生。
       开营仪式由北京大学软件与微电子学院副院长林慧苹副教授主持。出席开营式的嘉宾有北京大学软件与微电子学院院长张兴教授、联想集团副总裁、联想研究院云与智能计算实验室主任黄莹博士、学院金融信息与管理技术领域窦文章教授、黄嵩副教授，以及各职能部门 办公室的老师们。       张兴院长致辞并寄语在场同学。他首先祝贺同学们通过学院筛选评审，顺利成为此次夏令营大家庭的成员。张院长和同学们回顾了北大百年学府的历史，介绍了2002年至今北大软微学院的发展历程，并介绍了学院 “面向产业，培养人才；面向需求，建设学科；面向领域，凝炼方向”的办学特色。张院长颇有深意地告诉同学们，本次夏令营中，同学们应珍惜相识的缘分，在以后的学习和成长中相互学习，共同成长，朝着目标共同努力。       随后，林慧苹副院长进行了软微学院创新人才培养模式介绍，从办学理念、学科建设、综合能力培养、师资队伍建设、学院发展规划等方面向在场同学进行了介绍。
       2014年7月19日下午2点，北京大学软件与微电子学院迎来了2014全国优秀大学生夏令营营员，250多位来自全国各地的同学洋溢着喜悦的笑容，期待着为期三天的夏令营学习生活。       此次全国优秀大学生夏令营是软微学院举办的第二次夏令营活动，该活动旨在增加来自不同院校的本科学生对软件与微电子相关学科及北大软微学院的了解，并吸引优秀学生在本科毕业之后来北大软微学院继续深造。据悉，此次夏令营共收到全国各地超过600名优秀大学生申请，经过严格的筛选评审，约250名学生脱颖而出，获得了营员资格。
       由软件与微电子学院承办的第七届服务科学国际会议ICSS 2014于5月22日至23日在无锡成功举办。本次会议由北京大学与教育部-IBM服务学专家协作组联合主办，北京大学软件与微电子学院承办，共有来自美国、法国、白俄罗斯、中国大陆及台湾地区的70余名学术界和工业界的专家、学者齐聚无锡，研讨服务科学、工程与管理的学科建设和研究进展。
       大会由北京大学软件与微电子学院无锡产学研合作教育基地主任王平教授主持，学院副院长吴中海教授宣读了杨芙清院士的致辞稿，IBM大学合作部总经理王浩和无锡市信息化与无线电管理局张克平局长也分别在大会上致辞。学院软件技术与服务工程领域学科组的李伟平教授、莫同副教授等老师，以及部分工程博士、工程硕士研究生参加了会议。
       服务科学国际会议是2008年由教育部-IBM服务学专家协作组发起的高端学术会议，已在北京、台北、上海、杭州、深圳等地成功举办过六届，此次是首次落户无锡。会议注重于服务科学、工程、管理和产业实践中的科学问题和关键技术研究，本次大会以大数据与服务科学、智慧城市与服务工程为主题，会议内容覆盖计算机科学、软件工程、工业工程、管理科学以及社会和认知科学等多个学科领域，为参会者提供了学术交流和技术研讨的平台。
       无锡市信息化与无线电管理局张克平局长应邀出席会议并做了内容为“智慧城市建设的实践与思考”的主题报告，报告介绍了无锡智慧城市建设和发展情况。哈工大校长助理徐晓飞教授在会上做了大服务的主题报告，报告题目为“A New Service Engineering Paradigm for Big Service in Big Data Environment”。北京大学软件与微电子学院副院长吴中海教授在会上做了主题报告，报告题目为“大数据与服务计算”。
       会议安排了两场研讨，第一场研讨主题为“大数据与服务科学”，由清华大学自动化系党委书记周杰教授主持，参加研讨的嘉宾包括哈工大校长助理徐晓飞教授、复旦大学计算机系张亮教授 、会议程序委员会共同主席黄莹教授、IBM中国研究院徐景民经理。
        IBM全球服务研究前主任，首次提出“智慧城市”的专家柯林 哈里森专程来锡出席会议，并做了内容为“Urban Systems”的主题报告。主题报告介绍了智慧城市概念的由来，并分析了智慧城市与服务科学之间的关系，展望了智慧城市的发展前景。
       第二场研讨主题为”智慧城市与服务工程”,由北方工业大学云计算研究中心主任韩燕波教授主持，参加研讨的嘉宾包括北京大学软件与微电子学院无锡产学研合作教育基地主任王平教授、IBM全球服务研究前主任Colin Harrison、复旦大学范秀成教授、北京大学软件与微电子学院的李伟平教授。
       2013年10月至2014年6月，历经8个月时间，北京大学第二十二届“挑战杯”系列赛事历经初评、复评、决赛答辩环节，圆满落幕。该项赛事由北京大学校团委、北京大学“挑战杯”科技工程办公室组织举办。
       本次挑战杯系列赛事得到了学院团委老师的大力支持，从参与挑战杯赛事宣讲会到学院8支队伍最终取得好成绩都给予了充分的支持和鼓励。最终，共有35支队伍成功提交作品，同时获得可喜成绩。其中由陈向群老师指导，栗阶等同学组队研究的《脑机交互技术研究及基于脑电波的游戏角色控制引擎的设计与实现》喜获特等奖。另外，《中国移动LBS业务的服务质量评价和用户需求研究》队伍获得一等奖，《我国个人信用评分模型研究及应用-基于北京市高校学生的个人信用评分模型探究》队伍以及《基于模式匹配算法的社交APP开发》队伍获得二等奖，另外四支队伍获得三等奖。
       双方商定，在合作意向的基础上，将在下一阶段进一步加强交流，在科研成果转化、人才培养等方面努力寻找契合点和突破口，开展有效合作。
 
       8月5日上午，北京大学信息与工程科学学部主任、软件与微电子学院理事长杨芙清院士在理科一号楼1504会议室会见了台达电子集团CEO郑平先生一行，双方就建立校企合作的可能性进行了深入的探讨和交流。北京大学软件与微电子学院院长张兴、软件工程国家工程研究中心主任张世琨、软件与微电子学院副院长吴中海、软件与微电子学院无锡产学研合作教育基地主任王平等陪同会见。
       杨芙清院士首先对郑平先生一行的到访表示欢迎，并对台达电子成立四十余年来在行业创新、节能环保等领域所取得的成就表示高度赞赏。杨芙清院士向郑平先生回顾了北京大学的发展历史，对软件与微电子学院、软件工程国家工程研究中心的学科优势和发展情况进行了介绍。她表示，北京大学在软件、微电子及其交叉领域有着非常强的研发能力和成果转化能力，相关院系十分注重扩大合作战略空间，非常欢迎台达电子等国际知名企业与相关院系在共同感兴趣的领域建立合作关系。       郑平先生与台达电子首席技术官、研究院院长李实恭博士详细介绍了台达电子在“电源及元器件”、“能源管理”与“智能绿生活”等三个深耕领域所作出的努力和取得成就。郑平先生谈了自己对校企合作的思考和建议，并希望与相关院系开展在技术研发、人才培养等方面的合作。
       音乐会分为上下两场。上半场，北京交响乐团的“雲”弦乐四重奏带来了《莫扎特弦乐四重奏》、《瑶族舞曲》、《神秘园》、《一步之遥》、《查尔达什》五首风格迥异的经典曲目，既有17世纪西方宫廷风格的重现，又有中国传统民族风情的演绎，曲调时而舒缓，时而欢快，跫音绕梁，令人回味。在下半场，“梧”木管五重奏首先带来了曲目《一个美国人在巴黎》，将美国作曲家格什温在巴黎的情感表达地淋漓尽致，再现了巴黎街头的繁华与喧嚣。随后又演奏了《植物大战僵尸》配乐选段，展现了现代韵律之美。在演出过程中，艺术家们精湛的演绎技巧、完美默契的合作，配上通俗易懂的讲解，让我院师生在感受音乐魅力的同时还了解到音乐美学的相关知识。
       2014年5月21日下午，国家大剧院五月音乐节·2014公益演出走进我院，演出在研发楼多功能厅成功举行。这是北京交响乐团继2013年音乐节后第二次来到我院，演出吸引了近130余名师生参加，现场气氛热烈，座无虚席，国家大剧院副院长杨静茂、软件与微电子学院党委书记陈向群出席了本次活动。
       据悉，国家大剧院从2009年至今已成功举办五届音乐节，邀请到海内外众多大师名团，将高雅的音乐之美广为传播，北京交响乐团以其精湛的技艺和非凡的表现力得到各界赞誉。本次演出为我院的师生带来了一次饕餮盛宴，让大家在繁忙的学习生活中领略音乐之美，师生们期待他们再次的精彩演出！
       演出前，陈向群书记致辞，她首先对国家大剧院的领导和艺术家们的到来表示热烈欢迎和诚挚感谢。她表示，这是一次让学院师生近距离接触音乐之美的机会，整场曲目中西合璧，高雅而接地气，非常期待乐团的精彩演出。
       6月24日，软件技术与服务工程领域莫同老师和褚伟杰老师带领团队参加了“2013-2014 IBM-高校联合创新实验室北京区汇报大会”。大会在位于盘古大观的IBM 大中华区总部召开，IBM中国开发中心AI主席刘慎峰先生，IBM中国系统与科技研发中心学生创新实验室项目经理王晓朋先生，IBM中国开发中心学生创新实验室项目经理王艳女士，IBM大中华区大学合作部关系经理赵跃女士，IBM大中华区大学合作部项目经理蒋涛女士，相关项目技术工程师，以及北京大学、中国人民大学、北京邮电大学和北京工业大学等四所高校的师生团队参加了此次会议。
       会上，刘慎峰先生，王晓朋先生和王艳女士先后致辞，介绍各自工作领域的发展历程，畅谈了对系列活动的建议。随后，来自四所高校的五个项目组先后进行了项目汇报。莫同老师带领的团队参与的项目是Smart Cloud Entry，该项目融合openstack和hadoop产品，支持用户快速建立hadoop集群并根据用户需求或集群负载能够动态的对集群进行资源扩展；褚伟杰老师带领的团队参与的项目是DevOps for Cloud Infrastructure，该项目利用建立虚拟环境实现web server的快速部署。在场评委对北大软微学院的两个项目给予了高度的评价，两个团队的所有同学均获得了优秀称号。
   
       会后，主办方组织了参观活动，带领师生参观了位于盘古大观顶层的IBM大中华区总部。       据悉，IBM-高校联合创新实验室作为高校引入IBM项目的平台，每年由IBM根据业界技术热点及行业紧缺人才的培养方向，选择3－5个目前正在进行的实际项目加入实验室与高校师生合作。通过学生参与项目的实施，共同培养创新型及应用型信息技术人才。
       8月22日上午，北京大学软件与微电子学院在研发楼1410报告厅召开全院教职工大会，宣布北京大学关于学院新一届行政领导班子的任命决定。北京大学副校长兼研究生院院长陈十一院士、校党委组织部郭海部长出席会议，学院理事长杨芙清院士及学院全体教职工参加了大会。大会由软件与微电子学院党委书记陈向群教授主持。
       学校党委组织部郭海部长代表北京大学宣读了关于软件与微电子学院行政班子任职的通知：学校研究决定，任命张兴为北京大学软件与微电子学院院长，杜鹏为北京大学软件与微电子学院常务副院长，吴中海、林慧苹、张光红为北京大学软件与微电子学院副院长。原班子成员自然免职。       郭海部长对学院新上任行政班子表示祝贺，他说，此次对软件与微电子学院新一届行政班子换届的任命，是经过学校广泛征询意见、通盘考虑、慎重研究、严格按照学校学院行政班子换届的组织程序做出的决定，并对新班子寄予厚望，相信他们一定会带领软件与微电子学院做出更好的成绩。
       陈十一副校长代表学校对软件与微电子学院新一届行政班子表示祝贺，对软微学院成立十二年来在教学科研、学科建设、产学研发展所取得的成绩给予高度肯定，对在杨芙清院士带领下的学院全体教职员工所付出的努力表示敬意，称赞软微学院上一届行政班子为学院的发展做出的积极贡献。陈十一副校长殷切期望软微学院全体教职员工在新一届领导班子的带领下，发扬团结协作、积极进取的精神，踏实工作、锐意改革，为软微学院做出更大的贡献。
       张兴院长随后代表新一届行政班子致辞。张院长在致辞中对学校及学院理事会对学院建设发展的持续关心和支持表示深深的感谢，对分别因年龄原因和工作调动不再继续担任软微学院行政职务的徐雅文常务副院长和白志强副院长在学院筹备和建设发展过程中做出的重要贡献表示敬意和感谢。       张兴院长表示，软微学院在今后的发展中要继续发挥办学优势，踏实开拓、锐意创新，不断实现新的超越，为国家高端工程技术创新人才的培养做出重要贡献。
       杨芙清理事长最后发表总结讲话。杨芙清院士和大家分享了软微学院十二年来的创新创业历程，对学院历届领导班子及全体教职工员工做出的重要贡献和取得的成绩表示肯定和赞扬。她表示，软微学院长期以来努力探索和完善适合高端工程人才培养需求的研究生教育体系，结合国际科技发展态势和国家发展需求深入研讨软件工程学科的发展定位、学科内涵和培养目标，取得了骄傲的成绩，在接下去的发展中，学院要继续紧跟学科发展的新趋势，紧扣产业发展的新需求，在教育科研、人才培养、社会服务、文化传承创新等各方面做出新的贡献，为学校加快创建世界一流大学注入更加强大的动力。
      近日，在北京大学组织的青春诗会上，一位身着素雅蓝衣的优雅长者，手捧诗稿，与青年学子一道，饱含感情地大声朗诵着《沁园春·长沙》和北大学生自己创作的诗作《聆听青年》，在静园草坪上豪迈地挥洒诗情。　　神采奕奕，容光焕发，当这位80多岁的老人站在你面前的时候，你往往被她的气定神怡、精神饱满所感染。虽然已是耄耋之年，但依然有一颗年轻的心。而就是这样的一位老人，在中国软件科学的历史上留下了浓墨重彩的一笔。　　她就是杨芙清，中国科学院院士，北京大学信息科学技术学院教授。　　这位慈祥的老人，向记者讲述一个又一个故事，语气时而平静，时而激动富有感染力，带记者走进那充满艰辛而又精彩纷呈的峥嵘岁月。
　　人生的重要决定　　1932年11月6日，江苏省无锡市留芳声巷杨家大宅院传来清脆的啼哭声。父亲杨介辰抱着爱女，起了斟酌很久的名字——杨芙清。他期望着长女能够像她的名字一样，如芙蓉般清新高雅，品格出众。　　不负众望，年轻时候的杨芙清已经显现出超同龄人的才气。杨芙清就读于无锡市第一女子中学，这是一所百年名校，她在各个学生团体里都是“小荷初露尖尖角”。　　解放后不久，无锡市第一届人民代表大会开幕。杨介辰胸前挂着人大代表的标志，杨芙清胸前也挂着人大代表的标志，父女二人一同参加代表大会，在杨家亲友中传为美谈。　　怀着对华罗庚先生的崇敬，她在高考时选择了清华大学数学系。到了1952年，全国大规模院系调整，北京大学、清华大学和燕京大学三所大学的数学系合并，成立了北京大学数学力学系，成为中国数学学科历史上的一件大事。杨芙清和同学们一起从清华园来到未名湖畔。　　那是一个大师辈出的年代。三所大学的系主任江泽涵、段学复和徐献瑜一同聚首燕园，他们所倡导的“团结合作，亦教亦研”等优良作风在燕园生根发芽。在大师们的影响下，杨芙清接受的是当时中国最高水平的数学教育。　　1955年，杨芙清以优异的成绩毕业，并留校师从徐献瑜教授，成为我国第一个计算数学专业的研究生。　　而当时，我国的计算机事业还是一片空白。为了研制中国自己的计算机，国家决定派代表团去苏联科学院学习计算机技术和程序设计。　　一个机会，摆在了杨芙清面前。　　这时候，杨芙清迟疑了。　　当时选择学数学，是因为她一心想成为华罗庚那样的数学家。从一开始学习基础数学，到后来研究生期间学习计算数学，再到现在要学程序设计，她在问自己——“距我所追求的华罗庚式的数学家是不是愈来愈远了”？　　短暂的思索被一个信念打断了。她意识到此时正是国家需要她的时候。杨芙清深思熟虑，说出了影响她一生命运的一句话：　　“只要是国家需要的，我就应该去做，而且要做好！”　　杨芙清做出人生中极为重要的一个决定。而支持她做出这个决定的信念，在多年后，同样帮助她做出另外一个影响中国软件科学的重要抉择。　　这样一个单纯的行为，竟使她抓住了时代的机遇，她从此进入了一个新的学科领域——计算机软件。而这个领域在不久后，便蓬勃发展，影响到每个人的工作和生活。　　从苏联科学院计算中心学习程序设计后，她又奉命转入莫斯科大学数学力学系，师从计算科学家米哈依尔·罗蒙诺维奇·舒拉勃纳学习程序设计自动化。舒拉勃纳曾多次对赴苏访问的中国学者说：“我有一个非常出色的中国女学生——杨芙清。她是一位思维敏捷、富有创造性的软件科学家。”　　天道酬勤。在苏期间，杨芙清独立设计和实现的“分析程序（逆编译程序）”，以其独创性被西方杂志称为“程序自动化研究早期的优秀工作”。　　没过多久，杨芙清接到了二次赴苏学习的消息，北京大学准备派杨芙清去苏联的联合核子物理研究所工作。而这次与5年前第一次赴苏学习的情形却相差甚远。　　当时，中苏关系已经恶化，情形不容乐观。　　“环境不好，会很艰苦”，这是杨芙清得到的消息。与5年前不同的是，她已经有了刚满周岁、尚在呀呀学语的儿子。　　襁褓中的哭声，会牵绊住这位年轻母亲的心吗？　　这次，她没有迟疑。　　她回家看看心爱的儿子，就踏上了二次赴苏的征程。有了5年前的经历，她清晰地明白此行的意义。　　这次，她以中国计算机专家的身份来到杜勃纳联合核子物理研究所，负责科学计算。这段时间，她努力学习核物理基本概念，及时总结程序设计的规律，积累有关资料。这些都为她回国后开展有关计算机科学技术的研究奠定了基础。　　国家使命，落在了学成归来的杨芙清身上。　　当时，我国能源紧张状况日益严重，急需装备先进的计算机来处理大量的地质勘探数据。面对国际上严密的科技封锁，唯一的办法只有依靠中国的科学家自己研制。
      前所未有的挑战　　1969年12月，国务院正式向北京大学下达了研制每秒100万次的大型集成电路计算机——150机的任务，杨芙清负责主持操作系统的研究。　　天降大任，杨芙清面临着前所未有的挑战。　　当时，手中连一本起码的参考资料都没有，只有她一人是用过计算机的人。其余的都是20多岁的小青年，对计算机和操作系统一无所知。困难重重，许多人信心不足。　　“我们中国人一定要争口气，把它研制成功！”杨芙清用这句话鼓舞自己，也鼓舞她手下的学生兵。　　艰辛创业，含辛茹苦。她和从事集成电路研究的爱人王阳元同赴昌平200号基地，把几个月大的女儿送到外地的公婆家，让读小学三年级的儿子孤伶伶地守着只有16平方米的家。孩子自己上学、吃饭，连生了病也是自己照顾自己。　　后来，杨芙清干脆把孩子接到昌平200号，上了农村小学。尽管如此，她也只能在深夜见到独自沉睡的孩子。　　150机是运算速度为每秒100万次的大型计算机，研制时首先得设计出指令系统。杨芙清在讨论的基础上，负责编写指令文本。这是一项十分精细、繁琐的工作。　　在反复修改中设计出一版、二版、三版，直至最后定稿，杨芙清不知付出了多少心血，熬过了多少不眠之夜。写出了指令文本后，她又率领软件组的科技人员经过一年多的艰苦奋战，终于设计出150机整套操作系统软件。　　为了与计算机研制同步，她所带领的研制组背着资料到大庆油田的108乙机上调试150机操作系统。情况特殊，不允许有丝毫差错。他们硬是把庞大复杂的程序和数据都装进脑子里，以期对调试中的问题能及时思索、推理和解决。　　他们十几个人干劲十足，昼夜倒班，每天只睡两三个小时，除去吃饭、睡觉，都在工作。在大庆调试的日子里，气管炎又犯了的杨芙清根本不舍得休息，任凭咳嗽不止，她照样咬牙坚持。　　艰难困苦，玉汝于成。仅用了23天，研制组终于把百万次多道运行操作系统调试成功。而按照常规，要把150机操作系统全部调通，至少要半年时间。　　“北京大学创造了一个奇迹！”喜讯传出，在全国同行中引起了很大震动。　　杨芙清说：“当研制组背着成果凯旋而归的时候，感到天特别亮，浑身有使不完的劲儿。”　　操作系统的调试成功，有助于硬件调试的进展。1973年7月的一天，杨芙清在机房整整工作了一夜，第二天凌晨，从昌平200号的机房里传出清晰、嘹亮的“东方红”乐曲声，整个昌平200号轰动了。　　它向人们宣告：中国第一台百万次多道运行计算机——150机研制成功了！　　这是我国自主开发的第一个规模大、功能强、能支持多道运行的计算机操作系统。　　百万次大型计算机的成功使得我国石油、地质、气象、国防工业等多个部门获益，由此引发了我国石油数字化的第一次革命。1978年，即150机研制成功的第五年，150机荣获全国科学大会奖。　　150机研制成功后，等待杨芙清的是又一个巨大挑战——240机。1973年，中国根据全球电子计算机的发展形势，提出了研制中国系列机计划。杨芙清参与200系列机软件的总体设计，负责系列机操作系统文本设计和240机操作系统设计。　　若将150机的软件设计形象地比喻为一群年轻人在一张白纸上创作出第一幅画卷，如果说这是特殊环境下的一个高科技重担的话，那么200系列机软件系统设计更是一个充满创新色彩的超级重担。　　命途多舛的240机同样承载着杨芙清无数个日夜的辛勤付出。240机操作系统曾面临下马，直到党的十一届三中全会召开后，杨芙清才依托北京大学计算机科技系重组240机操作系统攻关队伍。　　此时，摆在杨芙清面前的，是一个更为艰难的抉择。　　240机下马前采用的是“模块组合结构”，虽然在当时并不落后，但杨芙清根据当时流行的进程分层结构和管程概念，深入研究了操作系统的体系结构，提出了“层次管程结构模型和PCM设计方法”。这种结构具有结构简单、灵活，系统安全性强，运行时检查开销小等特点，要比传统的模块组合结构先进得多。　　这就意味着，若是按照原来的设计，虽然能较快地完成任务，但是将很快就会被更为先进的“层次管程结构”设计所取代。　　事实上，原先的系统是杨芙清带领十几名科研人员经过3年苦干才完成的。如果推倒重来，3年之功将毁于一旦。　　怎么办？　　“推倒重来！”　　杨芙清毅然决定重新设计240机操作系统，“决不能让它一问世就带上落后的帽子！”　　杨芙清的精明、果断和责任心，赢得了课题组全体成员的尊敬。事实上，这个决定最后被证明是富有远见的，“先进的结构，为日后的发展赢得了大量的时间和空间”。　　经过长期苦战，他们终于在1981年完成了240机操作系统全部程序的调试工作，这是我国第一个用高级语言书写的大型机操作系统。1985年，240机操作系统荣获电子工业部科技成果一等奖，杨芙清参与设计的系统程序设计语言XCY也获得国家教委科技进步一等奖。　　“我这个人就是愿意迎接挑战!”多年后，回忆起来，杨芙清依然是那样从容、自信。　　她把人生最富华彩的岁月都交给了那些最单调的计算，然而也正是这些极为枯燥的计算为国家创造了许多辉煌。
　　比尔·盖茨最想见的科学家　　240机操作系统的成功，使杨芙清成为中国计算机软件科学领域的一颗冉冉上升的科技明星，但她并未自我陶醉。　　当时国内外公认计算机软件存在“复杂程度高、研制周期长、质量难以保证”的三大难题。国外早在20世纪60年代末就出现了“软件危机”，要求发展软件工程的呼声日益高涨。　　这次，她成为软件科学大潮中的“弄潮儿”。　　她最先开始探索和研究软件工程的基础问题，组织了全国第一次软件工程研讨会，之后，她开始研究软件工程核心支撑环境，被定为国家“六五”科技攻关项目。　　著名的“青鸟工程”的序曲就此拉开。　　“青鸟”一名的来源，还有一个有趣的故事。　　“1991年，国家计委决定举办‘七五’科技攻关成果展，我们的软件系统有幸作为软件的代表参展。当时参展的集成电路设计系统取名‘熊猫’，他们优先占有了国宝的名字，我们取什么名呢？”杨芙清回忆“青鸟”命名时这样说道。　　课题专家组绞尽脑汁，试图起一个好的名字。一次会议上，北大教授周锡令念起了李商隐的诗句：“蓬山此去无多路，青鸟殷勤为探看……”周锡令的话音未落，就被一片叫好声打断了。　　青鸟，是我国古代传说中西王母的信使，专司西王母与人间信息的传递。专家组为“七五”攻关成果取名“青鸟”，正是希望为我国软件产业的起步和腾飞做出贡献，不断推动产业的发展。　　研发“青鸟工程”的主要目的是为了推进软件生产手段的变革，通过工程化开发方法、工业化生产技术，建立标准规范，提供支撑工具和环境，让软件设计从手工作坊式变革为工业化生产。　　“青鸟工程”是全国软件界的大联合、大会战的成果。青鸟Ⅰ型由10多个单位100多名科技人员联合攻关，到了“八五”期间的青鸟Ⅱ型发展到了22个单位，330多名科技人员。产学研、老中青结合，很多年轻人自称为“小青鸟”。现在，当时的“小青鸟”很多已成为软件界的骨干和学术带头人。　　如今，一只巨大美丽的青鸟直冲苍穹，而无数的小青鸟跟随而上，簇拥着，飞向远方。　　1993年，微软总裁比尔·盖茨访华时，杨芙清是他特别提出想要拜访的两位科学家之一，另一位是科学界老前辈周光召先生。在参观并动手操作了青鸟系统之后，比尔·盖茨认为“中国的软件开发已达到很高的水平”。　　盖茨第二次专程到北大访问，宴请的名单上又少不了杨芙清，再次来则邀请杨芙清作为专家座谈会的嘉宾，专门讨论了软件教育和软件人才培养问题。　　十几年的前赴后继，终于结出硕果。1996年，在“青鸟工程”成果基础上，国家计委批准北京大学成立软件工程国家工程研究中心，由教育部主管，这是我国第一个“国家级软件工程研究中心”，负责“青鸟工程”成果的转化，为科技界和产业界搭起桥梁，形成纽带。　　北大青鸟的成立，标志着中国的软件开发终于走向了产业化、进入规模化。国际软件界评价青鸟系统是具有国际先进水平的成果，是国际少有的大型综合软件支撑环境之一，因此有人称杨芙清为“中国软件业的居里夫人”。
      
　　老当益壮，宁移白首之心　　一直以来，杨芙清都时常感激她的导师徐献瑜，是她最难忘的老师，更是她走进新领域的引路人。　　在那个物质极其匮乏的年代，她忘不了导师为她提供一台手摇计算机所费的周折；她也忘不了每个周一到燕东园见导师，交出作业，导师仔细复算、分析的情形；她忘不了徐献瑜帮她整理讨论班报告的思路，一句一句地教她怎么讲时一丝不苟的态度。　　恩师于无声处对杨芙清的影响更是严谨、求实的治学之风，这一点她的学生都感受到了。　　“十几年来，受教于恩师良多，从如何选方向、治学和研究，到如何做事和为人，从如何身体力行、完善自身，到如何带领团队、凝聚合力，从如何做好学生，到如何教书育人，林林总总，难以一一列举。”杨芙清的学生、中国科学院院士梅宏说。　　她的学生、现为北京大学信息科学技术学院教授的邵维忠还记得老师与学生们同甘共苦的日子——“在上海调试240机的时候，冬天天气特别冷，把毛衣和棉袄都穿在身上，还觉得冷飕飕的。晚上工作到深夜，肚子饿了就用煤油炉煮点东西吃，杨老师年近半百的人也与我们同甘苦，这对整个队伍的士气是极大的鼓舞”。　　50多年来，她培养出100多位硕士、50多位博士和博士后，其中很多人早就做了教授、博导和产业精英，可谓桃李满天下。　　作为女科学家，杨芙清还收获一系列值得骄傲的成功：她不仅选中了一位出类拔萃的好丈夫、著名的微电子专家王阳元院士，而且养育了成功的儿女，他们拥有博士学位，而且在工作岗位上做得很出色。“夫妻双院士，儿女双博士”，这个家庭如此高的学历结构大约算得上中国之“最”了。　　杨芙清不仅仅是我国著名的计算机软件科学家，还是一位具有创新教育理念的教育家。　　早在完成150机操作系统后，杨芙清就及时把在操作系统研制的实践经验整理成《管理程序》，成为当时从事计算机系统研制者们的启蒙教材，也成为操作系统的第一代教材。在她的积极倡导和推动下，北京大学成立了计算机科学技术系，后来杨芙清成为该系的第一位教授和博导，并从1983年开始任系主任，这一干就是16年。　　2001年，教育部和国家计委下发了试办示范性软件学院的通知。杨芙清意识到这是又一个发展契机。已70岁的她立马投入到北京大学软件学院（2004年后更名为“北京大学软件与微电子学院”）的筹建中。　　在教育部和国家计委等部门组织的答辩评审会上，杨芙清作为答辩人，提出了崭新的办学模式和发展战略。　　据说，杨芙清答辩时所用的演示文稿，由于其完整的框架和崭新的思路，成为兄弟院校争相模仿的“模板”。　　杨芙清带领她的团队，把建设软件学院的想法付诸实践。她创造性地提出了“专业教育学分制、素质教育学苑式、产学研用一体化”的办学模式，这一模式在学院开花结果。　　2005年，“北京大学示范性软件学院建设”项目荣获高等教育国家级教学成果一等奖。时任国务委员陈至立在颁奖典礼上对杨芙清说：“杨老师，你做科研得奖，教学也得奖，了不起啊！”当记者问到杨芙清有什么诀窍时，杨芙清说：“没有别的，就是调动学生们学习的主动性！”　　一片赞誉声中，杨芙清并没有止步不前。　　80岁，杨芙清再一次出发，把目光投向了工程博士的培养。2012年，在“北京大学软件与微电子学院成立10周年暨首届工程博士开学典礼”大会上，杨芙清在“面向国家战略需求培养工程技术领军人才”报告中，为北京大学工程博士培养模式提出了新目标和构想。　　半个多世纪里，她一直都走在科研育人和教育创新的最前沿。她睿智而又执着的目光一直关注着中国的计算机软件科学，一刻也不曾离开。　　“将一生与祖国的兴旺、民族的发达联系在一起，并为此终生奋斗在自己的岗位上，是最有意义的。”这句话用来形容杨芙清是再合适不过的了。　　北京大学前校长许智宏院士在《杨芙清文集》（第二辑）序中，将“老当益壮，宁移白首之心”送给她。耄耋之年的杨芙清依然记得在青石板小学堂读过的名句——“穷且益坚，不坠青云之志”。　　她说，她的一生注定要这样度过。
       特别提示：本次夏令营将在营员中甄选2015年软件工程一级学科（083500）学术型直博生和学术型工学硕士推荐免试研究生候选人、软件工程领域（085212）、电子与通信工程领域（085208）、集成电路工程领域（085209）、计算机技术领域（085211）的工程硕士推荐免试研究生候选人，报名时请注意选择相应的研究方向。
 
       欢迎有意报考我院推荐免试研究生的考生积极申报并参加本期夏令营活动。
       “北京大学软件与微电子学院优秀大学生夏令营”是由北京大学软件与微电子学院针对相关学科专业优秀大学生的交流和选拔活动。
       夏令营旨在促进相关学科专业优秀大学生之间的思想和学术交流，帮助学生了解当前学科发展前沿以及北京大学软件与微电子学院的教学科研情况，同时使夏令营营员中的优秀分子脱颖而出，获得北京大学软件与微电子学院推荐免试研究生候选人资格。
       本次夏令营中有关软件工程学科专业的相关活动是由北京大学软件与微电子学院、软件工程国家工程研究中心联合组织，针对软件工程学科相关专业优秀大学生的交流和选拔活动。
       夏令营主要活动包括学科前沿报告、师生座谈、参观访问等，同时还将安排2015年接收推荐免试研究生候选人的选拔工作（相关招生信息敬请留意随后发布的北京大学2015年研究生招生信息）。
       学院近年来逐步加大研究生项目的奖学金力度，同时对学生在读期间发表学术论文、申请专利、参加国际会议进行奖励，鼓励学生潜心学习，提高培养质量。全日制工程硕士项目也设立了奖学金，包括学业奖学金、企业奖学金等，对优秀生源、学业优异者、以及家庭困难学生进行奖励或资助。
       2014年北京大学软件与微电子学院优秀大学生夏令营活动将于2014年7月18日至21日举行。其中：
       本次夏令营活动，共拟招收250人（计划报考软件工程工学、工程硕士研究生的营员共约100人，计划报考电子与通信工程、集成电路工程、计算机技术工程硕士研究生的营员约150人），各方向招收名额视报名情况待定。申请工作自"通知"发布当日开始。
       我院将为京外营员安排夏令营期间的住宿。营员须按要求全程参加活动，并将获得北京大学软件与微电子学院颁发的“全国优秀大学生夏令营”结业证书。
 
 
 
 
       材料审核及夏令营资格审定：夏令营资格审核和夏令营资格审定工作由招生委员会负责。该项工作将于6月27日结束，夏令营名单将在6月底在学院网站上公布。
 
       夏令营过程中学院将组织2015年接收推荐免试研究生的面试工作，面试将初步确定候选人，取得候选人资格的学生需在2014年9月份按照北京大学接收推荐免试研究生相关要求再次提交相关材料，学校将根据相关规定对考生的推荐免试资格等报考信息重新审查。通过审查并经北京大学研究生院审批后方能确定录取资格。
       学院2015年计划招收各专业方向如下（具体招生情况以当年发布简章为准）
 
 
 
 
 
       2014年夏令营活动的基本日程安排如下： 
       （一）计划报考软件工程工学、工程硕士研究生的营员活动时间为2014年7月18日——20日，地点在在北京大学校本部举行；
       （二）计划报考电子与通信工程、集成电路工程、计算机技术工程硕士研究生的营员活动时间为2014年7月19日——21日，地点在北京大学大兴校区举行。
 
 
 
        10月17日、18日，北京大学经济学院王俊宜教授在北京大学软件与微电子学院无锡产学研合作教育基地报告厅做了主题为“当前世界经济形势与科技革命”的精彩讲座。
        此次讲座分上下两场，吸引了无锡基地200多名研究生和30多名无锡市市委、市政府相关部门的有关领导和工作人员，以及江南大学的部分学生前来听讲。软微学院党委书记兼副院长白志强教授主持了讲座。
        此次讲座对当前无锡市在创新发展、转型发展、跨越发展，勇攀基本现代化建设新高峰的新形势下，如何正确认识当前经济形势，推进经济结构调整，具有重要的指导意义。
     杨芙清院士在致辞中高度评价了学院全体师生员工在过去六年做出的努力，并对学院已经取得的成绩表示祝贺。她用四个“永远”概括了她对学院全体教职员工的希望：1）希望永远牢记创新、创业的理念，结合国家需求，探索高教机制改革之路，探索适应创新型国家需求的高端人才培养之路，探索服务科学和学科的创新，探索交叉学科的建设；2）希望永远关注生态环境，在现有的环境中适应创新、创业，希望每个人都充满竞争意识和服务意识，有竞争意识才能创新，有服务意识才能和谐，各个部门只有建立良好的沟通才能营造良好的生态环境；3）希望永远凝练内功，学生是根本，师资是基础，机制是保障，要做事，先做人，要努力培养出色的、优秀的学生；4）希望永远遵循科学发展规律，要遵循办学的规律，坚持严谨的作风，定期进行发展战略研讨，重视当前与北大和无锡的合作发展。
      10月17日，北京大学软件与微电子学院成立六周年暨2007-2008学年总结表彰大会在大兴校区教学楼3303室召开。北京大学软件与微电子学院理事长杨芙清院士、陈钟院长、徐雅文常务副院长、苏渭珍副院长和吴中海副院长出席会议。会议由吴中海副院长主持。
      陈钟院长对学院六年来的工作及2007-2008学年的工作进行了总结。六年来，软件与微电子学院为国家培养了一批软件产业急需的高素质人才，在不同程度上缓解了软件企业对软件人才的迫切需要，促进了区域软件产业的发展，增强了我国软件产业的国际竞争力。同时，学院在如何实现高等教育人才培养结构和模式调整、培养适应经济社会发展需要的创新型工程人才方面也进行了有益的探索。他从系科建设、教学管理、师资队伍建设、对外合作与科研项目开拓、招生与实习就业、学生管理和素质教育、无锡产学研合作教育基地建设以及后勤服务等方面回顾了2007-2008学年学院的主要工作，充分肯定已经取得的成绩。无锡基地喜迎首批脱产研究生，师生获奖数量多份量重，生源质量持续提高成为标志性成果。
      徐雅文常务副院长宣读了学院人事任命决定：经2008年9月9日召开的第118次院长办公会研究决定，在学院增设院长助理，任命杨雅辉和姜淼为院长助理；同时对于学院行政部门的正副职负责人进行了调整安排。
       代表北京大学学生篮球最高水平的“硕博杯”篮球联赛于2014年5月11日晚八点在邱德拔体育馆篮球场吹响决赛号角，经过一个半小时的激烈比赛，北京大学软件与微电子学院以43比47四分惜败于北京大学国际关系学院，夺得亚军，创造了新的历史。
       晚上八点比赛哨声响起，国关率先抢到球组织起进攻，快攻不进后软微拿到篮板球，但双方都较为保守，迟迟未能打开局面，四分钟之内两边均无建树。之后软微学院率先进入状态，吕思蒙同学篮下得手，包揽软微这节的全部7分，双方以6:7结束第一节比赛。第二节双方紧咬比分，各自利用优势组织进攻，国关在阵地战中屡屡得手而软微频繁组织起快攻在篮下得手，以16:16结束本节比赛。第三节风云突变，软微球员失误增多，被对方一举反超，此时软微队员出现焦躁情绪，不断送给对罚球，国关趁机以31:22带着九分优势进入第四节。最后一节软微球员带着不留遗憾的心态放手一搏，面对国关愈发凌厉的攻势，软微稳住阵脚，遏制住了对方攻势并逐渐缩小差距，双方进入第四节最后两分钟，软微打出了职业级的战术素养，不断使用犯规战术，组织反击，缩小比分差距，在最后四秒钟时将分差追近至三分，但随着对方最后的罚球命中，最终冲击冠军受挫，屈居亚军。
      苏渭珍副院长宣布2007-2008学年评优结果：郁莲、曹喜信、杨雅辉、李伟平、林金龙、郭梅、张光红、吴昊天、王柏艳、王永明、钱进、王洪泉和周伟民等13人获得学院公司“2007-2008学年先进个人”称号。
       本次比赛得到了老师和同学们的大力支持，学院党委书记陈向群老师也到现场观战，鼓励队员们放下思想包袱，争取最好成绩。北京大学研究生会主席任庆鹏同学、学院研究生会主席李玮同学到现场为比赛加油助威。不少同学专程从大兴校区赶来为学院球队加油，营造出了热烈的主场氛围。
       篮球队在比赛中创造的佳绩离不开篮球队队员的奋力拼搏，兰铁和赛佳男两位队员负伤坚持到了最后，这一切都赢得了老师、同学以及对手的尊重，展现出学院学生良好的竞技水平和精神风貌。
   10月28日上午，无锡市滨湖区区委书记朱渭平代表江苏省委常委、无锡市委书记杨卫泽向北大软微学院无锡基地赠送了涵盖无锡地方经济、人文历史等不同种类图书40余册,北大软微学院无锡基地副主任王平教授代表基地接受了赠书。
      朱渭平书记表示，很高兴代表杨卫泽书记向无锡基地赠书，并衷心希望通过此次活动，能够与北大建立全方位、多渠道、宽领域的合作关系，不断深入拓宽彼此之间的合作平台，加快发展知识密集型产业，推进产业结构调整升级，促进高等学校与地方区域经济的共赢发展。      王平教授代表无锡基地对无锡市委书记杨卫泽赠书表示感谢，并表示将进一步加强北京大学与无锡市的紧密合作，逐步将无锡基地建设成为产学研结合的高新技术人才培养基地，促进无锡高新技术产业的发展，为无锡市建成创新型城市作贡献。      赠书仪式后，朱渭平书记在无锡基地现场办公，王平教授介绍了基地目前运行情况及一些尚待理顺和急需解决的问题。同时，双方着重讨论了教师公寓设计改造等问题。
         
        2003 年 11 月 17 日上午 9 ： 00 ，北京大学软件学院与公安部公共信息网络完全监察局合作培养的首届信息安全方向软件工程硕士研究生开学典礼在软件学院大兴校区教学楼举行，公安部和软件学院有关领导出席了典礼。 　　随着信息网络的发展，互联网已成为国家、社会的重要信息通信手段、新的社会传媒和重要的基础设施，信息网络安全已成为影响国家安全、社会稳定和经济建设的重要因素。为加强信息安全技术力量，加快信息安全人才的培养，提高公安机关打击网络违法犯罪的能力，北京大学软件学院与公安部公共信息网络安全监察局经过友好协商，就在公安机关公共信息网络安全监察系统范围联合定向在职培养软件工程硕士研究生（信息安全方向）达成协议，经过初试、复试，软件学院本次共招收了 93 名信息安全方向软件工程硕士研究生。
        
     9月27日上午，177名工程硕士研究生在北京大学软件与微电子学院无锡产学研合作教育基地隆重举行了2008年秋季开学典礼。出席开学典礼的有北京大学校长许智宏院士、北京大学软件与微电子学院理事长杨芙清院士、王阳元院士、中电集团58所名誉所长许居衍院士、原国家外专局局长、欧亚科学院院士、中国国际人才交流协会副主席马俊如、江南大学副校长王武；江苏省委常委、无锡市委书记杨卫泽，无锡市政协主席贡培兴，无锡市委常委宣传部长王立人、组织部长陈振一、滨湖区委书记朱渭平、无锡市市长助理倪斌及无锡市相关部门领导也出席了开学典礼。
      江苏省委常委、无锡市委书记杨卫泽在开学典礼上热烈欢迎无锡基地08级新生入学，他向在场师生简要介绍了无锡经济社会发展情况。杨卫泽说，无锡是民族工商业和乡镇企业的发祥地，人杰地灵，人才辈出，是读书的好地方，无锡良好的产业基础将为北大学子搭建产学研平台。有什么样的人才就有什么样的产业，有什么样的人才就有什么样的城市，北大软微学院无锡基地将对无锡城市未来转型发展产生支撑和引领作用，他祝愿北大软微学院无锡基地师生在锡学习进步、工作愉快。
       9月22日上午，北京大学2014级电子与信息领域工程博士研究生开学典礼暨第三届工程博士研究生论坛在英杰交流中心月光厅举行。
       开学典礼在雄壮的国歌声中拉开帷幕。软件与微电子学院院长张兴教授首先发表致辞，他代表学院师生向到场来宾表示热烈欢迎，并向新入学的工程博士研究生表示祝贺。张兴院长对工程博士研究生提出了三点希望：要培养战略型眼光，要加强人文素养，要培养团队精神。
       北京大学研究生院常务副院长严纯华院士在致辞中表示，杨芙清院士与王阳元院士响应国家号召率先倡导工程博士教育，2011年北京大学成为全国首批培养工程博士专业学位研究生的试点单位之一。通过结合重大工程项目，进行系统化的学习，工程博士研究生将会为国家做出更大的贡献。
       软件与微电子学院理事长杨芙清院士做了重要讲话，她根据习近平总书记在两院院士大会上提出的“科技是国家强盛之基，创新是民族进步之魂”精神，指出国家创新体系的建设已成为当前的关键任务；要通过产学研用结合，使企业成为创新体系的主体；要建设创新型国家，关键是要有创新人才队伍。杨院士表达了北京大学与企业合作共同探索、实践培养工程技术领军人才之路，为企业成为国家创新体系的主体输送人才和技术的雄心壮志。杨院士介绍了北京大学工程博士研究生培养的思路、目标和做法，并提出要不断完善工程博士研究生培养的模式，使得北京大学与企业更好地结合乃至融合，为国家创新体系建设、为企业成为创新体系的主体，做出应有的贡献。
       随后，在热烈的掌声中，校内导师和企业导师分别走上台为2014级电子与信息领域工程博士研究生佩戴了北京大学校徽和胸花。
       2013级集成电路工程方向工程博士研究生刘建强同学、2014级软件工程方向工程博士研究生耿雄飞同学分别作为老生代表和新生代表发言。
       中央电视台总工程师丁文华院士作为企业导师代表发言，他指出，在机遇与挑战并存的时代，具有坚实的理论基础与丰富工程实践经验的领军人才对企业发展有着重要意义，感谢北京大学承担起培养工程技术领军人才的重担，企业也将承担起自己的责任与义务，配合校方为工程博士研究生的培养及工程项目的推进给予有力的支持。
       北京大学上海微电子研究院院长程玉华教授代表校内导师发言，他希望工程博士研究生在读期间，要注重专业素养和工程创新能力的全面提升，在学校和企业间起到桥梁和纽带的作用。 
        北京大学微电子学研究院首席科学家、软件与微电子学院学术委员会主任王阳元院士做即兴发言，他谈到在互联网时代到来的大背景下，软件与微电子学院将软件专业与微电子专业相结合，配备国内外优秀教师，建立起校企合作的培养模式，这为培养前沿型、交叉型的人才提供了条件。他希望通过学习，工程博士研究生能够具备战略思维、全球眼光，能够提高分析问题、解决问题的能力，能够具有团队精神，并寄语工程博士研究生坚守理想、锲而不舍、奋斗终生。
       最后，全体参会人员集体合唱《歌唱祖国》，在雄壮的歌声中北京大学2014级电子与信息领域工程博士研究生开学典礼圆满结束。开学典礼后随即举行了第三届工程博士研究生论坛，分别以“大数据时代创新领军人才的培养”、“芯时代，新方向，星人才”为题举行了两场别开生面的研讨活动，论坛成功落幕。
   北京大学校长许智宏院士在开学典礼上，感谢无锡市委、市政府对北京大学的厚爱和对教育的重视，并勉励刚入学的新生，要在北京大学“勤奋、严谨、求实、创新”的校风鞭策下，在“民主科学”、“兼容并蓄”的传统熏陶下，抱着严谨务实的学习态度、孜孜不倦的钻研精神，充实饱满地度过未来的学习生活。
      开学典礼由陈钟院长主持。无锡基地主任张兴介绍了基地发展情况。兄弟院校江南大学副校长王武宣读了贺词。教师代表李伟平、校友代表赵贵胜、学生代表刘功平发言。最后领导们为16位新生代表佩带校徽，并在在雄壮悠扬的《燕园情》歌声中结束。
    9月27日上午10:30，由软件与微电子学院主办、软件与微电子学院无锡基地承办的“2008无锡国际数字艺术论坛”在无锡太湖新城科教产业园隆重开幕。北京大学校长许智宏院士致辞讲话，软件与微电子学院理事长杨芙清院士、软件与微电子学院学术委员会主任王阳元院士、无锡市委书记杨卫泽等无锡市主要领导、海内外专家学者以及北大软微学院学生、江南大学学生、数字动漫企业界代表共300多人参加。原国家外专局局长、欧亚科学院院士、中国国际人才交流协会副主席马俊如做了题为：“创新全球化发展―挑战与机遇”的主旨演讲。
    开幕式上，北京大学软件与微电子学院分别与瑞典斯德哥尔摩大学、中国流行色协会签署了合作协议。无锡市政府市长助理倪斌与中国软件行业协会游戏软件分会会长刘金华共同为“中国动漫游戏人才培训基地”揭牌。杨芙清院士、无锡市政协贡培兴主席、无锡市委常委、组织部长陈振一等分别为北京大学、江南大学，以及无锡中小学生代表赠送《演绎三国》动漫丛书。 
    本次论坛以为期两天，对现代动画、游戏、新媒体、交互、计算机图形、数字音效等制作理念的推广为核心，以数字技术的更新和人才培养的经验交流为途径，实现艺术理论与技术操作的完美结合，传递国际国内最先进的艺术与技术相融合的创作理念与模式，推动数字艺术产业的发展。论坛邀请了来自美国、法国、澳大利亚、瑞典和中国大陆以及台湾的一批数字艺术专家，从文化创意、数字游戏互动、虚拟现实、数字音乐、现代动画、动漫资源库建设及人才培养等多个方面为师生们带来了国际国内最先进的理念，拓宽业界人士的眼界。论坛对加快中国数字艺术产业发展的步伐，提高数字产品的艺术层次，对数字艺术在中国的发展将起到积极意义。
    为配合此次论坛，学院还特别举办了 “2008无锡国际数字艺术展”。展览分为“民族动画与中国元素”、“数字原始艺术与数字特效”、“数字技术与数字影视”和“人才培养与产业孵化”四个部分，集中展出了近期数字艺术作品近200幅，包括静帧原作作品、装置动画及视频作品，其中包括北京大学软件与微电子学院数字艺术系建系六年来部分教师与学生的优秀作品与获奖作品。
         7月19日上午北京大学软件学  院召开了"北京大学软件学院2002-2003年度总结暨优秀党员表彰大会"。北京大学党委副书记岳素兰教授、北京大学纪检委书记王丽梅教授和北京大学党委组织部、宣传部和统战部的领导参加了本次  会议，岳素兰副书记、王丽梅纪检委书记和赵为民部长还分别在会上讲话。会议由软件学院党委书记白志强主持，软件学院院长陈钟在会上对学院一年的工作进行了认真地总结。总结中肯定了学院创  立一年来在校领导和相关职能部门的大力支持下，在学院领导班子和全体教职员工的共同努力下，在全体学生的积极参与和努力配合下，艰苦创业，锐意进取所取得的优异成绩，同时也指出了工作中  的不足，明确了学院下一步的工作方向。白志强书记代表学院党委宣读了表彰优秀党员的决定，并宣读了获奖名单。校领导和学院领导亲自为获奖师生颁奖，使获奖同志备受鼓舞。颁奖仪式结束后，  教职工优秀党员代表杨雅辉博士和学生优秀党员代表孔令博分别发言，表示一定不辜负校领导和学院的期望，好好学习，努力工作。会上，学生党员孙圣力同学代表全体学生党员借此机会向即将走向  实习岗位的同学郑重地发起了倡议，倡议大家用自己的实际行动作北大精神的诠释着，做软件学院的形象代言人。在听取了学院领导、教师和学生的发言后，岳素兰副书记、王丽梅纪检委书记和赵为  民部长分别讲话。祝贺获奖同志所取得的荣誉，祝贺软件学院在过去一年中取得的优异成绩。岳素兰副书记说："软件学院的创立不仅仅是北京大学办学规模的一个拓展，其意义在于：一、它的这种  办学机制的创新，推动了教育界办学观念和制度的创新；二、软件学院培养和管理学生的模式是现代高等学校培养和管理学生模式的一个推进以及培养复合型人才的一个有益尝试；三、软件学院的创  立不仅仅是办学功能的拓展，也是办学视野的拓展。"岳素兰副书记在对学院领导和全体师生一年来的学习和工作给以充分肯定之后，对软件学院的学生提出了殷切的希望，希望同学们珍惜今天得来  不易的学习机会和学习环境，希望同学们在接受社会检验时能拿出真本事，对社会进行回报，希望同学们将来能以出色的表现无愧于北京大学毕业生的称号。纪检委书记王丽梅教授在讲话中强调，软  件学院是以新的理念、新的机制、新的模式在办学，积累了很多好的经验，希望我们能创造出更多更好的经验。赵为民部长在发言中高度赞扬了软件学院"学苑式"素质教育和学生管理模式，并表示要  向学校建议打破学生按学科、系别住宿的传统方式，以文理生混住的方式来达到相互影响、相互学习、文理兼修的目的。会议在激昂的国歌中开始，在热烈、轻松的气氛中进行，在雄壮的国际歌声中  结束。这次会议的圆满成功将激励我们勤奋学习，努力工作，不断探索，勇于创新。
        北京大学软件学院是由教育部、国家  计委以教高[2001]6号文正式批准的示范性软件学院，隶属于北京大学。根据北京大学校发[2002]30号关于成立北京大学软件学院的决定，北京大学软件学院经研究拟招聘部分教学和教学辅助人员。  　　一、招聘原则：　　1．软件学院将根据课程设置安排岗位，实施全员聘用制。　　2．面向国内外，公开招聘，竞争上岗。　　3．具有求实创新和创业精神，  忠诚党的教育事业，身体健康。　　二、主要岗位设置及要求　　1． 教授、副教授岗位：　　　a) 岗位：教授、副教授。分为专职和兼职两种。　　　b)   要求：熟悉所设专业业务、了解该方向发展趋势、参加过中大型软件项目，具有系统讲解能力和教学经验、能适应双语教学，具有副高职称以上职称，普通话。　　　c) 主要课程分类：  　　　　软件工程方向、网络与通讯软件方向、嵌入式软件方向、电子商务方向、管理与技术方向、典型应用系统。　　　d) 提交材料：除填写应聘申请表之外，应该提交一份准备教授的课程  教学大纲。　　2． 嵌入式系统系专职教员两名　　岗位一要求：具有通信、信息工程、电子工程或相关专业博士毕业，年龄35岁以下，有嵌入式系统及相关领域工作经验者优  先。　　岗位二要求：具有通信、信息工程、电子工程或相关专业硕士以上学历；年龄35岁以下，具有嵌入式软件及相关领域三年以上软件开发经验。　　3． 教学辅导岗位：  　　辅导教师岗位及要求：　　计算机专业或相关专业硕士以上学历，具有教学经验、软件项目开发经验和英语交流能力。普通话。　　三、报名时间：7月21日-8月8日  　　详情可电话垂询：　　010－61273662 许老师　　有意者，可将个人资料发至：　　电子邮件：　　通讯地址：北京市大兴工业开发区金苑路24号北京大学软件  学院　　邮编：102600
         
         7月19日上  午，北京大学党委副书记岳素兰和北京大学纪检委书记王丽梅以及党委组织部、宣传部和统战部有关领导在中科院院士、软件学院理事长、名誉院长杨芙清教授和学院其他领导的陪同下，对软件学院  大兴校区视察指导工作。　　岳素兰副书记和王丽梅书记等先后参观了软件学院的教学楼、教学实验楼、医务室、教师公寓、学生公寓、图书馆等，岳素兰书记对于学院的教学、科研环境  给予了充分肯定。　　在听取了软件学院党委书记白志强教授关于软件学院整体情况的汇报后，岳素兰副书记详细询问了学院办学过程中遇到的难题和生源情况，赞扬了软件学院克服困难  所取得的成绩，明确表示学校今后将继续全力支持软件学院的发展，并对软件学院的具体问题做了重要指示。　　随后，岳素兰副书记、王丽梅书记等领导参加了软件学院2002-2003年度  总结暨优秀党员表彰大会。会上，岳素兰副书记、王丽梅书记和党委宣传部部长赵为民分别讲话，祝贺获奖同志所取得的荣誉，祝贺软件学院在过去一年中取得的优异成绩。岳素兰副书记说："软件  学院的创立不仅仅是北京大学办学规模的一个拓展，其意义在于：一、它的这种办学机制的创新，推动了教育界办学观念和制度的创新；二、软件学院培养和管理学生的模式是现代高等学校培养和管  理学生模式的一个推进以及培养复合型人才的一个有益尝试；三、软件学院的创立不仅仅是办学功能的拓展，也是办学视野的拓展。"岳素兰书记在对学院领导和全体师生一年来的学习和工作给以充  分肯定之后，对软件学院的学生提出了殷切的希望，希望同学们珍惜今天得来不易的学习机会和学习环境，希望同学们在接受社会检验时能拿出真本事，对社会进行回报，希望同学们将来能无愧于为  北京大学毕业生的称号。纪检委书记王丽梅在讲话中强调，软件学院是以新的理念、新的机制、新的模式在办学，积累了很多好的经验，希望我们能创造出更多更好的经验。赵为民部长在发言中高度  赞扬了软件学院"学苑式"素质教育和学生管理模式，并表示要向学校建议打破学生按学科、系别住宿的传统方式，以文理生混住的方式来达到相互影响、相互学习、文理兼修的目的。　　  岳素兰副书记一行的到来使软件学院师生深受鼓舞，全体师生员工一致表示要努力工作、学习，不断探索、创新，为创建一流软件学院而努力奋斗。
       2008年9月24日上午9:00，北京大学软件与微电子学院2008年秋季开学典礼在大兴校区教学楼3303举行。陈钟院长、徐雅文常务副院长、苏渭珍副院长、白志强书记、吴中海副院长及教职员工和全体新同学参加了开学典礼。     会议由党委书记白志强教授主持，陈钟院长在开学典礼上作了重要讲话，他对学院的历史做了简短回顾，并对学院的现状做了介绍，他对学生提出了几点希望：继承和发扬北京大学爱国进步，民主科学的传统；牢记创新是一个民族进步的灵魂，是国家兴旺发达的动力；牢记杨芙清院士“开拓、求实、创业，严谨、进取、育人”的教导，发扬吃苦耐劳的精神，敢于突破传统，不断创新，为实现全球信息产业的发展、为中国软件产业的腾飞而奋斗。
     10月17日下午，北京大学2008级与公安部合作培养硕士研究生新生开学典礼在北京大学软件与微电子学院无锡产学研合作教育基地隆重举行。出席开学典礼的有公安部23局培训处处长张宪华、副处长于丽娅、软微学院党委书记白志强教授、网络与通信系主任高培椿教授。开学典礼由无锡基地副主任王平教授主持。
    从2003年起，北京大学已经与公安部连续合作培养了6届硕士研究生。软微学院的发展得到了公安部及其相关部门的大力支持，此次无锡基地迎来了来自全国各地公安系统的近100名新同学开始他们的硕士研究生学习。
   白志强书记在开学典礼上讲话，他对学院的历史做了简短回顾，对学院的现状做了介绍，并勉励公安部新同学要发扬革命军人“特别能吃苦、特别能战斗”的精神，攻克在职学习和研究中遇到的各种困难，夯实基础，积极实践，系统地学习和掌握相关的知识，使自己真正成为高层次、实用型、复合型、国际化的优秀人才。
   典礼上，公安部23局培训处张宪华处长做了讲话，她鼓励同学们珍惜机会，好好学习的同时，强调同学们既是学校的学生，更是干警的特殊身份，在学习、和校园生活的各个方面起到模范带头作用。学生代表陈伟也代表全体学生做了相应发言。
 
        
        11月14日是全国研究生现场报名工作开始的最后一天，北京大学校内的报名点秩序井然中显现出旺盛人气，在长长的报名队伍中不乏"投奔"北大软件学院的学子。三位来自吉林的和两位中国人民大学的学生都是在当地f听了软件学院的名师报告会后慕名而来的，他们说："北大软件学院的老师水平不俗，演讲精彩，我们就是听了学术报告会后，才对这所百年名校里的新学院有了更深的了解，所以第一志愿就填报了北大软件学院！"        居安思危，志向高远。尽管北大软件学院的学校建设已经初具规模，步入快速成长期，在校生达到900人。但是为了更大范围的提高学校知名度和美誉度，加强与兄弟院校的合作与交流，向一流软件学院迈进，同时也为进一步拓宽生源市场，招收优秀毕业生，他们采取了多种措施开展对外合作。学院组成"名师学术演讲团"，拟定多个演讲题目，由国际国内合作办公室对外联络，先后到吉林、上海以及北京地区的中国人民大学、中央美术学院等校进行学术演讲，并现场开展招生咨询宣传。四场演讲会火爆异常，听众超过了两千五百人，当地媒体也对此做了大量报道。所到院校对北大软件学院的学术巡讲给予了充分肯定和赞许，并希望今后在人才培养、学术交流、项目研发、设备共享等方面的互相合作，优势互补。        11月6日在中央美术学院做的学术演讲，由北大软件学院数字艺术设计系主任、好莱坞知名电影人、《加菲猫》导演Becky Bristow主讲，题目为：奥斯卡获奖影片选评及动画在中国和世界的发展。尽管当天大雪弥漫，寒气袭人，但会场内气氛和情绪十分高涨，三百人的教室竟挤进去500多人，台上台下互动热烈，高潮迭起。Becky女士认为中国的动画产业发展迅速，已经在世界上占有一席之地，而且后继大有人在。在场的师生对北大软件学院成立数字艺术设计系也表示出浓厚的兴趣，认为北大依托丰厚文化底蕴和计算机技术的优势，再聘请国际名师执教，一定会培养出比肩世界的"动画人才"。        以新理念和新机制创新化办学的北大软件学院，面向领域和市场的需求，努力培养高层次、实用型、复合型、国际化人才。他们克服了重重困难，想方设法谋发展，在短短一年的时间里就取得了令人瞩目的成绩。前不久顺利通过了教育部组织的软件学院中期评估，并被誉为是"示范性软件学院中的示范"，受到软件界同仁高度评价。在硬件方面，软件学院大兴校区建筑面积已达3.5万平方米，可容纳2000名学生在校学习，建有8个联合实验室、5个多媒体教室、5个阶梯教室；在网络资源方面，采用了覆盖教室、实验室、办公室、宿舍、会所的10/100M交换校园网，做到了学生宿舍每人一个信息点；无线网络覆盖了教室/办公区。北大软件学院还获得了国内外企业价值1200万元的软硬件捐赠。        在教学管理方面，北大软件学院积极探索与国际多所著名大学、知名企业的合作，聘请他们的专家教授来学院授课任职、引进著名院校的课程体系和前沿教材、实现学术环境、学术交流的国际化。目前，已与美国仁斯利尔理工大学、早稻田大学签订了合作协议，与卡内基梅隆大学、华盛顿大学、麻省理工学院、弗罗里达大学等深入交流和商谈了合作办学事宜，另外已经和国内外三十余家知名企业建立了合作伙伴关系。
         10月12日上午9时，北京大学软件学院在大兴校区隆重举行了2003年秋开学典礼。国家外国专家局副局长张建国，主任万金发，北京大学副校长林建华，研究生院常务副院长张国有，中科院院士、软件学院理事长、名誉院长杨芙清，以及软件学院的领导、顾问和500多名师生参加了开学典礼。 　　在开学典礼上，有关方面还向Becky Bristow女士、Motolora中国软件中心总经理邹贵华先生、前IBM总部大学合作部高级顾问Frank Tong博士颁发了外国专家证书或聘书。Becky Bristow女士现任软件学院数字艺术设计系系主任，邹贵华先生现任软件学院嵌入式系统系顾问，Frank Tong博士现任电子服务系系主任。 　　软件学院院长陈钟、北京大学副校长林建华、研究生院常务副院长张国有、软件学院理事长杨芙清等先后在会上讲话。
        九月二十九号上午，北京大学软件与微电子学院全体党员在我院保持先进性工作领导小组的带领下，参观了位于北京西南卢沟桥东侧的中国人民抗日战争纪念馆 。（右图为用声光电等现代科技手段生动再现的当年的抗战场面）　　　　　　　　　　　　　　　　在参观《民族危急　救亡兴起》、《国共合作　共赴国难》、《抗战灯塔　中流砥柱》、《日军暴行　惨绝人寰》、《浴血疆场　民族壮歌》、《得道多助　国际援助》、《历史胜利　巨大贡献》和《以史为鉴　面向未来》共8个主题展览中，党员同志，无论师生，均是怀着无比沉痛的心情，神情肃穆的仔细观看各种文物、照片和图表。大家感慨颇多，一面参观，一面交换心得体会。也有部分同志，面对着日军惨绝人寰的迫害同胞的画面不禁潸然泪下。我院保持先进性领导小组负责人参观完展览后，向各个党支部发出了认真反思，写好感言的号召。各支部党员纷纷响应，态度积极。　　这是党的先进性教育活动在我院开展以来又一次重要内容。在抗战和世界反法西斯战争胜利60周年之际，举办这次活动有其深远的历史意义和现实意义。期盼所有的党员牢记胡锦涛总书记的话，牢记历史，不忘过去。以史为鉴，开创未来。企盼所有的中国人，在走过一段长远、崎岖的道路后，共同努力开创民族的光辉未来。
 
         2005年7月6日下午，深圳市政协主席李德成、市委副书记李意珍一行来北京大学软件与微电子学院考察。杨芙清院士向来宾作了“北京大学软件与微电子——示范性软件学院建设”的报告，数字艺术系王强副主任作了“数字艺术系建设情况”的汇报。在参观了学院的教学实验环境、数字艺术系工作室后，就合作建设数字艺术产学研动漫基地进行了讨论。
　　那么，中国教育在努力做什么呢？ 　　培养创新人才 　　“在培养创新人才中，首先要解决学生的学习动力问题。”清华大学的陈皓明教授是获得特等奖的“工程硕士专业学位教育机制的创新与实践”项目的参与者之一，他告诉记者，现在的学生追求学位的多，追求学问的少，这是创新的一大障碍，但是，只是从管理或思想教育的角度让学生去钻研学问效果是有限的，毕竟拔尖创新人才不是管理出来的，因此，必须在教学上建立一种机制激励起学生钻研学问的精神，而他所参与的项目正是在这方面探索出了一条新路。 　　个性化的教学则是目前教育界在培养创新人才方面采取的另一个手段，特等奖“开拓创新，建设一流的物理演示与探索实验室”的主要完成人北京交通大学的王玉凤教授告诉记者，“我们所创造的全新的教学模式其中一个关键的理念就是培养个性化，让每个学生能按着自己的兴趣和水平来学习的机会，这保证了拔尖创新学生的脱颖而出。” 　　注重人才质量 　　近年来，我国高等教育实现了从精英教育到大众化教育的历史性转化，由此引起了人们对质量问题的关注。 　　北京师范大学的“创建教师教育模式，构建中国特色教师教育体系”获得了这次的一等奖，这个项目的核心就是如何培养高质量的教师人才，使我国的教师群体由过去的单一技能型向复合型、专家型转化。 　　关于人才质量，因“北京大学软件与微电子学院——示范性软件学院建设”而获一等奖的杨芙清院士一语破的：“就像创新性一样，学生只有从被动转化为主动，才谈得上真正的提高质量。”但这样一个过程也需要学校在制度上和模式上精心设计，据她介绍，他们学院有的学生学习成绩很好，但就业时面试几次都失败，这些学生就回到学院重新学习，“他们主动给自己的质量把关，而学校也提供他们再回头学习，这样在制度上就保证了质量。” 　　重视综合素质 　　学生的综合素质是困扰着教育界的一个长久问题。让我们欣喜的是，这次国家教学成果奖中有多个获奖项目涉及这一领域，获特等奖的大学生电子设计竞赛以调动、培养学生实践动手能力、独立思考能力及团结协作、克服困难等人文精神为突破，目标直指学生的综合素质。北京大学历史系教授牛大勇参与的一等奖项目“构建以素质教育为取向的跨学科通选课体系”也是其中之一，他们针对北大本科生开设的通识教育选修课在学生综合素质的提高上成效显著。
         2005年9月9日，中共中央政治局常委、国务院总理温家宝在人民大会堂会见出席第五届高等教育国家级教学成果奖颁奖大会代表和北京市优秀教师师德报告会主讲教师代表，代表党中央、国务院向全国的老师们表示热烈的祝贺和亲切的慰问。　 “北京大学软件与微电子学院——示范性软件学院建设”在荣获“北京大学2004年教学成果一等奖”、“2004年北京高等教育教学成果一等奖”之后，又荣获 “2005年国家教学成果一等奖”，杨芙清院士作为“北京大学软件与微电子学院——示范性软件学院建设”项目成果第一获奖人，受到温家宝总理的亲切接见。
 
         北京大学软件与微电子学院是按新模式建立、新机制运行的北京大学直属学院，实行理事会领导下的院长负责制，探索多途径合作办学的管理体制与运行机制，积极开展与国际著名高校、国内外知名企业的合作，拉动社会资金投入，实现运作企业化、办学专业化和后勤社会化。学院秉承北京大学“民主科学、兼容并蓄”的传统，遵从“勤奋、严谨、求实、创新”的学风，以坚持创新创业、坚持面向需求、坚持质量第一为建院宗旨。并实行“专业教育学分制、素质教育学苑式、产学研一体化”的办学模式。学院以北京大学为依托，师资力量雄厚，其中40％为国内外专职教师，40％为国内外资深兼职教师，校内兼职教师占20％。（学院主页：http://www.ss.pku.edu.cn）        管理与技术系（MOT）是北京大学软件与微电子学院与美国任斯利尔理工大学（RPI）合作建设的系科，主要培养高层次的研究开发管理和软件企业经营管理人才，现因教学需要，面向国内外招聘5-7名专职教师。         一、 人力资源/组织行为方向 专职教师1-2名岗位职责：承担《IT人力资源管理》、《高性能企业组织》等硕士生课程的教学任务。应聘条件：1、 在人力资源管理或组织行为方面独立开展研究工作，近三年内有明显成果。2、 具备很强的实践能力、丰富的企业咨询经验。3、 能进行双语（英语）教学。专业方向：企业管理、人力资源、心理学，且有相关的工作背景和成果。学历要求：博士（博士后优先考虑）、心理学方向的优秀硕士。
     
     11月11号上午，日本理光株式会社伊藤宪文先生一行在无锡软通动力卢九平总裁的陪同下访问了北京大学软件与微电子学院无锡基地。吴中海副院长等参加了会见，就产学合作和嵌入式软件人才培养达成合作意向，包括建立联合实验室、设立奖教奖学金、合作开设专业实践课程、举办专题讲座、开展大学生创新项目等。与会人员还就产学合作培养嵌入式人才进行了探讨。
 
        2003年7月19日上午，在学院理事长杨芙清院士的陪同下，北京大学党委副书记岳素兰、纪委书记王丽梅到我院视察指导工作，并参加了软件学院2002―2003年度总结暨优秀党员表彰会。 
　　6月7日，第二届“IBM杯”高校校园创新设计大赛在北京大学英杰交流中心阳光大厅拉开帷幕。北京大学校长助理、副教务长李晓明教授、北京大学信息与工程科学学部主任、中国科学院院士杨芙清教授、北京大学信息科学技术学院院长、中国工程院院士何新贵教授、北京大学软件与微电子学院陈钟院长、IBM院士、IBM中国开发中心总经理郑妙勤女士、Novell公司亚太区副总裁亚洲区总经理张先民先生参加了本次仪式并分别发表了讲话。此次开幕式还邀请到北京大学信息科学技术学院梅宏副院长作为嘉宾主持。
　　IBM始终致力于推动开放技术，并坚信高素质人才是推动开放和创新的源泉。延续着开放和创新的主题，第二届“IBM杯”高校创新设计大赛隆重开幕。此次大赛是为了进一步推动开放标准和创新技术在中国的发展，促进高校学生对开放标准和创新技术的了解，丰富校园科技活动，使对开放技术感兴趣的学生有机会亲身体验开放标准下的系统设计与应用开发，同时带给他们IBM基于开放标准应用解决方案的随需应变的创新理念。大赛是由IBM中国有限公司大学合作部、应用开发商合作部、战略成长部、软件部和IBM中国研究中心共同倡议，由北京大学主办，复旦大学、华南理工大学、华中科技大学、四川大学、西安交通大学和台湾大学协办、以中国大陆地区和港、澳、台地区41所著名高校为基点辐射到100多所高校计算机相关专业学生。报名时间从6月7日开始到7月10日（在http://ibmur.hust.edu.cn/innovation_contest/网站上在线报名即可），赛事将在11月结束，届时将由主办单位IBM公司和8所高校所组成的评委会从入围作品中选出优胜者，在闭幕式上举行颁奖仪式，并邀请特别创新奖和一等奖获得者参加2006年IBM夏令营。　　此次大赛组委会阵容强大：杨芙清院士应邀成为大赛的名誉主席，IBM首位华人女院士郑妙勤女士应邀作为大赛的名誉顾问，何新贵院士担当竞赛组委会主席，8所协办高校计算机学院或软件学院的院领导也参与了组织委员会的管理工作，IBM公司、Novell公司和中国高校都全力支持这次大赛，并希望从中能发现和培养一批在开放系统开发应用方面有创意、有潜力的优秀人才。
　　北京大学校长助理、副教务长李晓明教授代表北京大学对此次IBM高校创新技术大赛的开幕表示祝贺，并鼓励同学们能积极参与此次竞赛。作为10年来IBM公司与北京大学合作项目的支持者与见证人之一，李晓明教授充分肯定了10年来双方在课程体系建设、人才培养和联合研究等方面所取得的成果。他强调：“北大已经将与IBM公司的合作列入北大的基本校策之一。　　北京大学信息与工程科学学部主任、中国科学院杨芙清院士凭借多年来对信息产业的深刻理解，精辟地阐释了标准、开放、创新的关系以及此次IBM校园大赛的深刻意义。在指出，“标准是产业发展的基础，标准蕴含技术，孕育市场，维护知识产权。标准既是技术和产业发展的结果和产物，又进一步推动技术和产业的发展。标准是不断发展的，它的发展性也决定了它的开放性。标准的开放性，给技术发展提供了创新的空间，也给标准的执行和应用提供了良好的环境。创新需要人才，创新造就人才。创新的人才需具备创新意识、创新思维和创新能力，更需要创新的环境和氛围。第二届“IBM杯”高校校园创新设计大赛就是在营造一种创新的环境和氛围。”杨芙清院士希望同学们都能珍惜此次大赛的机会，勇于创新，通过参与大赛提高创新能力，拿出好的作品。　　IBM院士、IBM中国开发中心总经理郑妙勤女士代表IBM公司对北京大学、各协办高校和Novell公司给予此次大赛的高度支持表示了衷心的感谢，她在发言中提到，“IBM非常重视和高等院校间的合作，IBM通过多种形式的大学合作项目，与高校在信息科学技术领域的学科建设和人才培养方面进行探索和交流。此次IBM校园竞赛以开放和创新为主题，主要是基于开放，开放标准和开放源代码正在成为软件未来发展的大趋势，作为业界的领军企业，IBM始终在尽最大努力支持开放；基于创新，作为全球产生专利数量最多的企业，坚持创新和鼓励创新一直是IBM坚持不懈的追求。IBM希望通过此次竞赛，为学生们提供更多学习开放技术和参与创新的环境与平台，与高校一起为社会培养出更多的有创新精神的优秀人才。”
　　Novell公司亚太区副总裁亚洲区总经理张先民先生指出，“Novell作为此次大赛的协办单位,将和IBM一起，支持各种开放技术和开放标准的应用与推广。开源技术代表了一种自由精神，在本次大赛中，这种精神将得到再次体现。”
　　目前，参赛者可以通过访问大赛主网站http://ibmur.hust.edu.cn/innovation_contest/免费下载技术资料和开发工具。同时，为了方便参赛学生随时获取技术资源，IBM公司协同Novell公司为竞赛提供了专用开发工具包，并开放公司相关技术网站。另外，为使在校学生进一步掌握配套软件技术，IBM公司充分调动内部资源，将与Novell公司一起，分别在不同地区高校有针对性地开展系列技术专题讲座和讨论,并在大赛主网站上邀请技术专家进行在线辅导。各主办、协办高校也特地派出1位技术指导教师进行相关技术的培训，辅导参赛学生的作品制作进程。8所高校将分别组织配合开放系统的系列研讨活动，把开放系统和配套软件技术知识真正深入传播到学生日常学习中。
 
 
         7月18日上午10时，北京大学与日本ACOM株式会社“北京大学-ACOM信息化研究中心”（以下称“中心”）的合作协议签字仪式在北京大学临湖轩举行，北京大学林建华常务副校长与ACOM株式会社木下盛好社长代表双方分别在协议书上签字。北京大学杨芙清院士，北京大学与ACOM双方的相关领导、专家参加了签字仪式。　　北京大学学科门类齐全、科研力量雄厚、有着丰富的科研成果和完善的人才培养体系，北京大学希望通过与ACOM株式会社的合作把中心建设成中国著名的金融信息化研究机构，并培养金融信息工程人才。ACOM株式会社为日本消费信贷行业一流的公司之一，其消费信贷服务及技术在日本国内占有相当的市场份额，ACOM在此次合作中向北京大学每年捐赠150万人民币用于设立奖教奖学金以及金融信息工程的学科建设，并为中心提供每年500万元人民币的运营和研究经费。中心的研究范围包括金融信息化技术研究和软件开发、中国消费信贷市场的研究、个人信用数据库及数据分析、中国信贷政策与制度研究、金融信息化咨询和社会活动、金融信息化国际研讨活动等内容。　　据悉，这是日本金融机构首次与中国著名高校合作设立的金融信息化研究中心。北京大学委托其所属的软件与微电子学院负责中心的运营和管理，这对于综合性大学服务于社会、服务于金融行业有着重要的意义。　　在签字仪式之前，双方领导作了亲切、友好的交谈，充分肯定了北京大学与ACOM株式会社合作设立该研究中心的意义。并表示将全力支持把研究中心办成一流的金融信息化研究机构。
    7月26日，江苏省政协副主席、原北京大学党委书记、江苏省委副书记任彦申在学院党委书记白志强和无锡基地副主任王平地陪同下视察了北京大学软件与微电子学院无锡产学研基地。在听取了软微学院和无锡基地情况的扼要汇报后，对于学院的发展给予了充分的肯定，鼓励学院办好无锡基地为江苏的建设作出贡献。在视察中，任彦申出席了江苏省大学生菁英人才学校培训班开学仪式，仪式后为在基地学习的培训生，暑期学校学生等作了一场题为《与青年学生谈成才》的精彩讲演。受到了学生的热烈反响。
     此次菁英人才学校培训由江苏省团省委主办，无锡太湖科教产业园及北京大学软件与微电子学院无锡产学研合作教育基地共同承办。开班仪式后，培训班的同学们和在学校的其他同学们一道听取了任彦申教授的《与青年学生谈成才》的精彩讲演。晚上，北京大学社科研究部部长，北京大学中文系程郁缀教授《古代诗歌赏析与人文素质提高》的人文讲座。两场讲座受到学生们的热烈欢迎。参加此次江苏省大学生菁英人才学校培训学生主要是江苏省各高校学生会主席和学生干部。2008年国家示范性软件学院暑期学校学生、北京大学双优实训生共300多人聆听了讲座，反响强烈。 
        8月6日，2008年国家示范性软件学院暑期学校结业典礼在北京大学软件与微电子学院无锡产学研合作教育基地隆重举行。北京大学软件与微电子学院院长陈钟教授、党委书记白志强教授、副院长吴中海教授、部分教师代表和来自全国国家示范性软件学院的学生见证了这一重要的时刻。
     结业典礼由吴中海副院长主持，白志强书记代表学院致辞。他表示，此次暑期学校开设的课程和丰富多彩各类活动，让同学们度过了一个有意义，有收获，积极进取的假期生活；他说，对于每一位同学这只是一个新的起点，希望同学们在未来的发展中，持之以恒，取得成功，为国家建设、为民族的复兴做出自己的贡献。随后，陈钟院长、白志强书记在轻快的乐曲声中为同学们颁发了结业证书。
    据介绍，此次暑期学校为期20余天，共开设2门专业基础课、2门专业实践课和名师讲堂，邀请了相关领域的知名专家和学者授课，如王立福教授的《软件方法》、屈婉玲教授的《算法分析》、北京大学人文社科等领域的知名学者做报告等等。此外，还进行了拓展训练、参观了天下第一村华西村，科教产业园区的知名企业、游览无锡科技园等一系列内容丰富，精彩纷呈的活动。来自浙江大学、哈尔滨工业大学、武汉大学等知名学府的学生纷纷表示，通过此次暑期学校的学习与生活，他们无论从理论基础知识、专业水平还是人文素养方面都有了极大的提高。特别是对于无锡市快速发展和宏伟的规划留下了深刻的印象，感受到了江南水乡的传统文化，同时也更深入地认识和了解了北京大学，这些经历将令他们终身难忘。
      “挑战数码时代”是由苏格兰阿伯泰邓迪大学举办的一年一度的数码产品开发竞赛，主要面向艺术设计类的大学生。竞赛通过选拔，筛选出的5名学生组成一个参赛小组分别负责技术和创意等不同方面，共同将自己的数码产品从概念和创意变成现实，小组成员前往苏格兰，与其他国家的小组进行角逐，并产生最终的大奖。
      近日，来自中国北京大学的4名优秀学生与1名苏格兰学生组成的北京大学代表队经过奋力拼搏，从来自全英的17支参赛队伍（每队5人，含来自中国和印度的代表队各1支）中脱颖而出，赢得“挑战数码时代”（Dare to be Digital）2008年度大奖，获得将于2009年3月举行的“英国视频游戏最有才华学术新人奖”(BAFTA)提名。原BAFTA奖项仅限于电影范畴（相当于美国的奥斯卡奖），后扩大到电视，现已进入视觉艺术领域，在英国、欧洲享有较高的声誉。北京大学代表队的同学们在比赛中展示了出众的才华和训练有素、高昂进取的精神风貌，为祖国争得了荣誉，特此祝贺！
      “2005-IT项目管理论坛——e时代企业规模化发展的项目管理战略”于2005年7月29日在北京大学英杰交流中心圆满闭幕。本次论坛由北京大学软件与微电子学院与IBM中国有限公司共同主办，是一次规模盛大的IT项目管理大会。北京大学林钧敬副校长出席并致开幕词，本次论坛吸引了来自IT领域、项目管理领域以及金融、电信、电子等行业300多位著名专家、教授及企业中、高级管理人员参加，参会人员探讨了e时代企业规模化发展的项目管理战略，针对企业如何培养优秀的项目管理人才、搭建良好的项目管理信息系统、建立一套项目管理的标准方法，从而形成以项目管理为核心的运营管理体系等问题，从人才战略、管理平台及企业应用三个不同角度进行了认真而热烈的讨论。本次大会的成功举办将为推动我国IT项目管理技术的应用产生深远而积极的影响。
         2005年9月4日上午，北京大学软件与微电子学院2005年秋季开学典礼在大兴校区举行。中国科学院院士、北京大学信息工程学部主任、软件与微电子学院理事长、名誉院长杨芙清教授，中国科学院院士、北京大学微电子学研究院首席科学家、软件与微电子学院理事、学术委员会主任王阳元教授，学院理事、院长陈钟教授，学院副院长、党委书记白志强教授等有关教职员工和新同学参加了开学典礼。会议由白志强教授主持，杨芙清院士、王阳元院士和陈钟院长分别在开学典礼上作了重要讲话。教师和新老学生代表也在开学典礼上做了发言。
 
         2004年 11月13日，原微软（中国）总裁、现盛大公司总裁唐骏先生应约来我院作了题为《不断进取--未来企业领袖之路》的演讲。演讲的精彩让现场的掌声一浪高于一浪。在演讲的最后，唐骏先生表示，在以后如果有机会，他希望能够再次来我院进行演讲。         2005年5月25日，唐骏先生所希望的机会终于又来了，而且来得比唐骏先生期望的更多。在这个夜晚，北京大学软件与微电子学院以自身迅速的发展，强大的实力，绝对的真诚，同学的热情，以及那一本客座教授的聘书把唐骏先生留在了北京大学软件与微电子学院。当白志强书记宣布聘任仪式开始，唐骏先生从陈钟院长手中接过聘书的刹那，这位商场上令对手尊敬的帅才，顿时成为了受全院学生欢迎和喜爱的教授。正如唐骏先生自己所言，他能得到这个殊荣是被自己的梦中情人亲了一下。然而对于北京大学软件与微电子学院而言我们又何尝不为自己拥有了这样一位受同学喜爱的优秀的教授而自豪呢！          随后，唐骏教授进行了《把握机会与改变性格》的精彩演讲。可容纳数百人的教室座无虚席，走廊和过道上也密密麻麻的挤满了人。唐骏教授以其幽默的言语，结合自身在职场中的经历，深度阐释了机会的三个层次，随后呈现出机会与性格的关系，最后倡导大家通过改变自己的性格来提高自己对于机会的把握能力。同时希望大家能做一个性格好，让别人很快能喜欢自己的人。         整个演讲过程中唐骏教授以幽默的言词，对于问题深度的见解，大量职场经验的分享和对丰富的案例剖析博得了同学们一阵又一阵热烈的掌声。当唐骏教授离开现场的时候，也许他没有意识到，他的魅力伴随着掌声的余音已经成为了软件与微电子学院今夜的星空中最为闪亮的一颗星星。
 
         2005年12月20日，软件与微电子学院第二次学术委员会在北京大学大兴校区召开。会议由学术委员会主任王阳元院士主持，杨芙清院士、陈钟教授等8名学术委员会成员出席了会议并审议、投票通过了学院10名外国专家、台湾专家的教授、副教授职务认定。
 
         8月5日 北京大学软件学院与摩托罗拉子公司Metrowerks公司在北京大学正式签署合作备忘录，旨在共同培养高层次嵌入式系统软件人才，为中国嵌入式系统专业人士提供不断完善的个人能力发展计划。合作双方还计划在嵌入式系统工程领域内共同开展高端的研究工作。北京大学信息与工程科学学部主任、北京大学软件学院理事长杨芙清院士，Metrowerks公司总裁Jim Welch先生共同出席了签字仪式。      目前，软件产业已成为我国新一轮经济发展的增长点，保持了连续8年25%的增长速度。根据国家统计局和信息产业部2002年的统计数据，我国的软件公司数量已达到4700家,从业人员59万,我国的软件和系统集成的销售额达到1千1百亿元，实现46.5%的增长；软件出口实现100％的增长，达到15亿美元。预计到2005年，中国软件市场规模将达到2千5百亿元，专业软件人员将达到80万。中国强大的软件市场需求和"数字奥运"计划的实施，将给中国的软件产业提供强大的发展动力。      为了满足中国市场对嵌入式系统软件人才的不断需求，北京大学软件学院在国内率先成立了嵌入式系统系。北京大学软件学院与Metrowerks公司的合作，不仅可以为北京大学软件学院嵌入系统系学生提供了在 Metrowerks公司北京及全球其他研发中心的实习机会，还将为所有希望在嵌入式系统工程领域进行深造的专业人士提供个人能力发展计划。合作双方计划联合推出嵌入式系统工程专业资格认证（ESEPC）的首个培训项目--嵌入式Linux软件工程师认证。该项目计划在3年内培养2000名嵌入式Linux软件工程师。      北京大学软件学院理事长杨芙清院士说："北京大学和摩托罗拉有着良好和悠久的合作历史。北京大学软件学院作为国内率先设立嵌入式系统系的软件学院，在建系之初就与摩托罗拉公司开展了合作。""软件学院和摩托罗拉子公司Metrowerks的合作将进一步推动高层次、实用型、复合型、国际化嵌入式系统软件人才的培养。"      Metrowerks公司总裁Jim Welch先生说："我们非常荣幸和享誉全球的北京大学合作，共同培养一流的嵌入式系统软件人才"。"今天合作协议的签署标志着摩托罗拉Metrowerks力争成为正在起动着的中国软件产业的一股动力。我们期望该合作项目能成为培养中国嵌入式系统软件人才的摇篮，为他们提供持续的个人发展机会，并为中国嵌入式软件业营造良好的发展环境。"
　　去年，厦门火炬高新区对软件园已有设施资源进行整合，成立了厦门软件促进中心，为全市软件企业提供专业化服务，包括公共技术支撑和人才服务。　　据悉，此次北京大学软件与微电子学院、厦门软件技术促进中心和厦门邦初培训中心联手实施的软件项目实训和高级研修班项目，主要是针对企事业单位的技术、管理骨干，由业内专家对进修人员进行知识与技术的更新。这两个项目的成功启动，将为我市软件行业源源不断地提供软件中高端人才，打造厦门软件业人才链，从而推动厦门软件业的发展。
      2009年10月11日晚，首届中国独立游戏节（GDC China）颁奖典礼在上海举行。在经历了作品征集，初审、复审及最终评选后，首届中国独立游戏节比赛环节获奖名单终于出炉，14件入围作品中有7件作品摘得不同奖项。在近200名来参加GDC China 2009的中外来宾热切期待中，主持人一一揭晓了各个奖项的最终得主，独立游戏节主席，游戏开发者杂志及Gamasutra.com的主编及出版人Simon Carless先生，虹口区区长华东平先生等为获奖人颁发了奖杯。由软件与微电子学院数字艺术系4名同学组成的团队制作的游戏“碰碰万圣节BUMPER HALLOWEEN” 获IGF优秀学生作品奖。
　　2006年6月6日下午，北京市政协主席阳安江、副主席满运来等政协常委在大兴区沈宝昌书记、林克庆区长、学院院长陈钟教授、副院长吴中海教授等相关领导的陪同下，到北京大学大兴校区参观视察，并举行了文化创意产业发展情况座谈会。　　　　座谈会由大兴区政协主席高树旺主持，吴中海副院长在会上汇报了“产学研结合培养数字艺术创新人才”的情况，大兴区区长林克庆向政协常委汇报了大兴新媒体产业发展情况，阳安江主席在会上作了重要讲话。
 
         软件与微电子学院教职员工2005年述职报告会分别于11月28日、11月30日在大兴校区综合楼一层会议室顺利进行，学院理事、院长陈钟、理事张兴、常务副院长徐雅文、党委书记兼副院长白志强、副院长苏渭珍全部到会并听取了教职员工的述职报告。
         2006年1月7日上午，北京大学软件与微电子学院2006年春季毕业典礼暨学位授予仪式在北京大学秋林报告厅举行，软件与微电子学院理事长杨芙清院士、学院院长陈钟教授、白志强和苏渭珍副院长以及学院导师出席了毕业典礼，188名毕业生被授予软件工程硕士学位。
   在12月11日结束的2009年度IBM全国大型主机技术大赛总决赛上，我院代表北京大学参赛的三只队伍中， “Star warriors”团队凭借“碳排坝-IT能耗统一平台”团队获得了评委的一致好评，获得了最高奖-“最佳作品奖”，另外2支入围总决赛北大团队“Genius-blue”和“Transformer”也分别凭借“G-Center零售集中管理平台”和“下一代个人征信系统”的项目获得了大赛优胜奖。陈钟院长代表学院领取了IBM大学合作部授予的“2009年度教书育人”奖。这三只队伍的指导老师-信息化研究室主任邬国锐获得了“最佳指导奖”以及IBM主机大学合作项目“2009年度突出贡献奖”，这也是他连续四年获得的此项殊荣。 
   11月10日，无锡基地部分师生前往无锡市人民大会堂参加了2008年无锡市改革发展高层论坛，听取了博鳌亚洲论坛秘书长龙永图所作的题为“当前经济形势和改革开放"的专题讲座。      讲座中，龙永图秘书长围绕着“当前经济形势和改革开放"，针对“中国经济如何应对全球性的金融风暴”的问题，从“树立我国经济发展的信心，深刻理解中央关于战略机遇期的基本判断”，“认识和基本把握中国的基本国情，坚定不移的实现和谐发展观”以及“坚持对外开发”三个方面进行了讲解，并建议无锡不仅要大力发展环境友好的制造业，还要大力发展具有完整产业链的制造业，坚定不移地执行对外开放政策，实现中央提出的互利共赢。      不少学生在讲座结束后表示，此次讲座具有现实感和时代感，对自己开阔视野、转变观念、创新思维，增强坚持科学发展、推动跨越发展的自觉性和坚定性，具有重要的作用。
   “北大讲堂――东林讲坛”是由北大无锡基地与无锡市委宣传部联合主办，将汇集多位北大名师的研究精华和学术成果，承载真切体验与深刻感悟，为北大无锡基地的学子和无锡人民提供了一个扩展视野、提高修养良好平台。 
 
        十月九日上午，北京大学软件与微电子学院保持党员先进性工作领导小组组织学院全体党员观看了影片《张思德》。 这是我院开展保持党员先进性活动以来的又一个重要集体组织活动。      《张思德》是一部反映普通的党员如何在其平凡的工作岗位上做出不平凡的成绩的影片。张思德为人憨厚朴实，工作任劳任怨。他从党内一名普通的警卫员，到一名烧炭战士，对自己的每一份工作都全身心的投入。一心一意为着革命的利益和解放全中国的伟大事业而默默地奉献。张思德爱人如已，助人为乐。他用心照顾一个退役的老兵和一个失去家庭的孩子，让他们感受到了温暖；他在窑洞突然塌方时，为救战友小白,光荣牺牲了。毛泽东主席在他的追悼会上深情地说，“我们的队伍里到处是这样的人，普通、平常、像清凉山上的草一样，我们不注意到他们，往往也听不到他们的声音，可正是这些人支撑了我们的事业。”　　这部影片对于保持党的先进性是一部很好的题材，起到了预期的宣传和激励效果。　　影片结束后，在场的每一位党员被张思德的朴素和热忱感染着，他们神情凝重而若有所思。“人固有一死，或重于泰山，或轻于鸿毛，为人民的利益而死就比泰山还重。”毛主席对他的评价在我们耳边久久回响，它让我们深入体会到一个平平凡凡的工作岗位，也能成就一名普通党员的人生价值和信仰。与此同时，各个党支部也积极组织讨论，交流感受，相互学习促进。
       2015年8月28日上午，IBM中国研究院院长沈晓卫博士到访北京大学软件与微电子学院，北京大学信息与工程科学学部主任、软件与微电子学院理事长杨芙清院士出席会见并经行了亲切交流。北京大学软件与微电子学院院长张兴，副院长吴中海、院长助理李影等参加会见。
       北京大学软件与微电子学院自建院以来就与IBM有着广泛的合作。杨芙清院士回忆起软微学院和IBM历年来合作时强调：“双方的合作体现了产学研结合到产学研融合的变化，软微学院始终要求自己不断摸索规律，和IBM的合作就体现了这一点。”沈晓卫博士表示赞同，他指出，IBM和北京大学软件与微电子学院的紧密关系不仅是在毕业生就业方面，更是在科研师资的相互流通上，软微学院每年有大量的优秀生进入IBM，而IBM也有不少经验丰富的人才进入软微学院，这种共赢非常难得。
       随后，杨芙清院士代表北京大学软件与微电子学院向沈晓卫博士颁发聘书，聘任沈晓卫博士为北京大学软件与微电子学院软件技术与服务工程领域学科组客座教授。
       会见后，沈晓卫博士以“大数据与认知计算”为题为在校同学讲授了精彩的一课。
 
         七月的骄阳，用金黄的色彩铺满了整个大地。披带着这份象征着收获的色彩，北京大学软件与微电子学院的52名软件工程第二学位学士与120名软件工程硕士在翠色醉人的燕园参加了母校为他们进行的最后一次典礼。随着学位授予典礼的结束，这172名北京大学软件与微电子学院的优秀学子，从此结束了校园北大人的角色而开始了社会北大人的历程。此时，他们承载着的不仅仅是自身对于“北大人”这个光环的职责，更多的则是母校北大寄予他们的希望——以己之所学，报国之所望。    7月4日本科毕业生的毕业典礼于8：30分准时在百年讲堂举行。我院52名二学位学士和千余名其他院系的本科毕业生一起在百年讲堂聆听了校领导的寄语以及毕业生代表的感言。    下午1：30分到3：00我院举行了毕业生代表座谈会。党委白志强书记参加了座谈会。在座谈会上，白书记代表学院对毕业生的顺利毕业表示祝贺，并向毕业生表达了学院对于他们走向社会后的希望。毕业生们也就自己的学习心得与参加座谈的院记者团的同学进行了交流，希望能够通过记者团的同学把自己的学习经验和心得传递给更多的同学。并对两年多以来北大对于自己的培养表示了感激。同时，希望母校和学院放心，自己将在未来的工作岗位上继续发扬一个北大人的品质，一个软件与微电子学院人的品质，在未来的旅程中闪现更多的光芒。    下午4：00第二学士学位的学位授予典礼正式开始。会议由党委白志强书记主持。杨芙清理事长、陈钟院长、苏渭珍副院长分别出席了典礼。另外参加典礼的还有学院的老师和52名毕业生。典礼上杨芙清理事长对毕业生表示了热烈的祝贺，同时表达了学院对于毕业生的美好祝福和殷切希望。最后，杨芙清理事长与陈钟院长一起为毕业生举行了学位授予仪式。    研究生的毕业典礼于7月5日上午9：00在百年讲堂举行。我院120名软件工程硕士参加了典礼。并接受了校领导的学位授予仪式。典礼结束后，毕业生们与学院的领导、老师一起在图书馆前进行了合影。    阳光下，那一张张笑脸被留在了一张张的胶片之上，留在了绿意流淌的燕园之中，留在了波光涟漪的未名湖畔，留在了巍然挺立的博雅塔下。昨天，这172名学子，以北大人的身份吸取着北大“民主科学、兼容并蓄”的传统的灵气，践行着软件与微电子学院“开拓求实创业，严谨进取育人”的作风。今天，他们以一个北大人的身份，带着喜悦和硕果离开了北大，离开了软件与微电子学院。明天，他们将同样以一个北大人的身份踏上我们的社会，那时希望他们能得到更为灿烂的喜悦和更为丰满的硕果。因为那时，他们的那份喜悦和硕果不仅仅是他们的，更是我们国家的、社会的、北大的、以及我们软件与微电子学院的。    希望他们的明天更加的灿烂！
 
         4月20日，北京大学软件与微电子学院举办了一场别开生面的英语短剧大赛。院领导白志强副院长和苏渭珍副院长观看了比赛，并分别做了讲话和颁奖。大赛有五支队伍参加，参赛人数达28人。同学们精彩的表演不断迎来观众热烈的掌声，流利的英语表达能力获得了评委的好评。“千年等一回队”标准的英语口语和出色的表演获得了冠军。这次活动丰富了同学们的校园生活，激发了同学们学习英语的热情。
 
         北京大学软件与微电子学院是按新模式建立、新机制运行的北京大学直属学院，实行理事会领导下的院长负责制，探索多途径合作办学的管理体制与运行机制，积极开展与国际著名高校、国内外知名企业的合作，拉动社会资金投入，实现运作企业化、办学专业化和后勤社会化。学院秉承北京大学“民主科学、兼容并蓄”的传统，遵从“勤奋、严谨、求实、创新”的学风，以坚持创新创业、坚持面向需求、坚持质量第一为建院宗旨。并实行“专业教育学分制、素质教育学苑式、产学研用一体化”的办学模式。学院坚持面向全球招聘师资，其中40％为国内外专职教师，40％为国内外兼职教师，校内兼职教师占20％。（学院主页：http://www.ss.pku.edu.cn）         学院现有七个系：软件技术系、网络与通信技术系、嵌入式系统系、电子服务系、集成电路设计与工程系、管理与技术系、数字艺术系； 25个培养方向：软件开发、软件质量工程与测试、软件项目管理、信息监理、嵌入式系统工程、移动通信服务终端、数字家电、网络与通信工程、信息安全、电信运营支撑、电子政务、电子交易、电子金融、电子通信、IT企业创业与创新管理、IT市场营销、IT项目管理、专用集成电路（ASIC）设计、系统芯片（SOC）设计、集成电路设计方法学、电脑动画、数字艺术技术、电脑游戏设计、电脑游戏编程、影视制作等。         现因教学需要，面向国内外招聘专、兼职教师，具体要求          符合条件的应聘人员请下载“北京大学软件与微电子学院教学及教学辅助人员应聘申请表”，填写相关资料，附上详细的个人简历，寄至：北京大兴工业开发区金苑路24号（邮编：102600）北京大学软件与微电子学院 陈欢欢 收，或以电子邮件形式发送至：  （务必写明应聘的方向及职位）面试时间另行通知，应聘材料恕不退还。凡应聘者一经聘用，即为北京大学的教职员工，岗位在北京大学软件与微电子学院，享受北京大学软件与微电子学院的待遇。            联系电话：010-61273669  联系人：陈欢欢
 
         2005年12月13日下午，学院后勤服务中心在学院一层会议室举行部门工作会议，总结了2005年来学院的后勤服务保障工作。徐雅文常务副院长到会听取了员工的工作总结并作发言，指出后勤服务中心始终要坚持“服务第一”的理念，为学院教职员工、广大师生提供一个安定、舒适的教学、生活环境。 
 
        因工作需要，北京大学软件与微电子学院公开招聘出纳一名，负责学院财务室的出纳工作。试用期3个月，试用合格后按软件与微电子学院聘用人员有关规定办理。一． 招聘条件：1、 会计大专以上学历，具有会计从业资格；2、 工作态度认真，责任心强，能较好地与人相处共事，并有吃苦耐劳精神；3、 具有计算机操作基础知识，并熟练掌握办公及财务系统软件；4、 有一定的中英文口头和书面交流能力、较好的沟通协调能力；5、 身体健康；具有北京市户口。二． 报名办法：1、 需提交申请人个人简历；个人简历请发送电子邮件至： ；2、 初选合格者将通知面试，应聘材料恕不退还　　面试时请带上毕业证书、学位证书及其他相关材料（培训证书等）原件；3、 报名截止日期：2005年11月20日。　　　　　　　　　　　　　　 北京大学软件与微电子学院　　　　　　　　　　　　　　　　　 2005年11月4日
 
        12月16日上午，软件与微电子学院在大兴校区综合楼2楼会议室召开了2005年度教学研讨会议。会议由苏渭珍副院长主持，陈钟院长、徐雅文常务副院长、白志强副院长以及学院的多位教师出席了这次会议。　　苏渭珍副院长首先对这次教学研讨会的召开做了说明，教学工作是学院的核心工作，如何提升教师的教学水平，提高学院的教学质量，一直是学院十分关心的问题。　　在这次研讨会上，吴中海、黎怡兰两位老师首先结合自己承担的课程分别做了一节课的教学示范，然后大家共同就两位老师的讲授过程分别进行分析、点评，并就一些相关的问题及解决方式展开了讨论。　　另外，为加强教学工作，学院正在制订《软件与微电子学院教师教学工作规范》，通过这次研讨会，学院向教师们传达了这个规范的基本内容，并将听取教师们的反馈意见。　　最后，陈钟院长结合自己的教学经历对这次教学研讨会议进行了总结。
       陈振贵校长一行首先在吴中海常务副院长的陪同下参观了校园，对校区优美的环境和良好的教学科研条件表示了充分的肯定。
       3月2日上午，台湾实践大学校长陈振贵一行访问无锡校区。北京大学软件与微电子学院常务副院长吴中海、新兴交叉学科组教授罗正忠、软件技术与服务工程学科组副教授段莉华等参加了会见。
       在无锡校区就读的2015级硕士研究生中有四名是实践大学毕业生，陈校长一行专程去学生宿舍看望他们，详细了解同学们在无锡的学习生活情况，与同学们亲切交流，并勉励他们用功学习，保重身体。
       参观结束后，双方进行了座谈。陈振贵校长首先介绍了实践大学的相关情况和“跨领域、多专长”人才的培养理念，表示期待与北京大学软件与微电子学院开展相关合作。吴中海常务副院长对陈振贵校长一行的到来表示欢迎，并介绍了学院的学科发展和人才培养情况，学院在教学与科研等多领域已与境内外多所知名高校建立了良好的合作关系，希望实践大学此次来访，能够取得更多有益的成果。双方就在学科建设、人才培养等方面开展进一步合作，达成了初步意向。
 
         近日，软件与微电子学院喜报频传，其数字艺术设计系学生作品分别在“北京电影学院第五届动画学院奖”、“首届中国学院奖”等大赛中获得多项大奖，为北京大学艺术学科跨入国内高等教育前列写下浓厚一笔。　　　　北京大学软件与微电子学院数字艺术设计系是适应我国动画产业对人才的迫切需求而设立，该系全球聘师，采用国际先进的课程体系、双语教学和学分制培养模式，培养动画、特技、影视、游戏、多媒体、广告、包装等领域的高层次、复合型、实用型、国际化数字艺术设计人才。经过2年多的发展建设，在国内外教师的辛勤工作和学生们的刻苦努力下，教学方法不断创新，教育水平稳步提高，学生创作的作品开始在国内崭露头角。送选作品分别在“北京电影学院第五届动画学院奖”、“首届中国学院奖”等大赛中获得下列奖项：　　1. 首届中国学院奖最佳技术制作奖：《种》－作者：廖莎莎、王理；指导老师：王强　　2. 首届中国学院奖最佳美术设计奖：《望夫石》－作者：赵贵胜、吴天琛、谭雷雷、李翔等　　3. 首届中国学院奖最佳视觉效果奖：《鸿》－作者：马宁洲、李明、王宁、朱江；指导老师：王强　　4. 首届中国学院奖优秀教师指导奖：王强　　5. 北京电影学院第五届动画学院奖优秀论文二等奖：《动画蒙太奇在动画电影中的应用》－作者：余丹；指导老师：王强　　6. 北京电影学院第五届动画学院奖评委会特别奖：《旅》－作者：李小牧、管筱梅、朱险峰、韩斌、张雯；指导老师：王强、Jerry.Verschoor　　7. 北京电影学院第五届动画学院奖最佳新人奖：《纤纤》－作者：李毅；指导老师：王强、Jerry.Verschoor、王伟　　8. 首届中国国际动漫节原创动漫大赛学院奖最佳动画短片奖银奖：《逝去的记忆》－作者：宋亦鹏、赵黎丹；指导老师：王强　　“中国学院奖”是国内高等教育艺术类作品顶尖级奖项，由中国艺术教育促进会、中国动画学会、中国版权保护中心、中国出版工作者协会电子与网络出版工作委员会等十多个全国性行业协会和机构共同设立和参与。首届中国学院奖涵盖多媒体、动漫、数字音乐、文艺理论四个方面。　　“北京电影学院动画学院奖(简称动画学院奖)”是由北京电影学院动画学院创立于2001年12月的专业性动画评奖活动，每年举办一届。学院奖的宗旨是鼓励与推动具有独立精神与创造性的动画创作，不断挖掘与充分展示动画作为艺术的多样性，为真正热爱动画艺术的人提供展现自我与互相交流的机会，促进动画创作中的学术发展。
　    2005年12月18日上午，中共无锡市委常委、北京大学软件与微电子学院无锡产学研基地联合筹备工作领导小组常务副组长盛克勤到北京大学大兴校区，与软件与微电子学院理事长杨芙清院士、理事王阳元院士以及学院院长陈钟教授等有关同志，就如何尽快开展无锡产学研基地建设等有关筹备工作交换了意见。
 
 
 
 
　　“我给比尔·盖茨展示了‘青鸟工程’的成果，他还兴致勃勃地动手操作我们的系统。通过创造性的劳动，我们向世界展示了我国软件工程的水平。”杨芙清说，作为我国第一个，也是世界上为数不多的大规模综合性软件工程支撑环境，青鸟系统的许多创造让美国的一些公司感到震惊。
       在这次展览上，北京大学软件与微电子学院数字艺术系王强教授与其硕士研究生肖妍然、左梦巧、赵磊共同完成的综合材料装置艺术作品《殇》获得中国第三届舞台美术站暨视觉艺术双年展金奖；王强教授与其硕士研究生刘明亮、吴菲菲、陈露、郭艺伟共同完成的作品《运》获得中国第三届舞台美术站暨视觉艺术双年展铜奖；王强教授布面油画作品《面》获得中国第三届舞台美术站暨视觉艺术双年展戏剧人物画专题特别奖。
　　把事情做精做透的前提是锲而不舍的追求。怀着对华罗庚等数学家的敬仰，杨芙清１９５１年考入清华大学数学系，次年随着院系调整转入北京大学。在１９５７年我国赴苏联的留学生中，她是唯一的研究生。专注和悟性使年轻的杨芙清崭露头角，留学期间独立设计出的逆向验证方法――《分析程序》，引起了当时世界各国专家的关注，被西方杂志称为“程序自动化早期的优秀之作”。
　　“我今年已经７０多岁了，但从来没觉得自己老，因为我一直在思索如何创造。我认为，要做好一件事，需要做精、做透。”回首自己的经历，杨芙清教授这样说。
　　杨芙清先后参与我国第一台百万次集成电路数字电子计算机研制、我国首次大型系列计算机研制，分别负责计算机指令、操作系统设计和系统软件设计。研制百万次计算机时，面对西方和原苏联的技术封锁，无资料、无配套设备、无经验。杨芙清回忆，完成系统软件的设计后，却没有测试环境，怎么办？经过集思广益，团队自主设计了一种模拟审查的检测方式，将所有的逻辑框图都悬挂在墙壁四周，由设计人员担当角色进行模拟运行，经过反复模拟修改后，大大缩短了上机调试的时间。
　　从１９８３年起，杨芙清担任北大计算机系主任１６年。她组织全系师生员工累计完成了１２５个科研项目，其中国际领先２项、国际先进９项、国内首创８项、国内领先６３项。
　　前后两次的留苏经历，不但开阔了眼界，也让杨芙清深深感到祖国需要计算机科学和技术，于是，要在计算机研究领域为国效力成为她的追求。
       由文化部艺术司与中国舞台美术学会联合主办的2015年中国第三届舞台美术展于2015年11月26日在北京798艺术区悦美术馆举行。本届展览主题为“创意空间与文化生态”，旨在提示当下“大舞美”观念的开放性，以及引发对文化发展可持续性的认知和思考。
　　软件产业人才的匮乏成为制约中国ＩＴ产业发展的瓶颈。２００１年，７０岁的杨芙清又负责筹建北大软件学院，培养国际化人才。杨芙清说：“我喜欢挑战，越困难越有斗志。”
　　在向以男性称雄的信息技术领域，杨芙清这位巾帼英豪以自己的聪明才智和顽强意志，像一只青鸟翱翔云端。  
　　中国市场是世界上变化最快的市场，正是这样的市场变化挑战给众多的软件厂商带来了巨大的市场机会。不过，对低成本，易于改进的好软件的缺乏将会严重阻碍经济的发展，而相反，如果能把握此机会，无论是对于中国用户还是软件企业而言，全球化的可持续竞争优势都近在咫尺。　　Matin先生认为：“只有敏捷的软件开发模式才能够让IT跟上业务变化的脚步，只有敏捷的开发模式才能使软件实现快速交付的同时又能成为一个高质量、低成本的软件。”而且他认为：西方国家在这方面的经验，对国内厂商有着重要的借鉴意义。　　这也正是为何Martin先生要与国内专家、媒体一起，共同分享国内软件产业发展的经验与心得，互相交流。 除Martin先生以外，本次研讨会还将邀请来自北京大学、北京邮电大学等著名学府的软件学院院长；来自信息产业部、科技部、北京市、中国软件行业协会的领导；以及来自各大平面媒体、网站的20余名记者，共40人，以小型圆桌讨论的形式，就敏捷软件开发、西方软件开发领域的新趋势、中国软件企业的敏捷开发之道进行充分的交流。 　　附：马丁-福勒(Martin Fowler)简介　　现任思特沃克公司首席科学家的马丁-福勒先生是当今世界软件开发领域最具影响力的五位大师之一。作为一位敏捷软件开发方法的早期开拓者，福勒先生对IT 业的影响是不可估量的。　　思特沃克公司是一家跨国专业IT 服务公司，总部设在美国芝加哥，并在加拿大、欧洲、澳大利亚、中国及印度等国家和地区设有分公司。福勒先生是一位知名的作家、软件顾问兼演讲大师，他凭借16年丰富的经验帮助各企业将前沿技术应用于关键业务信息系统中. 　　在福勒先生的职业生涯中，他大力倡导业内最先进的软件开发技术，如统一建模语言UML(Unified Modeling Language)、极限编程XP(Extreme Programming)、重构 (Refactoring) 与分析模式 (Analysis Patterns) 等。在为倡导改革的大型公司们提供解决方案的同时，他进一步完善了这些技术。这些大公司包括花旗银行、埃森哲咨询公司 (Accenture) 、Sterling Software 及戴姆勒-克莱斯勒汽车公司等。　　福勒先生拥有丰富的基于对象的和基于组件的先进开发技术经验，他使用先进的技术为企业客户解决了许多实际的商业困难。作为首席科学家，福勒先生曾经并将继续努力帮助客户开发和实施依据自己专长所开拓的最佳实践方法、领导思特沃克公司利用最先进的技术在软业开发领域不断创新，并坚持不懈地在软业界的各种会议上推广先进的理论和技术。　　福勒先生经常在许多国际软件开发会议上发表演讲。他曾担任XP 2005 与2001年的 Agile Universe 大会的议程主席。他是 IEEE 软件杂志的专栏作家，也是敏捷联盟 (Agile Alliance) 的创建人及《敏捷软件开发宣言》(Manifesto for Agile Software Development) 的作者之一。思特沃克公司为福勒先生办有一个非常流行的网站：www.martinfowler.com，福勒先生常撰写文章并与博客网上即时交流。
　　为勇立数字文化产业的潮头，软件学院成立了数字艺术系，先后聘请了两位国际上知名的专家担任系主任，分别是来自美国好莱坞的奥斯卡短片奖评委、来自加拿大的一名著名动画学院创始人，还聘任了５名全职的外国专家作教师。在教学上，采取“作品轮训”的方法，重视培养学生的原创能力。如今，学院培养的学生成为市场的抢手人才。
　　附：宋茂强简介　　宋茂强，1957年4月生人，教授，现任北京邮电大学软件学院常务副院长。 　　1984年获北京邮电学院计算机应用专业硕士学位。1987年10月至1989年9月在瑞士伯尔尼大学做访问学者。 　　1991年破格晋升副教授，1992年开始指导硕士研究生。1992年8月被评为北京市优秀青年骨干教师。1996年晋升教授职称。 　　作为项目负责人或主研人参加了10多项项目的研制开发工作。其中，"DS-2000程控数字电话交换机"项目获邮电部科技进步一等奖(集体奖)(1987年)和国家科技进步一等奖(集体奖)(1988年)；"DS-30中大容量程控数字市内电话交换机"项目获国家七五攻关表彰(1992年)；"MT-256数字程控调度总机"获辽宁省科技进步二等奖(列第二位)(1995年)；"HAX-SP1数字局用程控交换机"获广东省科技进步三等奖(列第二位)(1997年)。
 
         2005年12月20日中午，学院特聘国外、海外教师与学院领导共同聚餐，学院理事长杨芙清院士在讲话中对国外、海外教师为学院的建设和发展所做出的贡献表示了诚挚的谢意，学院院长陈钟教授向国外、海外教师表示了圣诞和新年的祝贺。
　　福勒先生的著作精品包括《重构-改善既有代码的设计》(Refactoring: Improving the Design of Existing Code) ，荣获多个奖项的《UML精粹：标准对象建模语言简明指南》(UML Distilled：A Brief Guide to the Standard Object Modeling) 第二版、《分析模式：可重用的对象模型》(Analysis Patterns：Reusable Object Models) 、《规划极限编程》(Planning Extreme Programming)、 和《企业应用架构模式》(Patterns of Enterprise Application Architecture)。福勒先生还为 Addison-Wesley 出版公司编辑了系列著作。　　教育背景：拥有伦敦大学学院电子工程与计算机科学专业的理科学士学位　　　　附：陈钟先生简介　　博士 博导  现任北京大学软件与微电子学院院长；北京大学信息科学技术学院教授。　　主要研究方向：操作系统、软件工程，信息安全。发表著作论文30余篇。先后参加国家 “六五”、“七五”、“八五”及“九五”期间的重大科技攻关项目。并获得过国家科技进步2等奖、电子工业部科技成果特等奖、北京市优秀教师。　　年仅十六岁、上高中一年级时就考入北京大学计算机系，并幸运地成为著名软件工程专家杨芙清院士的弟子，相继在北京大学获得学士、硕士和博士学位。他也曾经是北大历史上最年轻的教授和最年轻的博导。在北大的二十多个春夏秋冬里，陈钟博士的科研和教育成果获得了无数的荣誉和奖励：　　承担过国家科技攻关重大项目“青鸟工程”；　　参与创办北大青鸟集团并担任技术总监；　　担任北大青鸟寰宇公司总裁，成功运作公司香港创业版上市；　　曾在美国著名大学UCLA学习和工作；　　1995年被评为北京市优秀教师；　　1996年荣获第五届中国青年科技奖。　　他的经历和他勤奋执着、积极进取、勇于创新的个性，使他在国家急需软件人才、北大成立软件学院的历史时刻，接过了软件学院院长这个极具挑战性的繁重工作。
　　2005年6月2日，来自信息产业部、北京市科委、中国软件行业协会的领导，北大、北邮软件学院的院长们齐聚一堂，和世界五大软件开发教父之一的matin(马丁-福勒)先生一起，就目前西方软件开发领域的新趋势，以及其在中国的应用展开了热烈的讨论。(届时，新浪科技将现场直播，敬请关注)。
        今晨，北京大学软件学院选派的嵌入式系统系五名在读工程硕士研究生踏上了新加坡的国土，参加新加坡著名学府---南洋理工大学进行为期5个月的实习实践活动。该项目是由新加坡政府资助，旨在促进和加强中新两国文化教育交流、科研合作。这是软件学院培养高层次、实习型、复合型、国际化人才的具体体现。此前，软件学院院长陈钟、书记白志强召开了赴新加波南洋理工大学实习学生的实习动员会，并为学生送行。院长们语重心长地告诫学员"走出校门，即代表北大；走出国门，即代表中国"，同时，又寄予了殷切的期望，希望赴新的学员珍惜机会，不负重望。此次赴新加坡的学员是：周晓丰、孙亨博、罗华亮、邹广伟、金振宇。北大软件学院新闻中心报导。
 
         为了进一步加强对研究生组织的规范管理，增强研究生自我教育、自我管理、自我服务的能力，不断在研究生中鼓足干劲、凝聚力量、弘扬正气，由参加本次选举的“五四”团队和“6127”团队两支队伍申请，经学院团委审批，于9月20日在教学楼3303会议室召开了2005年北京大学软件与微电子学院研究生会第四届执委会主席团换届选举大会。　　出席本次大会的有北京大学软件与微电子学院党委书记兼副院长白志强、副院长苏渭珍、学生办公室主任王柏艳、团委书记孔令博、第三届研究生委员会成员和研究生会代表及学生共二百余人。参与竞选的两支队伍在竞选大会上进行了精彩的竞选演说和答辩，竞选演讲和答辩结束后举行了无记名投票，“五四”团队以超过与会人数半数的得票优势当选为新一届研究生会的主席团。随后，“五四”团队的研会候选主席李天飞发表了激情洋溢的就职演说。　　会后，白志强书记和苏渭珍副院长分别对新当选的“五四”团队表示祝贺，也对落选的团队在竞选前期主动为大家工作、服务的精神表示敬意。并希望研究生会发挥好桥梁作用，同时不断提高自身素质，起到良好的带头作用。　　最后，王柏艳老师对新当选的研究生会主席团今后的工作提出了具体的要求，希望新成立的研究生会要切实做好工作、开展积极有益的活动；同时，希望全体研究生代表能够继续履行和发挥代表的职责和功能，加强与学校的信息沟通与反馈，共同为我们软件与微电子院的广大同学创造一个良好的学习、生活环境，为我院的发展贡献力量。　　新一届研究生会主席团的诞生，将为我院学生的全面发展注入新鲜活力。
       12月13日，北京大学软件与微电子学院校友会第二次理事大会在北京大学理科一号楼1504会议室成功召开。北京大学软件与微电子学院校友会会长陈向群，执行会长杜鹏，以及30余名校友会理事一起参加了此次大会。  
       执行会长杜鹏对校友会提出下一年工作的计划。他希望校友会能够借助 “友爱杯”创新创业大赛的契机，筹办创新创业新年论坛。通过校友的积极讨论，校友会决定将在下一年筹办创新创业新年年会，组织第二届“友爱杯”创新创业大赛以及组建校友会秘书处学生联络部等。
       首先，主持人向到场理事总结了校友会成立一周年来工作的开展状况。接着，到场理事成员用集体鼓掌的方式通过了增补步超、张韧禾为理事成员的决议。
       校友会会长陈向群对校友会年度工作计划、日常活动开展、执委会日常管理等相关事项做了相应的规划和部署。来自全国各地的校友理事都表示，将积极支持和关注学院的发展、校友的发展，努力为学院做出应有的贡献。
    7月26日，北京大学无锡校友会会长康伯霖一行在北京大学软件与微电子学院党委书记、副院长白志强、北京大学软件与微电子学院无锡产学研合作教育基地副主任王平等陪同下，参观了以“江南燕园”著称的无锡基地。康伯霖会长还就北大校友会挂靠无锡基地及定期举行联谊活动等与无锡基地有关负责人进行了认真商谈。 
    此次参观的北京大学无锡校友会成员包括北京大学无锡校友会会长康伯霖、理事会成员李冰（七O二所党委副书记、纪委书记、工会主席）、冷文浩（中国船舶科学研究中心副总工、信息技术室主任、上海奥蓝托软件技术有限公司）、芮立平（中国国际贸易促进委员会无锡市支会、中国国际商会无锡商会副会长）。北京大学软件与微电子学院党委书记白志强首先感谢校友们多年来对于母校建设的关注和支持，特别是无锡基地的建设中，北大校友给予了高度关注和大力支持；北京大学软件与微电子学院无锡产学研合作教育基地副主任王平向无锡校友会成员详细介绍了无锡基地的发展、建设情况。康伯霖会长代表校友表示：看到这所“江南燕园”，就像回到了家。康会长还详细介绍了无锡校友会情况：北大无锡校友会成立于上世纪八十年代，以团结、联谊等为宗旨，成员近120人。会员既有四十年代的毕业生，也有刚走出北大校门的毕业生，所有会员来自北大各个学科，绝大多数服务于科研院所，还有部分毕业生在政府机关工作。所有会员对于北京大学在无锡建立基地表示十分高兴，愿意为母校的建设作出贡献。 商谈中还对校友会和无锡基地协作，在无锡基地设立办公室，成立校友活动中心，并定期举行活动等事宜进行了具体磋商。
       6月10日下午，IBM Rational中国开发中心总经理严成文先生来访，学院陈钟院长会见了严先生一行，并进行了亲切会谈。会上，陈钟院长向来访人员介绍了学院的办学情况以及无锡基地的发展建设情况。目前学院与IBM公司在服务学、大型机技术等方面开展了多项合作，双方表示今后将在更多领域开展深入和密切的合作。
    会谈结束后，严成文先生为学院师生作了题为“IBM Cloud Computing Overview”的精彩演讲。演讲内容包括：云计算技术概述，IBM在云计算方面的领导地位和研究成果以及IBM中国开发中心关于云计算的创新与部署等方面。精彩的讲座受到了软件技术系、服务科学与工程系和金融信息工程系师生的热烈欢迎，严先生就师生们所关心的云计算方面的问题作了精辟解答。
       2015年12月25日，北京大学软件与微电子学院与北明软件有限公司合作框架协议暨奖教奖学金捐赠协议签字仪式在北京大学理科一号楼会议室举行。北明软件向北大教育基金会一次性捐赠人民币100万元设立“北京大学软件与微电子学院北明软件奖教奖学金”，用于奖励和资助我院的优秀教师和学生。
       北京大学软件与微电子学院常务副院长吴中海与北明软件有限公司董事长李锋代表双方签署了协议。北明软件CTO颜军、副总裁黄忠、总裁助理楚宁志，我院院长助理李影、综合办主任倪际航、发展办主任赵泽宇等共同见证了签字仪式。
       作为北大校友，李锋董事长深情回顾了在北大的求学岁月，感谢北大的培养，感谢北大为北明软件输送了许多优秀人才。此次设立“北京大学软件与微电子学院北明软件奖教奖学金”，是对母校的些许回报，希望以后能有更大数目的捐赠。李锋认为，做软件工程离不开与产业的紧密结合，北明软件作为一家国内领先的行业软件企业，北大软微学院作为国家示范性软件与微电子学院的领头羊，希望双方能开展全面、深入的合作。
       吴中海常务副院长代表学院感谢北明软件的慷慨捐赠，并转达了杨芙清理事长、张兴院长对北明软件捐赠的感谢。谈到双方的合作，吴中海谈了对杨院士提出的前瞻性和“零距离”的理解，“中国制造2025”对实现中国梦具有重大战略意义，迫切需要新一代信息技术的领军人才及团队，迫切需要削掉学校与企业之间的门槛，实现校企深度融合。吴中海建议，杨院士提出的“面向工业应用、软硬结合的智能化系统”可以作为双方开展合作的主要领域。
       10月30日，北京大学软件与微电子学院成立七周年暨2008-2009学年总结表彰大会在大兴校区教学楼3303室召开。陈钟院长、张兴常务副院长、徐雅文常务副院长、苏渭珍副院长、白志强副院长和吴中海副院长出席会议。会议由白志强副院长主持。 
       陈钟院长对学院2008-2009学年的工作进行了总结。他从学院的教学改革、合作与科研、规范化运行和无锡基地建设等方面回顾了上学年学院的主要工作，充分肯定已经取得的成绩。教学质量稳步提高、毕业生就业保持良好势头和师生获奖成为学院标志性成果。陈钟院长还对下一步工作进行了部署，他表示，学院要坚持创新创业，提高教学质量和科研水平，希望在建院十周年时，学院发展能实现大的飞跃。    徐雅文常务副院长宣布2008-2009学年评优结果：郁莲、张齐勋、杨雅辉、邬国锐、赵占波、曹健、沈晴霓、马克宣、陈燕平、曹振洲、王海燕、赵泽宇、王柏艳、王永明、宋西国、王小春、周伟民、纪敬、杨家丽、邹自力、刘战奎等21人为学院“2008 - 2009学年先进个人”称号。
                                                         学院领导为获奖代表颁奖
                                                                颁奖仪式现场
                                                                颁奖仪式现场
       2015年9月21日下午，荷兰特文特大学校长 ED Brinksma教授率代表团访问北京大学，北京大学副校长高松、国际合作部副部长郑如青、软件与微电子学院副院长吴中海在临湖轩亲切会见了远道而来的客人。软件与微电子学院综合办公室、新兴交叉学科组相关人员参加会见。
       本次会面为双方校级层面首次接洽，双方在各自介绍后，增进了对彼此的了解，随后双方初步探讨了多种合作的可能性，如学生交换和联合办学等。此前，特文特大学行为学学院和北大软件与微电子学院已在“技术传播与翻译”领域开展一系列合作，未来两校会进一步增进了解，并逐步将合作交流扩大至校级范围。
       高松副校长向ED Brinksma教授的到访表示欢迎，他向来宾介绍了北京大学在教学、科研以及国际合作等方面的基本情况，随后特文特大学校长Brinksma也介绍了特文特大学的相关情况。他说，北京大学是一所综合性大学，学科门类齐全，特文特大学则是一所理工类大学，其纳米技术，生物医药工程技术等优势学科均处在世界领先水平，期待双边在相关领域进一步提升合作空间。
       会后，双方互赠礼物，并合影留念。
       北京大学软件与微电子学院副院长吴中海为本次大会致辞。吴中海副院长在致辞中讲到，产品经理最重要的两件事情，一是引领未来，要创造新的产品出来，二是把现有的产品更好地经营好，更好地提供服务。产品经理是互联网金融领域最重要的人才，要引领未来，同时也要把握现在。
       2015年11月10日，“互联网金融产品经理大会”在北京大学英杰交流中心阳光厅隆重举行。北京大学软件与微电子学院副院长吴中海、工程管理硕士教学中心主任黄嵩和零壹财经CEO柏亮出席此次活动。
       零壹财经CEO柏亮、大同行董事长李鑫、美利金融的高级副总裁史志隽先后发表了主题演讲。
       宜人贷的CTO段念、掌众金融的产品副总裁朱宇分别介绍了各自公司特色的互联网产品。
       零壹研究院院长李耀东、联动优势助理总裁徐海东、时间戳互联网金融部总经理邢东岩、懒财网CTO李子拓、零壹研究院研究院奚玉莉就互联网产品的安全和体验进行了圆桌对话。
       软件与微电子学院工程管理硕士教学中心主任黄嵩，介绍了学院在互联网金融与金融大数据人才培养方面的情况，并欢迎大家报考工程管理硕士。
       10月16日下午，北京大学软件与微电子学院2014-2015学年总结表彰大会在学院大兴校区举行。软微学院全体领导班子成员和全体教职员工参加会议。大会由学院副院长吴中海主持。
       首先，张兴院长作"北京大学软件与微电子学院2014-2015学年工作总结报告"。他从教育教学、科学研究、人才队伍建设、对外合作与交流、行政和党委管理体系建设等五个方面回顾总结了上一学年的工作，并阐述了今后一个阶段学院的工作要点。他指出，新一学年，学院要继续推进学科建设，提升科研水平与成果转化能力，努力营造适合时代发展的创新创业与人才培养环境。同时，要进一步强化学生和教师作为学校主体的意识，提升学院的管理服务水平，紧跟上北京大学的综合改革步伐，以高度负责的态度，扎实做好各项工作。
       本次全院工作总结表彰大会全面梳理了2014-2015学年学院的各项工作，在总结成果的基础上，提出了学院进一步发展和改革的方向和目标，对推动学院各项工作的快速发展具有重要意义。大会在热烈的掌声中落下帷幕。
       学院党委书记陈向群宣读了“关于授予2014-2015学年‘先进个人’称号和‘年度贡献奖’的决定“。吴中海副院长依次宣读获奖词，并代表学院向获奖者表示祝贺。随后，张兴院长为获奖教职工颁发荣誉证书，并感谢他们为学院的发展付出的辛勤劳动。                              
                                             Sun公司主任工程师Scott Rotondo
       上午七点，虽然邱德拔体育馆外下着大雨，但场馆内各个学院的老师和志愿者们已经在迎新现场做好了准备，软微学院迎新点也已就位待命。报到的同学们陆陆续续地来到软微学院的站点报到，在现场老师和志愿者的引导和帮助下顺利完成注册。北京大学党委书记朱善璐，校长林建华等领导一行来到现场慰问。软件与微电子学院党委书记陈向群在现场陪同。
       2015年9月5日，秋雨蒙蒙之中，北京大学软件与微电子学院迎来了2015级新生入学，为确保全体学生可以顺利完成入学，软微学院在校本部、大兴校区、无锡校区分别设立工作小组，为入学新生提供了周到细致的接待工作。在三个校区紧密配合之下，软件与微电子学院圆满完成了2015级所有新生的入学工作，留下了无数精彩瞬间。迎新当天，北京大学软件与微电子学院共迎来了813名新生，其中包括硕士生726人，二学位学生69人，博士生18人。
                                          陈钟院长在会上讲话
                                            
       软微学院老师和志愿者们为初来乍到的新生提供了热情周到的服务，为大家仔细讲解报到流程，为冒雨赶来的新生准备热水、毛巾等物品，同时，学院还加开了校车，以便让新生可以直达大兴校区。
       软件与微电子学院大兴校区的迎新工作是每年学院迎新的重要环节，学院大部分新生在此报到。
       9月5日上午，“京南燕园”也迎来了绵绵秋雨，同学们早早来到了现场，工作人员打开教学楼所有教室，让学生和家长在教室安顿休息。报到过程涉及学工、教务、财务、食宿等多个环节，现场工作人员紧密配合，尽量减少同学们的等待时间，迎新现场秩序井然。
       同一天，北京大学软件与微电子学院无锡校区的迎新工作也如火如荼地进行，老师们通过细致入微的服务让同学们在“江南燕园”感受到了北大的氛围，并顺利完成了迎新相关工作。
       9月6日上午，学院进行了新生入学教育，刚刚放下行李的同学们怀着对研究生生活的向往，在3302和3303教室聆听了来自老师们的叮嘱。北京大学软件与微电子学院院长张兴、党委书记陈向群、常务副院长杜鹏、副院长吴中海、副院长林慧苹以及学院各学科组、职能部门的老师参加了入学教育仪式。
       在入学仪式上，张兴院长致欢迎辞，他祝贺来自五湖四海的新同学们进入北京大学软件与微电子学院学习，为学院注入了新的活力。他勉励大家以一个研究生的心态去主动探求知识，发挥更多自主性，也希望广大同学能够在研究生生涯中收获友谊和成长，真正做一名成功的北大人。林慧苹副院长向在场新生介绍了软微学院的教学成果与发展历史，并从实际出发向各位同学介绍了学院的培养体系。陈向群书记在最后的素质教育报告中指出，相比于知识的获得，同学们在研究生生涯期间，更重要的是品格的完善，身为一名北大人，更应如此，一个北大人不仅要有知识的沉积，更要有那一份来自燕园的情怀。
       在入学教育仪式上，来自学院综合办公室、教务办公室，学生工作办公室、图书馆的老师们，也就和同学们息息相关的话题，向大家进行了介绍。
       我在软微遇见你，因为你的到来，北京大学软件与微电子学院注入了新的活力。祝愿新同学们尽快适应北大的学习与生活，创造属于自己的辉煌！软微欢迎你！
        11月23日中午12：30，北京大学软件与微电子学院学生社团宣讲与答辩会在3303顺利举行。　    参加此次宣讲答辩会的有：团委书记孔令博老师，团委各成员、各社团负责人及社团成员等。主持人宣布社团成立答辩会正式开始之后，各个社团负责人分别按顺序上台作基本的社团申请陈述，针对各自社团的宗旨、常规活动、组织机构等等进行了详细介绍，并声情并茂地讲述了自己创办社团或者参与社团的激情与梦想，有的还顺便把现场当做了一场纳新宣讲，激情的演说吸引了不少人的目光。大会在轻松愉快的气氛中进行着，也让我们对这些新老社团有了更进一步的认识。之后由评审老师和感兴趣的同学自由发问，各社团负责人进行了精彩的答辩。最后，孔老师讲话并宣布评审结果，参加本次答辩的十支社团均顺利通过答辩，成为北京大学软件与微电子学院第一批正式通过审核的社团组织。参加本次答辩的社团有：北京大学IT协会(校级)　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　北京大学数字艺术学会(校级申请中) 　　　　　　　　　　　北京大学软微青年创业联盟 　　　　　　　　　　　北京大学软件与微电子学院新知社 　　　　　　　　　　　北京大学软件与微电子学院开拓者协会 　　　　　　　　　　　北京大学软件与微电子学院乒乓球协会 　　　　　　　　　　　北京大学软件与微电子学院排球协会 　　　　　　　　　　　北京大学软件与微电子学院健身俱乐部 　　　　　　　　　　　北京大学软件与微电子学院羽毛球协会 　　　　　　　　　　　北京大学软件与微电子学院长跑健身协会
 
      2006年8月24日下午，英特尔全球副总裁、高级院士Richard Wirt博士、英特尔亚太研发有限公司总经理杨文洛博士一行访问北京大学软件与微电子学院。学院理事长杨芙清院士、陈钟院长、吴中海副院长会见了Richard Wirt博士一行，并进行了亲切会谈。会上，杨芙清院士向来访人员介绍了学院的办学情况以及无锡产学研合作教育基地的筹备情况。Richard Wirt博士对学院的发展给予了高度赞誉。目前学院与英特尔公司在多核技术、开源软件、嵌入式系统等方面开展了多项合作，双方表示今后将在更多领域开展深入和密切的合作，如数字内容创新研究中心项目。
      此次来访，英特尔一行还出席了在北京大学国家Linux技术培训与推广中心举办的Linux教学研讨会。
 
        在经历了几个月的紧张备战后，我院 “SMART FLOW” 代表队顺利杀入决赛，各代表队之间的激烈竞争于12月1日上午在北京大学国关大厦展开。此次大赛评委分别由来自于花旗集团、产业界、教育界的代表组成，其中包括花旗集团欧洲及中东区技术主管 Mr.Ian Cramb 、IBM中国研发中心首席架构师、IBM院士 王云先生、花旗软件技术服务（上海）有限公司总经理 何维忠先生、中国银联银行卡产业顾问委员会成员、中国科学院研究生院软件学院院长 潘辛平先生、复旦大学软件学院院长 臧斌宇先生等10位专家评委。在各院校代表队进行了精彩的作品演示、展示之后，专家评委于12月1日晚上给出了评审结果，并提交大赛顾问委员会审议。　　12月3日上午，花旗集团金融信息科技教育基金项目2005颁奖典礼暨第二届金融信息化人才培养论坛在北京大学国际关系大厦秋林报告厅举行。花旗银行亚洲技术中心主管曾昭河、北京大学党委副书记张彦、教育基金理事会代表沈鸿舒、教育部高等教育司副司长葛道凯为颁奖典礼先后致辞。教育基金项目顾问委员会主席、中国科学院院士杨芙清当场宣读了首届“花旗杯”科技应用大赛的最终获奖者名单。其中一、二、三等奖，分别由来自北京大学（我院代表队）、复旦大学、中国科技大学、同济大学、武汉大学和中国科学院在内的8支参赛队伍获得，其中我院 “SMART FLOW”小组作为北京大学代表队荣获二等奖。一等奖则被华中科技大学参赛队以名为“Bank-Mobile”的作品捧走。　　花旗银行集团还在现场颁发了“花旗集团金融信息科技优秀奖学金”。这一奖学金的设立主要是为了引导国内金融信息化人才培养的方向。奖励的对象为主修计算机、软件工程或金融管理专业大学生。今年全国共有80余名学生获得了奖学金，获奖学生是经过层层选拔最终入围的，其中北大共有四名学生获奖，其中我院学生高志强、陈昕两名同学荣获此优秀奖学金。　　颁奖典礼完毕后，在花旗集团的主持下，召开了金融信息化人才培养论坛，来自于政府、产业界、教育界的领导、专家分别就此主题作了精彩发言，其中我院院长陈钟教授作为教育界代表做了富有创新性思想的精彩演讲，获得了与会专家、代表的高度认可。我院作为此次活动的协办方，通过协调各方面资源，保证了此次活动的顺利举行，尤其感谢各位志愿者的努力工作，是他们的敬业负责、乐于奉献的态度保证了各方面工作的顺利开展。附：　　我院“SMART FLOW”小组名单：         张炜 张乃岳 李斌 黎鹏 谭峰　　我院志愿者名单：         武玉兰 刘荣华 李良美 孟 暾 李 殊 刘力涛 陈彦均 杨 睿 张彩虹 张 婧 段 莹
       为加强对入党积极分子的理论教育，提高党员的思想认识水平，加深党员对党的最新路线、方针、政策的了解，北京大学软件与微电子学院学生工作办公室成功举办了一场“一战到底”党的知识大赛。本次活动历时两个月，分为初赛、决赛两个阶段。 “一战到底”党的知识大赛初赛共有50多名同学参赛，经过两轮比拼后，12名同学脱颖而出，获得了决赛的入场券。
       12月18日，决赛在教学楼3302举行。学院党委书记陈向群出席了本次活动。经过必答题、轮答题、抢答题的激烈角逐，最终得出一等奖、二等奖、三等奖和优秀奖。最后，陈向群就本次活动进行了总结。她充分肯定了本次大赛的举办意义，提出希望把这样的创新活动作为我院的特色活动继续发展，并在规模上进一步扩大。
       此次竞赛活动是一个积极学习参与党的群众路线教育实践活动的良好平台，是一次学习，一次检阅，也是一次展示，进一步引导党员认真开展党的群众路线基本理论、基本思想学习和宣传，提高党员的政治素养，加强党性修养和理论知识水平，加深全局党员的学习意识、服务意识、党纪党风意识，让党员们在政治上、思想上和行动上更加自觉地向党组织靠拢，有力地推动了软件与微电子学院党支部的群众路线教育实践活动扎实开展。
      2006年9月5日上午9:00，北京大学软件与微电子学院2006年秋季开学典礼在大兴校区举行。学院理事长杨芙清院士、陈钟院长、徐雅文常务副院长、苏渭珍副院长、白志强书记、吴中海副院长及全体教职员工和新同学参加了开学典礼。会议由党委书记白志强教授主持，杨芙清院士作了题为“坚持自主创新，推动我国软件产业持续发展”的重要报告，陈钟院长在开学典礼上作了重要讲话，教师代表高培椿教授和新老学生代表也在开学典礼上作了发言。
 
        9月19日下午，北京大学软件与微电子学院保持共产党员先进性教育活动动员部署大会在教学楼3303举行。大会贯彻落实北京大学保持共产党员先进性教育活动精神，对我院从2005年9月中旬到12月中旬在全院党员中开展的保持共产党员先进性教育活动进行了全面动员和部署。　　出席大会的有北京大学软件与微电子学院院长陈钟、党委书记白志强、副院长苏渭珍等学院领导。大会由学生工作办公室王柏艳老师主持，学院党委委员、基层党支部负责人、各党支部干部、教师及学生党员等200余人出席了大会。　　白志强书记作了《北京大学软件与微电子学院保持共产党员先进性教育活动动员报告》，他分别以开展先进性教育活动的重要性和必要性、开展先进性教育活动的指导思想和目标要求、开展先进性教育活动的指导原则、开展先进性教育活动的总体安排和方法步骤等四个方面谈起，结合软件与微电子学院自身发展特点，号召广大党员同志坚持理论联系实际，求真务实，立足本职工作，不断提高自身素质，勇于承担时代赋予的重任，起到党员应有的模范带头作用，为把我院办成世界一流的软件与微电子学院而不懈奋斗。　　结合保持共产党员先进性教育活动的重要精神，中共中央党校李国芳博士作了《全面认识抗日战争中的若干问题》的报告。　　这次大会，是先进性教育活动报告会的第一场，既是在我院开展的一次广泛的思想动员，也是一次全面的工作部署，标志着北京大学软件与微电子学院保持共产党员先进性教育活动的正式开始。
         2006年5月20日上午，北京市市委书记刘淇、市长王岐山、教育工委书记朱善璐、市委秘书长孙政才等北京市党政主要领导在北京大学常务副校长林建华教授、北京大学信息与工程科学学部主任、北京大学软件与微电子学院理事长杨芙清院士和大兴区委书记沈宝昌、区长林克庆等有关领导的陪同下，到北京大学大兴校区参观视察，并举行了“文化创意产业发展情况调研”座谈会。座谈会议由刘淇书记主持，杨芙清院士在会上作了“文化创意产业与数字艺术创新人才培养”的汇报，沈宝昌书记在会上作了“国家新媒体产业基地建设情况” 的汇报，刘淇书记、王岐山市长等市领导在会上作了重要讲话。
        2015年10月22日，美国国际科技大学校长Greg O'Brien、教务长Karl Wang一行访问北京大学。北京大学软件与微电子学党委书记陈向群、副院长林慧苹在理科一号楼1504会议室会见了来访客人，微纳电子与嵌入式系统学科组副组长林金龙、于敦山等参加会见。
       会谈中，陈向群介绍了我国推进创新创业发展的思路，她指出北京大学是我国创新创业的资源富集地，北大软微学院的科技创新氛围浓厚，已经涌现出多个创新创业团队。美国国际科技大学Greg O'Brien校长祝贺我院在学生创新创业培养中取得的成果，介绍了美国国际科技大学在硅谷校区设立科技创新实践基地的实施方案和对国际化复合型人才的培养理念。
       林慧苹介绍了北大软件与微电子学院第二学士学位的培养。美国国际科技大学教务长Karl Wang表示希望与我院软件工程第二学士学位培养开展国际合作。
       讨论后，林慧苹副院长与Greg O'Brien校长签署了我院与美国国际科技大学针对双方国际合作的补充协议。
 
         1月21日下午，中国国际人才交流基金会胡国浩主任一行来到北京大学软件与微电子学院，听取了陈钟院长的工作汇报，并就国家软件人才国际培训（北京）基地的工作开展了讨论。胡主任谈到学院的办学适应市场经济的需求，办学方向正确，打破了传统的办学模式，学院的生命力也很强，国际化特点明显，根据企业的需求来培养学生，有利于学生的就业。胡主任还表示，在今后的国际交流方面，基金会仍旧会大力支持学院，并希望学院越办越好。
      2006年6月15日上午，美国工程院院士、卡耐基梅隆大学院前教务长Angel G. Jordan教授访问北京大学，学院理事长杨芙清院士、副院长吴中海教授接待了来访。双方就软件工程人才培养和学科建设等问题交换了意见，并对示范性软件学院的发展历程进行了回顾。Angel G. Jordan教授对北京大学软件与微电子学院所取得的成就给予了很高的赞誉。
    
       软件与微电子学院在“面向产业，培养人才；面向需求，建设学科；面向领域，凝炼方向”的发展理念指导下，注重在各个环节提高学生的综合素质，为学院毕业生在创新创业的道路上打下了坚实的基础。2015年3月23日，软件与微电子学院常务副院长杜鹏在四川成都天府软件园考察了学院毕业生就业与创业情况，并与部分校友进行座谈。软微学院2013届毕业生李其恩和2008届毕业生包峰铭在四川成都天府软件园分享了他们在创业道路上的心得体会。
       李其恩在谈到如何处理梦想和现实之间的关系时说道：“我们公司在刚成立的时候就确立了团队成员必须有‘做到极致’这一共同梦想的原则，因此，公司名字叫做‘有梦’，我们在创意和技术上坚持小步快走的办法，虽然短期内会增加一定的成本，但产品本身的品质和团队成员的素质都得到了业界前辈的广泛认可，现在公司有三款产品，有些已经上线并盈利，另有一款欧美奇幻风格的即时战略类手游和一款跑酷类手游正在后期测试。”李其恩创立的公司刚刚成立一年，取得这样的成绩来之不易。
      9月16日上午，北京大学2013级电子与信息领域工程博士研究生开学典礼在英杰交流中心隆重举行。中国科学院院士、微电子学研究院首席科学家、软件与微电子学院学术委员会主任王阳元，北京大学研究生院副院长刘明利、北京大学副秘书长白志强，软件与微电子学院、软件工程国家工程研究中心、信息科学技术学院软件研究所和微电子学研究院的领导、老师，北京大学电子与信息领域工程博士试点培养合作企业的代表、企业导师，以及2013级全体新生参加了开学典礼。开学典礼由2012级工程博士研究生李方平主持。
 
  
      北京大学研究生院副院长刘明利指出，设置工程博士学位是为了适应创新型国家建设对高层次工程技术人才特别是能够发挥领军作用的高端人才的需求，完善我国工程技术人才培养体系。刘明利副院长充分肯定了软件与微电子学院在工程硕士、工程博士培养模式的探索与实践，对合作企业长期以来对北京大学的支持表示了感谢，希望继续深化校企合作，培养未来领军人才。他希望同学们珍惜来之不易的深造机会，并引用王恩哥校长的话勉励同学。“人的追求要有两个极致，一个是把自身的潜力发挥到极致，一个是把自己的寿命延长到极致”，“做一个对自己有更高要求的人”。
 
 
      随后，北京大学研究生院副院长刘明利与北京大学副秘书长白志强共同为七家合作企业授“北京大学电子与信息领域工程博士研究生工作站”牌。博士生导师和企业导师分别为九名新生佩戴了北京大学校徽和胸花。 
  
      2012级史劲峰同学和2013级刘岭同学分别作为老生代表和新生代表发言。
      开学典礼在雄壮的国歌声中拉开帷幕。首先由张兴院长致辞，他代表软件与微电子学院向到场的各位嘉宾表示欢迎，并向2013级新生表示祝贺。张兴院长简要介绍了工程博士培养的有关情况，他说，与学术型博士（理学或工学）不同，工程博士的培养主要通过解决重大的工程问题，从工程问题中提炼出理论和方法，从而提升工程技术创新的能力。张兴院长提醒工程博士研究生在学习中注意三个方面：一是要平衡好博与专的关系，二是要掌握好学习与研究的方法，三是要注意培养团队精神。
       软微学院还有很多像李其恩和包峰铭这样敢于创新创业的优秀毕业生，分享他们走出校门后的 “实战”经历给在校的学弟学妹带来了启发，他们的精神也一直在鼓励同学们志存高远，勤奋坚韧，为母校、为自己的人生交上满意的答卷。
 
      北京大学软件工程国家工程研究中心主任张世琨教授代表博士生导师发言，他希望工程博士研究生在读期间，要注重专业素养和工程创新能力的全面提升，在学校和企业间起到桥梁和纽带的作用。 
 
      最后，中国科学院院士、微电子学研究院首席科学家、软件与微电子学院学术委员会主任王阳元从国家经济发展和战略转型的大背景、科技与生产相结合的深层次问题、高层次人才培养模式等三方面，阐述了工程博士培养的重大意义。他对2013级工程博士研究生提出了四点要求：一是要具备高素质，有内涵，把自己的事业的与国家的复兴、民族的需求、人民的需要，紧紧联系在一起，终身为之奋斗；二是要注重创新，成为一个创新的源泉，流向产业，流向老百姓的生活；三是要培养提出问题、分析问题、解决问题的能力，从成产实践中提出问题，在解决问题过程中要容忍失败；四是要有团结、包容之心，多看他人的优点，多看自己的缺点，以团队的精神来克服各种困难。
 
      中国航天科技集团总工程师杨海成代表企业导师发言，他说，北京大学和中国航天科技集团联合培养工程博士将有助于搭建起北大学术前沿研究和航天科技重大工程实践相结合的创新平台，他希望工程博士的培养为我们的“航天梦”，为我们的“中国梦”做出新的卓越的贡献。
       包峰铭是二次创业，他创立的公司是苹果公司全球推荐手游的研发商。杜鹏了解到，部分应届毕业生不了解成都的就业环境，更愿意留在北京、上海等传统一线城市工作。他说，软件与微电子学院具有国内尖端的研发力量和优秀的师生资源，北大学子应当胸怀宽广，志存高远。软微的毕业生不仅可以在北上广等一线城市谋求发展，也可以在成都这个西部中心城市占据一片天地。
      在《歌唱祖国》的序曲中，北京大学2013级电子与信息领域工程博士研究生开学典礼顺利闭幕。
 
       2016年1月17日，北京大学2016软微创新创业新年论坛在北京大学秋林报告厅隆重开幕。本届论坛以“引领变革时代 寻找下一个独角兽”为主题，主论坛和分论坛来自政、商、学界共五十多位嘉宾分别从金融、教育、科技以及绿色环保等不同角度，围绕创新创业深入研讨，共同展望，为社会发展建言献策。本届论坛由北京大学软件与微电子学院校友会主办。
       北京大学党委副书记叶静漪应邀发表主论坛致辞。她首先表达了对此次论坛的期待与祝福，并介绍了北京大学创新创业教育的历史以及北大校友创业的优良传统。她指出，创新已逐渐成为了北大的一种作风与办学理念，近年来北京大学努力开展创新创业教育工作，协同推进全校上下包括教务部、学工部、校友会、就业指导中心、相关院系等单位开展创新创业教育培养，形成了蓬勃向上的创新创业教育生态体系，取得了较好的成绩，这也为下一步创新创业教育奠定了很好的基础。叶静漪提出，高校创新创业工作的重点是教育，而教育的目标在于培养学生的创新创业意识，使之终生受益。在创新创业方面加强教育，应完善课程设置，促进资源整合，加强市场对接，尽可能在创新创业的大潮中为在校生和校友的创业活动以及培养创新创业能力方面提供支持与帮助。
       北京大学校友办公室主任、北京大学校友总会秘书长李宇宁从北大的创新创业精神说起，介绍了北大校友创业活动的历史：从90年代起北大就有创业比赛，2012年，“北京大学创新创业扶持计划”项目启动，首次开设带学分的创业公选课程，随后，北京大学校友会建立北京大学创业训练营，汇集各界优秀校友，整合校友资源。可以说，北大一直在支持校友的创新创业活动。
       北京大学软件与微电子学院院长张兴随后为论坛致辞。他首先介绍了学院的发展历史，并指出：学院自成立以来，经过了十几年的前行摸索，已逐渐形成了较为完善的创新创业人才培养体系。与此同时，学院从加强素质教育、学科交叉与融合、强调互动式学习以及采用学苑式管理增强学生自我管理能力，在培养创新创业精神的优秀人才过程中不断探索。张兴表示，母校希望在创业方面取得一定成就的校友们能够经常与师弟师妹们分享自己的经验与体会，促进学院发展的同时，为社会输送更多创新创业领域的新鲜血液。
       随后，论坛举行了“2015软微创新创业之星”颁奖典礼，此次论坛有5位在创新创业方面取得优秀成绩的校友荣获“2015软微创新创业之星奖”，7位为软微创新创业方面做出突出贡献的校友荣获“2015软微创新创业特殊贡献奖”。北京大学软件与微电子学院党委书记、北京大学软件与微电子学院校友会会长陈向群作为颁奖嘉宾为获奖校友颁奖，并发表了讲话。
       随后，北京大学软件与微电子学院副院长林慧苹作了以“软微创新创业”为主题的报告。林慧苹分享了软件与微电子学院在人才培养方面的经验与个人体会，她从学院建院定位、教育理念、学院学科设置的发展历程等方面介绍了学院的基本状况。她提到，学院的真正目标并不是让在校学生和校友都去创业，而是让他们拥有创新的思维、开拓的思路，为他们提供创新的起点。
       国务院参事汤敏教授进行了主题为“能不能不创业”的讲话，汤敏教授提出了自己对创业“不同的看法”。汤敏认为未来社会将会是个性化张扬的社会，要满足个性化消费，个性化生产，会需要很多企业。这样的企业不会很大，因为大型的企业满足不了个性化的需求。会需要更多的人来进行创业，未来，创业会变成社会必需品。现场观众反响热烈，为主会场论坛画上了圆满的句号。
       快书包CEO徐智明进行了经验分享。徐智明先生通过剖析自己创业过程中的失败经历，提出了从自身经验中总结的用人方面的三点误区，并分享了宝贵的创业经验。
       本次论坛由北京大学软件与微电子学院金融信息与管理技术学科组副组长黄嵩主持。作为北大软微学院的教师和北大校友，黄嵩在论坛多个环节表达了自己对学校创新创业教育和软微校友创业的信心和肯定。
       陈向群首先表达了对校友们的感谢，肯定了校友们对创新创业做出的贡献，并表示希望聘请这些优秀校友成为软微的创新创业导师，为在校师弟师妹指导或分享成功或失败的经验。5位“2015软微创新创业之星奖”获得者随后向在场观众分享了自己在创业道路上的经验与体会。
       此次论坛还结合金融教育，科技以及绿色环保等话题，在晚上举行了四场平行分论坛，与会嘉宾分别就“企业发展如何对接资本市场”、“科技创新如何变革教育”、“文化创业现在的趋势以及未来发展”、“创造未来的智能硬件”等主题进行了讨论。
       2015年9月19日，国内首家人力资源大数据联合实验室揭牌仪式在北京大学英杰交流中心月光厅隆重举行，北京大学软件与微电子学院院长张兴教授、副院长吴中海教授、院长助理李影教授、金融信息与管理技术领域学科组刘宏志副教授等和看准网创始人赵鹏等公司高管出席此次揭牌仪式。仪式由学院副院长吴中海教授主持。
       随后，张兴院长和看准网创始人赵鹏共同为人力资源大数据联合实验室揭牌。
       张兴院长致辞，他指出，软微学院有着深厚的技术积累，和看准网在人力资源大数据这样的前沿领域的合作将会对未来社会的发展起推动作用。
       揭牌后，看准网创始人赵鹏从自身经历说起，结合当前严峻的就业形势和其多年在人力资源领域的耕耘成果，和同学们分享了应该如何正确地面对并选择就业和创业。随后，看准网的其他高层和同学们分享了就业和创业过程中的一些切身经验，同学们提问踊跃，现场气氛十分热烈。
           2005年10月10日上午,法国动画专家FrancoisBernard先生来我院作精彩讲座.他是法国人，是动画片《LesTriplettes De Belleville（美丽城三重奏）》的制片经理，该动画片获得奥斯卡奖提名,并多次获得其他国际性奖项，如最佳长片动画奖等。 他也是动画片《KIRIKOU（叽里咕与女巫）》的制片主任,在动画领域享有较高的声誉。 　　本次讲座在3204教室举行，白志强副院长出席了此次讲座。FrancoisBernard先生主要给大家讲述了该动画片的制作过程，同学们从中得到许多启示，FrancoisBernard先生还回答了很多同学的提问，气氛非常活跃。讲座之后，同学们又与FrancoisBernard先生作了进一步的交流。　　当天下午，FrancoisBernard先生与数字艺术系王强副主任等老师就与学院进行合作的事项进行了交流，如果合作事宜能顺利进行的话，这将是软件与微电子学院数字艺术系接轨国际动画技术的一个重要机遇。
       本月初，软件与微电子学院喜报频传，其数字艺术系学生作品分别在“北京电影学院第六届动画学院奖”、“第二届中国学院奖”等大赛中获得多项大奖。
 
       6月26日上午，国家外国专家局中国国际人才交流基金会副主任刘昇一行来到国家软件人才国际培训（北京）基地调研，北京大学软件与微电子学院院长张兴、院长助理李伟平、综合办公室主任倪际航等接待了调研组一行。
       会上，张兴感谢国家外国专家局多年来对北京大学软件与微电子学院的大力支持，并介绍了学院创新创业、交叉学科、产、学、研、用等方面的特色，以及对国际人才交流方面的需求。
       刘昇高度赞赏了北京基地在学院领导的带领下所做的工作。他表示，软件与微电子学院要继续发挥基地优势，突出特色，中国国国际人才交流基金会也将尽最大努力为基地的引智引才工作服务。
       2013年10月18日晚19：00，北京大学第22届“挑战杯”系列赛事宣讲会软微专场在大兴校区教学楼3202举行。整个教室座无虚席，近120余名同学到场，院团委书记张强老师、校团委学术科创部黎泉同学、第21届“挑战杯”特等奖获得者软微学院12级学生贾堂参加了此次活动。
       随后，院团委书记张强老师进行了总结发言。他首先对各位同学的学术热情表示肯定，希望有意参与的同学们在比赛过程中加强团队协作，勇于创新，注重实践，将软件与微电子学院崇尚学术和注重实践的良好风气传承下去，在第22届“挑战杯”系列赛事中取得更好的成绩。
       活动由院团委副书记朱津函同学主持。首先校团委学术科创部黎泉同学介绍了“挑战杯”系列赛事的整体情况，报名的流程以及在比赛过程中需要注意的问题。随后，第21届“挑战杯”特等奖获得者、软件与微电子学院12级贾堂同学同大家分享了参加该项比赛的心得、体会和收获。期间同学们踊跃发言，就比赛中的选题和指导老师的确定、以及团队管理等问题向他们进行了提问。
       会议最后，各位老师与同学们合影留念，会议在热烈的气氛中圆满结束。此次宣讲会的目的旨在进一步加深大家对“挑战杯”的理解和认识，激发同学们参加“挑战杯”系列赛事的热情，活跃我院同学积极参与科研活动的氛围。
         
        2004年北京大学党校软件学院分校于4月28日第一次授课开始，至6月9日全体学员结业。参加此次党校的学员为：付卫兵，高磊，蓝岩华，雷嘉，李康昊，李圣男，李世荣，李想，李晓芃，李洋，梁禹，林涛，刘传梅，刘国栋，罗恩韬，马尔东，钱超，任静，邵飞，孙海明，王娜，王倩，王玮，邬国锐，许英，严康，杨海，余丹，赵国庆，卓玲。学员们在党校授课期间认真学习，表现良好，在讨论中积极发言，并在结业考试中取得了好成绩。所有成员都顺利结业，并获得结业证书。在此祝贺所有学员，并期望在今后的学习和工作中再接再励，不断提高，严格要求自己，积极向党组织靠拢。软件学院党委2004年6月17日
 
        2002年12月19日，北京大学工程硕士专业学位分会第四次会议在北京大学大兴校区召开，会议由工程硕士专业学位分会主席杨芙清院士主持，导师分别介绍了参加评审学生的论文情况，经过会议审议和无记名投票，同意188名学生授予工程硕士学位。 
　　【来源：北京日报】  　　本报讯(记者刘昊)“同学们，我希望你们勇敢地迎接挑战，不断学习创新，为祖国、为人民做出更大的贡献！”中科院院士杨芙清教授语重心长的教诲话音刚落，人民大会堂里3000余名首都高校学子的热烈掌声经久不息。来自中科院、中国工程院的五名院士日前为首都高校学子作了一场精彩的“创新”主题报告会。市委常委、教育工委书记朱善璐，副市长赵凤桐会见了五位院士并听了报告会。
　　据介绍，这是本市首次组织院士报告团，五位“两院”院士一起面对学子在本市也是首次。主持研制成功我国第一台百万次集成电路计算机多道运行操作系统的中科院院士、北京大学杨芙清教授；我国自行研制成功的首台1MW发电用燃气轮机和3500马力机车燃气轮机的主要参与者、工程院院士、清华大学倪维斗教授；航空发动机领域有突出贡献的工程院院士、北京航空航天大学陈懋章教授；雷达专家、工程院院士、北京理工大学毛二可教授以及血管外科与基本外科临床和基础研究专家、中科院院士、首都医科大学汪忠镐教授，五位院士组成阵容强大的报告团，用他们的亲身体验为北大、清华、北工大、首师大等高校3000余名学子讲述了他们为学为师和科学研究的人生经历，讲述了他们对科技创新的独特见解。
    北京大学软件与微电子学院从未自己或与他人合作举办过任何“北京大学数字艺术系考研辅导”和“北京大学数字艺术系考研王牌协议保过班”项目。上述招录行为均与北京大学软件与微电子学院无关。 
   鉴于该博客已损害了北京大学软件与微电子学院的名誉，学院将在适当的时机追究信息发布者的法律责任。 
    近期，有机构或个人使用北大标识在新浪网博客中发布由“北京大学软件与微电子学院数字艺术系考研项目组主办”的“北京大学数字艺术系考研王牌协议保过班”、“2012年北京大学数字艺术系考研辅导课程计划总表”以及收取高额费用确保成功录取等信息，现就此声明如下： 
     特此声明。 
 
                                            2011年5月24日
                                     北京大学软件与微电子学院 
       2015年7月27日至8月17日，北京大学软件与微电子学院响应北京大学向社会共享教学资源的精神，成功举办了首期北京大学暑期创新培训班，为有志于成为创新人才的优秀青年提供了北京大学国际化学术生活和步入社会职业发展的全方位体验。来自全国六十余所高校的一百多名学员，全程积极主动身心投入，以班级为单位开展学习和研讨，以小组为单位进行调研和比赛，以个人为单位完成作业和报告，最终以商业策划案和结业展示的形式完成课程。全体学员都以高质量的达标通过考核，顺利获得北京大学结业证书，其中更有三十多位同学表现优异获得由学院领导签署的推荐信以资鼓励。课程学员更一致表示，最初参加项目的时候“因为北大所以选择软微”，经过暑期的学习和体验，深刻感到软微的学术氛围和创新魅力，将“因为软微所以选择北大”。
       7月27日，北大暑期创新培训班正式拉开帷幕。开幕仪式上，北大软件与微电子学院陈向群书记，吴中海副院长以及林慧苹副院长发表了热情洋溢的讲话，勉励同学珍惜来之不易的学习机会，学有所用，为北大争光，期望同学传承北大的历史传统，并将自己的理想与未来同国家的发展和命运紧密联系在一起，做一名真正的北大人。
       8月17日，项目闭幕式上，北大软微学院常务副院长杜鹏老师担任商业策划案评委。他对同学们的表现进行了高度评价，表达了对同学们成长成才的欣慰和对美好未来的期许，肯定了同学们一周的学习与生活，让同学们在各方面都得到了长足进步，他为同学们所获得的知识、能力、精神感到骄傲，鼓励大家在走出北大后，依旧能够不忘初心、无畏前行。参赛的各小组依次上台进行商业策划案展示，每小组各有特色，不仅是策划案吸引了大家的眼球，他们制作的PPT更是一个赛一个的精致和别出心裁。同学们的项目中既有开展“home party”厨师租赁的项目，也有建立创新型的英语培训班项目，还有校园社交app的创新。学员的创意涵盖了各行各业，从餐饮到社交，从娱乐到教育，充分展现了同学们各不相同的专业背景的活跃思维。策划案结束后，学员分组展示了结业报告，分享了各组最大的三个收获、最难忘的三个瞬间、最深刻的三个观点以及最期待的三个愿望。
       学员们普遍认为本次培训班，时间安排紧凑，内容丰富多彩，形式灵活多样。通过培训，学员们达到了相互交流、开阔眼界、培养能力、提供示范的目的。学员表示虽然来到北大只有短短的一个星期，但是北大精神却将永远存留在他们的心中，希望以后能有机会来到北大继续深造。回去以后积极思考，扎实学习，把所学的知识运用到实践中，为未来的创业之路积攒更多的力量。
       杜鹏老师鼓励大家，希望各位同学能吸收这次培训的精华，潜心思考，自我超越，以北大精神，启示于来路。“今日同窗、明日校友”，期望来自全国各地的同学们在这短短的一周时间里，不仅能够学习实战知识，而且还能结交事业发展的伙伴，在未来的创业发展道路上取得辉煌的成绩。北京大学软件与微电子学院暑期创新培训课程至此画上了圆满的句号。
       学习过程中，授课老师与同学充分交流，为同学们展示了北京大学的魅力——北京大学是享誉中外的著名学府，是莘莘学子向往的殿堂，是培养思想家、科学家、艺术家的摇篮，希望同学们能秉承北大的光荣传统，将北大精神继续发扬光大。北京大学软微学院一直探索一条多途径合作办学的管理运行之路，同时，为了培养“面向产业、面向领域、高层次、实用型、复合交叉型、国际化”的人才目标，学院与诸多国内外知名企业合作，采取“双导师”机制培养学生，积极探索“政产学研用协同创新”的高等工程教育新模式，形成了学校、企业、学生多赢的局面。
       通过学习同学们深刻认识到随着经济社会的发展，任何企业都不可避免地面临新的机遇和挑战，创业也面临着更加艰巨的挑战。而读书，是获取知识、提高素质、超越自我的重要前提和有效途径。《大学》有言，“静而后能安，安而后能虑，虑而后能得”。授课教师勉励同学们静心求学，潜心思考，为未来的事业与人生发展积累一股正能量；要求同学们“珍惜学习机会”、“圆满完成学习任务”、“ 严格遵守培训纪律”。并且作为创新人才，期待同学们还必须具有独立思考的能力和批判性思维。最后预祝全体学员们珍惜北大创造的这次难得的机会，更好地发现自己，实现自己。
       北京大学暑期创新培训班主要由精品课程、商业模拟比赛与商业策划案组成。北大软微学院顶尖老师以及各行业的创新创业领军人物带领大家一同探讨，一同学习在创新创业方面的知识，例如互联网金融，创业项目管理，创业与法律，创造力的心理学视角等多角度开拓大家对于创新创业的认识。商业模拟比赛与商业策划案以小组为单位，主要目标是通过培养和支持在校生在创业环节的能力的塑造和养成，通过对创业公司从0到1阶段各项任务的实践，以及商业计划书的撰写，全面模拟创业公司早期的重要环节，以达到“学以致用”的目的。项目期间安排了知名校友经验分享、北大校园实地考察和业界交流等新环节，给学员创造充分的交流沟通及向相关业界学习的机会，极大地丰富了学员的学习内容，努力将专业管理知识学习与企业实践相结合，真正帮助学员更加深入地理解当前我国宏观经济运行状况，充分领会创新创业的切入点，增强同学们的创新力和创业的能力。
       同学们普遍积极性很高，主观能动性很强，如饥似渴地学习，力求取得好成绩并拿到最终比赛的胜利。据多位同学反映，课程期间常常以小组为单位组织讨论，头脑风暴，大家在分享中学习，在疑问中探索，在知识中徜徉，为期一周的项目下来感到收获颇丰。不仅仅学到最新的创新创业方面的知识，更重要的是打开了思路，开拓了视野，与北大的顶尖教授近距离对话，与企业高管平等交流，创新培训班为大家创造如此难得的机会让他们离自己的创业梦想更近了一步。
 
    2007年7月18日，UML创始人之一、雅各布森国际股份有限公司董事长Ivar Jacobson博士，大中华区总裁陈致平先生一行来访。学院理事长杨芙清院士、苏渭珍副院长、吴中海副院长接待了来访。双方就软件工程领域的合作事宜进行了交流。
        2004年5月21日，以学会主席Carl K. Chang博士为团长的IEEE计算机学会高级代表团访问北京大学。北京大学常务副校长迟惠生教授、软件与微电子学院理事长杨芙清院士、院长陈钟教授、校国际合作部李岩松部长等会见了该代表团。双方就北京大学与IEEE计算机学会合作开展科学研究、人才培养等方面进行了亲切友好的交谈。会见期间，杨芙清院士代表北京大学软件与微电子学院理事会向Carl K. Chang博士颁发了北京大学软件与微电子学院国际顾问的聘书。当晚，由北京大学软件与微电子学院承办，IEEE计算机学会与北京计算机学会联合主办，中国软件行业协会、中国国际人才交流基金会、中关村科技园海淀园管委会支持的招待会在北京长城饭店隆重举行。包括北大、清华、中科院，IBM中国研究院、Motorola中国研究院、联想研究院等在京的学术界、工业界的70多名教授、学者、研究员出席了招待会。22日上午，Carl K. Chang博士为北京大学软件与微电子学院师生作了题为"Distributed Systems Design using Function-Class Decomposition with Aspects"的精彩学术报告。
    8月1日上午，西北工业大学软件与微电子学院客人来访，北京大学大学软件与微电子学院吴中海副院长、综合办张光红主任参加了接待会，双方就示范性软件学院的行政管理、对外合作等方面的经验进行了交流。
      2005年12月4日，夜幕降临，华灯初上，百周年纪念大讲堂内座无虚席，大家期待已久的北京大学每年一度的传统活动项目“纪念一二•九师生歌咏比赛”如约而至。由七十多名老师和学生代表组成的我院合唱队参加了此次比赛。合唱队在王永文老师的指挥下，深情演唱了《我和我的祖国》.。而一首充满陕北风情的《山丹丹花开红艳艳》，优美婉转的女声将观众带入了黄土高坡和朴素的民间风情，合声部的抑扬顿挫，及团结一心的气势，赢得了在场观众和评委的热烈掌声，得到了充分的肯定。　　最后，我院合唱队凭借悠扬的歌声,深情的演绎,惊艳的舞台效果，以94.5分取得了三等奖的好成绩，充分展现了我院师生的风采。　　我院历来非常重视”一二•九大合唱，将其作为我院的一项精品活动。每次参加都会努力排练,全力准备,力争好成绩，已经连续两次获得第三名的好成绩。每到比赛时,无论从报名动员,歌曲选择,形式安排,到挑选领唱,指挥,教歌排练,服装选择,我院的同学都是齐心协力。学院作为我们坚强的后盾,从财力,物力,人力上都给予了极大的支持,让同学们备受鼓舞。　　回首这段走过的路程，每个同学都在为了共同的目标而努力着，我们都在感动着彼此同时又被感动着.在这段难忘的过程中,点点滴滴都已成为我们值得一生珍藏的回忆.这条路,很辛苦,但回首来时路,无怨无悔。
   北京大学ACOM金融信息化研究中心（以下简称PAFIRC）作为北京大学的交叉学科研究机构，自成立以来，已开展了三期的课题公开招标工作，完成或正在进行着数十个科研项目。本期公开招标将继续重点关注小额信贷与个人信用方面的学术研究和应用探索；同时兼顾对金融及其信息化领域的热点问题研究。本期公开招标面向校内外的教师及科研人员，现将有关招标课题等简要事项予以公告，详细情况与PAFIRC直接联系。
　　导报讯 （记者 陈元钦） 今年北大将为厦门培养软件中高级人才３２０人。记者昨日获悉，由北京大学软件与微电子学院、厦门软件技术促进中心和厦门邦初培训中心联手实施的“北大软件技术与管理系列高级研修班”本月启动。
　　相关人士表示，此次与北大的项目合作将充分借鉴北大在软件技术、人才培养、行业影响的优势，合力打造厦门ＩＴ人才链，从而推动厦门软件业的发展。
　　据了解，经北大批准的今年培养计划为：研修班４期共１２０人，首期定于６月初开课；软件开发实训为８个班共２００人，首期定于４月初开班，学员仍在最后遴选中。
        尽管准备策划时间短，但是软微学院新生与江南大学学生代表各自上台表演的节目精彩纷呈，获得台下阵阵掌声；节目间隙并穿插互动有奖环节，更把晚会推向高潮。晚会还为大家派发月饼和水果。
 
     注：1、6月24日―7月2日暑期双休日图书馆阅览室闭馆；201、301、401自习室照常开放。
                                                                                图  书  馆
                  3、9月4日起恢复正常开馆。
                  2、7月8日—9月3日暑期双休日图书馆闭馆。
                                                                          2006年6月22日     以上为北大馆署假期间开放时间，我学院图书馆因为系统的关系只在以上时间内可以借还书，其它时间读者可以阅览。提醒：在此期间图书到期的同学要及时续借或归还！！
       2015年11月24日，国家外国专家局在武汉召开2015年国家软件与集成电路人才国际培训基地管委会会议。国家外专局、相关部委领导以及来自各省市培训基地管委会成员、相关高校、研究机构、企业和基金会代表参加了会议。国家软件与集成电路人才国际培训（北京）基地代表、北京大学软件与微电子学院常务副院长吴中海出席会议。
       国家外国专家局副局长陆明总结了基地建设工作的成果、经验和不足，肯定了各基地取得的成绩,结合国家信息产业发展战略和人才发展规划要求对基地未来的建设提出了要求与建议。
       随后，相关领域专家代表讲话。北京大学软件与微电子学院常务副院长吴中海就“国家示范性微电子学院建设思路”及“创新创业型人才培养情况”在大会上作了发言。吴中海表示，建设国家示范性微电子学院，一是要贴近产业，实现校企深度融合，深入开展产学合作协同育人 ，建立长效机制；二是要发挥北大软件与微电子学科相结合的优势，培养复合型人才。在“创新创业型人才培养情况”方面，吴中海向与会人员展示了北大软微学院部分校友创新创业的实例，并介绍了学院为适应“双创”、“四众”等国家战略需要在育人方面所采取的一系列有效措施，引起了与会人员的强烈共鸣。
 
       此次会议，进一步落实了国家关于软件与集成电路产业发展和人才培养的政策，与会领导和专家深入探讨了各培训基地未来发展方向和重点工作，将对国家软件与集成电路人才培养起到推动作用。
